eeucalyptus/at32f403a_minimal/at32f403a.h
#ifndef AT32F403A_H_
#define AT32F403A_H_
#include <stdint.h>

#define ACC_BASE             0x40015800 /* 0x40015800-0x40015bff: 1kB HICK Auto Clock Calibration */
#define ADC1_BASE            0x40012400 /* 0x40012400-0x400127ff: 1kB Analog to digital converter */
#define ADC2_BASE            0x40012800 /* 0x40012800-0x40012bff: 1kB Analog to digital converter */
#define ADC3_BASE            0x40013c00 /* 0x40013c00-0x40013fff: 1kB Analog to digital converter */
#define BPR_BASE             0x40006c04 /* 0x40006c04-0x40006fff: 1kB Battery powered register */
#define CAN1_BASE            0x40006400 /* 0x40006400-0x400067ff: 1kB Can controller area network */
#define CAN2_BASE            0x40006800 /* 0x40006800-0x40006bff: 1kB CAN2 */
#define CRC_BASE             0x40023000 /* 0x40023000-0x400233ff: 1kB CRC calculation unit */
#define CRM_BASE             0x40021000 /* 0x40021000-0x400213ff: 1kB Clock and reset management */
#define DAC_BASE             0x40007400 /* 0x40007400-0x400077ff: 1kB Digital to analog converter */
#define DEBUG_BASE           0xe0042000 /* 0xe0042000-0xe00423ff: 1kB Debug support */
#define DMA1_BASE            0x40020000 /* 0x40020000-0x400203ff: 1kB DMA controller */
#define DMA2_BASE            0x40020400 /* 0x40020400-0x400207ff: 1kB DMA2 */
#define EXINT_BASE           0x40010400 /* 0x40010400-0x400107ff: 1kB EXINT */
#define FLASH_BASE           0x40022000 /* 0x40022000-0x400223ff: 1kB Flash memory controler */
#define GPIOA_BASE           0x40010800 /* 0x40010800-0x40010bff: 1kB General purpose IO */
#define GPIOB_BASE           0x40010c00 /* 0x40010c00-0x40010fff: 1kB GPIOB */
#define GPIOC_BASE           0x40011000 /* 0x40011000-0x400113ff: 1kB GPIOC */
#define GPIOD_BASE           0x40011400 /* 0x40011400-0x400117ff: 1kB GPIOD */
#define GPIOE_BASE           0x40011800 /* 0x40011800-0x40011bff: 1kB GPIOE */
#define I2C1_BASE            0x40005400 /* 0x40005400-0x400057ff: 1kB Inter integrated circuit */
#define I2C2_BASE            0x40005800 /* 0x40005800-0x40005bff: 1kB I2C2 */
#define I2C3_BASE            0x40015c00 /* 0x40015c00-0x40015fff: 1kB I2C3 */
// #define I2S2_EXT_BASE        0x40016c00 /* 0x40016c00-0x40016fff: 1kB I2S2_EXT */
// #define I2S3_EXT_BASE        0x40017000 /* 0x40017000-0x400173ff: 1kB I2S3_EXT */
#define IOMUX_BASE           0x40010000 /* 0x40010000-0x400103ff: 1kB IO MUX function */
#define PWC_BASE             0x40007000 /* 0x40007000-0x400073ff: 1kB Power control */
#define RTC_BASE             0x40002800 /* 0x40002800-0x40002bff: 1kB Real time clock */
#define SDIO1_BASE           0x40018000 /* 0x40018000-0x400183ff: 1kB Secure digital input/output interface */
#define SDIO2_BASE           0x40023400 /* 0x40023400-0x400237ff: 1kB SDIO2 */
#define SPI1_BASE            0x40013000 /* 0x40013000-0x400133ff: 1kB Serial peripheral interface */
#define SPI2_BASE            0x40003800 /* 0x40003800-0x40003bff: 1kB SPI2 */
#define SPI3_BASE            0x40003c00 /* 0x40003c00-0x40003fff: 1kB SPI3 */
#define SPI4_BASE            0x40004000 /* 0x40004000-0x400043ff: 1kB SPI4 */
#define TMR10_BASE           0x40015000 /* 0x40015000-0x400153ff: 1kB General purpose timer */
#define TMR11_BASE           0x40015400 /* 0x40015400-0x400157ff: 1kB TMR11 */
#define TMR12_BASE           0x40001800 /* 0x40001800-0x40001bff: 1kB TMR12 */
#define TMR13_BASE           0x40001c00 /* 0x40001c00-0x40001fff: 1kB TMR13 */
#define TMR14_BASE           0x40002000 /* 0x40002000-0x400023ff: 1kB TMR14 */
#define TMR1_BASE            0x40012c00 /* 0x40012c00-0x40012fff: 1kB Advanced timer */
#define TMR2_BASE            0x40000000 /* 0x40000000-0x400003ff: 1kB General purpose timer */
#define TMR3_BASE            0x40000400 /* 0x40000400-0x400007ff: 1kB General purpose timer */
#define TMR4_BASE            0x40000800 /* 0x40000800-0x40000bff: 1kB TMR4 */
#define TMR5_BASE            0x40000c00 /* 0x40000c00-0x40000fff: 1kB TMR5 */
#define TMR6_BASE            0x40001000 /* 0x40001000-0x400013ff: 1kB Basic timer */
#define TMR7_BASE            0x40001400 /* 0x40001400-0x400017ff: 1kB TMR7 */
#define TMR8_BASE            0x40013400 /* 0x40013400-0x400137ff: 1kB TMR8 */
#define TMR9_BASE            0x40014c00 /* 0x40014c00-0x40014fff: 1kB General purpose timer */
#define UART4_BASE           0x40004c00 /* 0x40004c00-0x40004fff: 1kB Universal asynchronous receiver transmitter */
#define UART5_BASE           0x40005000 /* 0x40005000-0x400053ff: 1kB Universal asynchronous receiver transmitter */
#define UART7_BASE           0x40016400 /* 0x40016400-0x400167ff: 1kB Universal asynchronous receiver transmitter */
#define UART8_BASE           0x40016800 /* 0x40016800-0x40016bff: 1kB Universal asynchronous receiver transmitter */
#define USART1_BASE          0x40013800 /* 0x40013800-0x40013bff: 1kB Universal synchronous asynchronous receiver transmitter */
#define USART2_BASE          0x40004400 /* 0x40004400-0x400047ff: 1kB USART2 */
#define USART3_BASE          0x40004800 /* 0x40004800-0x40004bff: 1kB USART3 */
#define USART6_BASE          0x40016000 /* 0x40016000-0x400163ff: 1kB USART6 */
// #define USBFS_BASE           0x40005c00 /* 0x40005c00-0x40005fff: 1kB Universal serial bus full-speed device interface */
#define WDT_BASE             0x40003000 /* 0x40003000-0x400033ff: 1kB Watchdog */
#define WWDT_BASE            0x40002c00 /* 0x40002c00-0x40002fff: 1kB Window watchdog */
#define XMC_BASE             0xa0000000 /* 0xa0000000-0xa0000fff: 4kB Flexible static memory controller */

#define ACC	        ((ACC_TypeDef *) ACC_BASE)
#define ADC1	    ((ADC_TypeDef *) ADC1_BASE)
#define ADC2	    ((ADC_TypeDef *) ADC2_BASE)
#define ADC3	    ((ADC_TypeDef *) ADC3_BASE)
#define BPR	        ((BPR_TypeDef *) BPR_BASE)
#define CAN1	    ((CAN_TypeDef *) CAN1_BASE)
#define CAN2	    ((CAN_TypeDef *) CAN2_BASE)
#define CRC	        ((CRC_TypeDef *) CRC_BASE)
#define CRM	        ((CRM_TypeDef *) CRM_BASE)
#define DAC	        ((DAC_TypeDef *) DAC_BASE)
#define DEBUG	    ((DEBUG_TypeDef *) DEBUG_BASE)
#define DMA1	    ((DMA_TypeDef *) DMA1_BASE)
#define DMA2	    ((DMA_TypeDef *) DMA2_BASE)
#define EXINT	    ((EXINT_TypeDef *) EXINT_BASE)
#define FLASH	    ((FLASH_TypeDef *) FLASH_BASE)
#define GPIOA	    ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB	    ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC	    ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD	    ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE	    ((GPIO_TypeDef *) GPIOE_BASE)
#define I2C1	    ((I2C_TypeDef *) I2C1_BASE)
#define I2C2	    ((I2C_TypeDef *) I2C2_BASE)
#define I2C3	    ((I2C_TypeDef *) I2C3_BASE)
#define I2S2_EXT	((I2S_TypeDef *) I2S2_EXT_BASE)
#define I2S3_EXT	((I2S_TypeDef *) I2S3_EXT_BASE)
#define IOMUX	    ((IOMUX_TypeDef *) IOMUX_BASE)
#define PWC	        ((PWC_TypeDef *) PWC_BASE)
#define RTC	        ((RTC_TypeDef *) RTC_BASE)
#define SDIO1	    ((SDIO_TypeDef *) SDIO1_BASE)
#define SDIO2	    ((SDIO_TypeDef *) SDIO2_BASE)
#define SPI1	    ((SPI_TypeDef *) SPI1_BASE)
#define SPI2	    ((SPI_TypeDef *) SPI2_BASE)
#define SPI3	    ((SPI_TypeDef *) SPI3_BASE)
#define SPI4	    ((SPI_TypeDef *) SPI4_BASE)
#define TMR10	    ((TMR_TypeDef *) TMR10_BASE)
#define TMR11	    ((TMR_TypeDef *) TMR11_BASE)
#define TMR12	    ((TMR_TypeDef *) TMR12_BASE)
#define TMR13	    ((TMR_TypeDef *) TMR13_BASE)
#define TMR14	    ((TMR_TypeDef *) TMR14_BASE)
#define TMR1	    ((TMR_TypeDef *) TMR1_BASE)
#define TMR2	    ((TMR_TypeDef *) TMR2_BASE)
#define TMR3	    ((TMR_TypeDef *) TMR3_BASE)
#define TMR4	    ((TMR_TypeDef *) TMR4_BASE)
#define TMR5	    ((TMR_TypeDef *) TMR5_BASE)
#define TMR6	    ((TMR_TypeDef *) TMR6_BASE)
#define TMR7	    ((TMR_TypeDef *) TMR7_BASE)
#define TMR8	    ((TMR_TypeDef *) TMR8_BASE)
#define TMR9	    ((TMR_TypeDef *) TMR9_BASE)
#define UART4	    ((UART_TypeDef *) UART4_BASE)
#define UART5	    ((UART_TypeDef *) UART5_BASE)
#define UART7	    ((UART_TypeDef *) UART7_BASE)
#define UART8	    ((UART_TypeDef *) UART8_BASE)
#define USART1	    ((USART_TypeDef *) USART1_BASE)
#define USART2	    ((USART_TypeDef *) USART2_BASE)
#define USART3	    ((USART_TypeDef *) USART3_BASE)
#define USART6	    ((USART_TypeDef *) USART6_BASE)
#define USBFS	    ((USBFS_TypeDef *) USBFS_BASE)
#define WDT	        ((WDT_TypeDef *) WDT_BASE)
#define WWDT	    ((WWDT_TypeDef *) WWDT_BASE)
#define XMC	        ((XMC_TypeDef *) XMC_BASE)

