eeucalyptus/at32f403a_minimal/at32f403a.h
typedef struct {
   volatile  uint32_t STS;
   volatile  uint32_t CTRL1;
   volatile  uint32_t CTRL2;
   volatile  uint32_t C1;
   volatile  uint32_t C2;
   volatile  uint32_t C3;
} ACC_TypeDef;

typedef struct {
   volatile  uint32_t STS;
   volatile  uint32_t CTRL1;
   volatile  uint32_t CTRL2;
   volatile  uint32_t SPT1;
   volatile  uint32_t SPT2;
   volatile  uint32_t PCDTO1;
   volatile  uint32_t PCDTO2;
   volatile  uint32_t PCDTO3;
   volatile  uint32_t PCDTO4;
   volatile  uint32_t VMHB;
   volatile  uint32_t VMLB;
   volatile  uint32_t OSQ1;
   volatile  uint32_t OSQ2;
   volatile  uint32_t OSQ3;
   volatile  uint32_t PSQ;
   volatile  uint32_t PDT1;
   volatile  uint32_t PDT2;
   volatile  uint32_t PDT3;
   volatile  uint32_t PDT4;
   volatile  uint32_t ODT; 
} ADC_TypeDef;

typedef struct
{
   volatile  uint32_t RESERVED0[1];
   volatile  uint32_t DT1;
   volatile  uint32_t DT2;
   volatile  uint32_t DT3;
   volatile  uint32_t DT4;
   volatile  uint32_t DT5;
   volatile  uint32_t DT6;
   volatile  uint32_t DT7;
   volatile  uint32_t DT8;
   volatile  uint32_t DT9;
   volatile  uint32_t DT10;
   volatile  uint32_t RTCCAL;
   volatile  uint32_t CTRL;
   volatile  uint32_t CTRLSTS;
   volatile  uint32_t RESERVED1[2];
   volatile  uint32_t DT11;
   volatile  uint32_t DT12;
   volatile  uint32_t DT13;
   volatile  uint32_t DT14;
   volatile  uint32_t DT15;
   volatile  uint32_t DT16;
   volatile  uint32_t DT17;
   volatile  uint32_t DT18;
   volatile  uint32_t DT19;
   volatile  uint32_t DT20;
   volatile  uint32_t DT21;
   volatile  uint32_t DT22;
   volatile  uint32_t DT23;
   volatile  uint32_t DT24;
   volatile  uint32_t DT25;
   volatile  uint32_t DT26;
   volatile  uint32_t DT27;
   volatile  uint32_t DT28;
   volatile  uint32_t DT29;
   volatile  uint32_t DT30;
   volatile  uint32_t DT31;
   volatile  uint32_t DT32;
   volatile  uint32_t DT33;
   volatile  uint32_t DT34;
   volatile  uint32_t DT35;
   volatile  uint32_t DT36;
   volatile  uint32_t DT37;
   volatile  uint32_t DT38;
   volatile  uint32_t DT39;
   volatile  uint32_t DT40;
   volatile  uint32_t DT41;
   volatile  uint32_t DT42;
} BPR_TypeDef;

typedef struct {
   volatile  uint32_t MCTRL;
   volatile  uint32_t MSTS;
   volatile  uint32_t TSTS;
   volatile  uint32_t RF0;
   volatile  uint32_t FR1;
   volatile  uint32_t INTEN;
   volatile  uint32_t ESTS;
   volatile  uint32_t BTMG;
   volatile  uint32_t RESERVED0[88];
   volatile  uint32_t TMI0;
   volatile  uint32_t TMC0;
   volatile  uint32_t TMDTL0;
   volatile  uint32_t TMDTH0;
   volatile  uint32_t TMI1;
   volatile  uint32_t TMC1;
   volatile  uint32_t TMDTL1;
   volatile  uint32_t TMDTH1;
   volatile  uint32_t TMI2;
   volatile  uint32_t TMC2;
   volatile  uint32_t TMDTL2;
   volatile  uint32_t TMDTH2;
   volatile  uint32_t RFI0;
   volatile  uint32_t RFC0;
   volatile  uint32_t RFDTL0;
   volatile  uint32_t RFDTH0;
   volatile  uint32_t RFI1;
   volatile  uint32_t RFC1;
   volatile  uint32_t RFDTL1;
   volatile  uint32_t RFDTH1;
   volatile  uint32_t RESERVED1[12];
   volatile  uint32_t FCTRL;
   volatile  uint32_t FMCFG;
   volatile  uint32_t RESERVED2;
   volatile  uint32_t FSCFG;
   volatile  uint32_t RESERVED3;
   volatile  uint32_t FRF;
   volatile  uint32_t RESERVED4;
   volatile  uint32_t FACFG;
   volatile  uint32_t RESERVED5[8];
   volatile  uint32_t FB0F1;
   volatile  uint32_t FB0F2;
   volatile  uint32_t FB1F1;
   volatile  uint32_t FB1F2;
   volatile  uint32_t FB2F1;
   volatile  uint32_t FB2F2;
   volatile  uint32_t FB3F1;
   volatile  uint32_t FB3F2;
   volatile  uint32_t FB4F1;
   volatile  uint32_t FB4F2;
   volatile  uint32_t FB5F1;
   volatile  uint32_t FB5F2;
   volatile  uint32_t FB6F1;
   volatile  uint32_t FB6F2;
   volatile  uint32_t FB7F1;
   volatile  uint32_t FB7F2;
   volatile  uint32_t FB8F1;
   volatile  uint32_t FB8F2;
   volatile  uint32_t FB9F1;
   volatile  uint32_t FB9F2;
   volatile  uint32_t FB10F1;
   volatile  uint32_t FB10F2;
   volatile  uint32_t FB11F1;
   volatile  uint32_t FB11F2;
   volatile  uint32_t FB12F1;
   volatile  uint32_t FB12F2;
   volatile  uint32_t FB13F1;
   volatile  uint32_t FB13F2; 
} CAN_TypeDef;

typedef struct 
{
   volatile  uint32_t DT;
   volatile  uint32_t CDT;
   volatile  uint32_t CTRL;
   volatile  uint32_t RESERVED0[1];
   volatile  uint32_t IDT;
} CRC_TypeDef;

typedef struct 
{
   volatile  uint32_t CTRL;
   volatile  uint32_t CFG;
   volatile  uint32_t CLKINT;
   volatile  uint32_t APB2RST;
   volatile  uint32_t APB1RST;
   volatile  uint32_t AHBEN;
   volatile  uint32_t APB2EN;
   volatile  uint32_t APB1EN;
   volatile  uint32_t BPDC;
   volatile  uint32_t CTRLSTS;
   volatile  uint32_t AHBRST;
   volatile  uint32_t RESERVED0[1];
   volatile  uint32_t MISC1;
   volatile  uint32_t RESERVED1[7];
   volatile  uint32_t MISC3;
   volatile  uint32_t MISC2;
   volatile  uint32_t RESERVED2[1];
   volatile  uint32_t INTMAP; 
    
} CRM_TypeDef;

typedef struct 
{
   volatile  uint32_t CTRL;
   volatile  uint32_t SWTRG;
   volatile  uint32_t D1DTH12R;
   volatile  uint32_t D1DTH12L;
   volatile  uint32_t D1DTH8R;
   volatile  uint32_t D2DTH12R;
   volatile  uint32_t D2DTH12L;
   volatile  uint32_t D2DTH8R;
   volatile  uint32_t DDTH12R;
   volatile  uint32_t DDTH12L;
   volatile  uint32_t DDTH8R;
   volatile  uint32_t D1ODT;
   volatile  uint32_t D2ODT;
} DAC_TypeDef;



typedef struct 
{
   volatile  uint32_t DEBUG_IDCODE;
   volatile  uint32_t DEBUG_CTRL;
} DEBUG_TypeDef;



typedef struct 
{
   volatile  uint32_t STS;
   volatile  uint32_t CLR;
   volatile  uint32_t C1CCTRL;
   volatile  uint32_t C1DTCNT;
   volatile  uint32_t C1PADDR;
   volatile  uint32_t C1MADDR;
   volatile  uint32_t RESERVED0[1];
   volatile  uint32_t C2CTRL;
   volatile  uint32_t C2DTCNT;
   volatile  uint32_t C2PADDR;
   volatile  uint32_t C2MADDR;
   volatile  uint32_t RESERVED1[1];
   volatile  uint32_t C3CTRL;
   volatile  uint32_t C3DTCNT;
   volatile  uint32_t C3PADDR;
   volatile  uint32_t C3MADDR;
   volatile  uint32_t RESERVED2[1];
   volatile  uint32_t C4CTRL;
   volatile  uint32_t C4DTCNT;
   volatile  uint32_t C4PADDR;
   volatile  uint32_t C4MADDR;
   volatile  uint32_t RESERVED3[1];
   volatile  uint32_t C5CTRL;
   volatile  uint32_t C5DTCNT;
   volatile  uint32_t C5PADDR;
   volatile  uint32_t C5MADDR;
   volatile  uint32_t RESERVED4[1];
   volatile  uint32_t C6CTRL;
   volatile  uint32_t C6DTCNT;
   volatile  uint32_t C6PADDR;
   volatile  uint32_t C6MADDR;
   volatile  uint32_t RESERVED5[1];
   volatile  uint32_t C7CTRL;
   volatile  uint32_t C7DTCNT;
   volatile  uint32_t C7PADDR;
   volatile  uint32_t C7MADDR;
   volatile  uint32_t RESERVED6[4];
   volatile  uint32_t SRC_SEL0;
   volatile  uint32_t SRC_SEL1;
} DMA_TypeDef;

typedef struct 
{
   volatile  uint32_t INTEN;
   volatile  uint32_t EVTEN;
   volatile  uint32_t POLCFG1;
   volatile  uint32_t POLCFG2;
   volatile  uint32_t SWTRG;
   volatile  uint32_t INTSTS;
} EXINT_TypeDef;



typedef struct 
{
   volatile  uint32_t PSR;
   volatile  uint32_t UNLOCK;
   volatile  uint32_t USD_UNLOCK;
   volatile  uint32_t STS;
   volatile  uint32_t CTRL;
   volatile  uint32_t ADDR;
   volatile  uint32_t RESERVED0[1];
   volatile  uint32_t USD;
   volatile  uint32_t EPPS;
   volatile  uint32_t RESERVED1[8];
   volatile  uint32_t UNLOCK2;
   volatile  uint32_t RESERVED2[1];
   volatile  uint32_t STS2;
   volatile  uint32_t CTRL2;
   volatile  uint32_t ADDR2;
   volatile  uint32_t RESERVED3[11];
   volatile  uint32_t UNLOCK3;
   volatile  uint32_t SELECT;
   volatile  uint32_t STS3;
   volatile  uint32_t CTRL3;
   volatile  uint32_t ADDR3;
   volatile  uint32_t DA;
   volatile  uint32_t RESERVED4[12];
   volatile  uint32_t SLIB_STS0;
   volatile  uint32_t SLIB_STS1;
   volatile  uint32_t SLIB_PWD_CLR;
   volatile  uint32_t SLIB_MISC_STS;
   volatile  uint32_t SLIB_SET_PWD;
   volatile  uint32_t SLIB_SET_RANGE;
   volatile  uint32_t RESERVED5[3];
   volatile  uint32_t SLIB_UNLOCK;
   volatile  uint32_t CRC_CTRL;
   volatile  uint32_t CRC_CHKR;
} FLASH_TypeDef;

typedef struct 
{
   volatile  uint32_t CFGLR;
   volatile  uint32_t CFGHR;
   volatile  uint32_t IDT;
   volatile  uint32_t ODT;
   volatile  uint32_t SCR;
   volatile  uint32_t CLR;
   volatile  uint32_t WPR;
   volatile  uint32_t RESERVED0[1];
   volatile  uint32_t SRCTR;
   volatile  uint32_t RESERVED1[6];
   volatile  uint32_t HDRV;
} GPIO_TypeDef;

typedef struct 
{
   volatile  uint32_t CTRL1;
   volatile  uint32_t CTRL2;
   volatile  uint32_t OADDR1;
   volatile  uint32_t OADDR2;
   volatile  uint32_t DT;
   volatile  uint32_t STS1;
   volatile  uint32_t STS2;
   volatile  uint32_t CLKCTRL;
   volatile  uint32_t TMRISE;
} I2C_TypeDef;

// typedef struct 
// {

