eeucalyptus/at32f403a_minimal/at32f403a.h
// } I2S_TypeDef;

typedef struct 
{
   volatile  uint32_t EVTOUT;
   volatile  uint32_t REMAP;
   volatile  uint32_t EXINTC1;
   volatile  uint32_t EXINTC2;
   volatile  uint32_t EXINTC3;
   volatile  uint32_t EXINTC4;
   volatile  uint32_t RESERVED0[1];
   volatile  uint32_t REMAP2;
   volatile  uint32_t REMAP3;
   volatile  uint32_t REMAP4;
   volatile  uint32_t REMAP5;
   volatile  uint32_t REMAP6;
   volatile  uint32_t REMAP7;
   volatile  uint32_t REMAP8;
} IOMUX_TypeDef;

typedef struct 
{
   volatile  uint32_t CTRL;
   volatile  uint32_t CTRLSTS;
} PWC_TypeDef;

typedef struct 
{
   volatile  uint32_t CTRLH;
   volatile  uint32_t CTRLL;
   volatile  uint32_t DIVH;
   volatile  uint32_t DIVL;
   volatile  uint32_t DIVCNTH;
   volatile  uint32_t DIVCNTL;
   volatile  uint32_t CNTH;
   volatile  uint32_t CNTL;
   volatile  uint32_t TAH;
   volatile  uint32_t TAL;
} RTC_TypeDef;

typedef struct 
{
   volatile  uint32_t PWRCTRL;
   volatile  uint32_t CLKCTRL;
   volatile  uint32_t ARG;
   volatile  uint32_t CMD;
   volatile  uint32_t RSPCMD;
   volatile  uint32_t RSP1;
   volatile  uint32_t RSP2;
   volatile  uint32_t RSP3;
   volatile  uint32_t RSP4;
   volatile  uint32_t DTTMR;
   volatile  uint32_t DTLEN;
   volatile  uint32_t DTCTRL;
   volatile  uint32_t DTCNTR;
   volatile  uint32_t STS;
   volatile  uint32_t INTCLR;
   volatile  uint32_t INTEN;
   volatile  uint32_t RESERVED0[2];
   volatile  uint32_t BUFCNTR;
   volatile  uint32_t RESERVED1[13];
   volatile  uint32_t BUF;
} SDIO_TypeDef;

typedef struct 
{
   volatile  uint32_t CTRL1;
   volatile  uint32_t CTRL2;
   volatile  uint32_t STS;
   volatile  uint32_t DT;
   volatile  uint32_t CPOLY;
   volatile  uint32_t RCRC;
   volatile  uint32_t TCRC;
   volatile  uint32_t I2SCTRL;
   volatile  uint32_t I2SCLKP;
} SPI_TypeDef;

typedef struct 
{
   volatile  uint32_t CTRL1;
   volatile  uint32_t CTRL2;
   volatile  uint32_t STCTRL;
   volatile  uint32_t IDEN;
   volatile  uint32_t ISTS;
   volatile  uint32_t SWEVT;
   volatile  uint32_t CM1;
   volatile  uint32_t CM2;
   volatile  uint32_t CCTRL;
   volatile  uint32_t CVAL;
   volatile  uint32_t DIV;
   volatile  uint32_t PR;
   volatile  uint32_t RPR;
   volatile  uint32_t C1DT;
   volatile  uint32_t C2DT;
   volatile  uint32_t C3DT;
   volatile  uint32_t C4DT;
   volatile  uint32_t BRK;
   volatile  uint32_t DMACTRL;
   volatile  uint32_t DMADT;
} TMR_TypeDef;

typedef struct 
{
   volatile  uint32_t USART_STS;
   volatile  uint32_t USART_DT;
   volatile  uint32_t USART_BAUDR;
   volatile  uint32_t USART_CTRL1;
   volatile  uint32_t USART_CTRL2;
   volatile  uint32_t USART_CTRL3;
   volatile  uint32_t USART_GTP;
} UART_TypeDef;

// typedef struct 
// {

// } USBFS_TypeDef;

typedef struct 
{
   volatile  uint32_t WDT_CMD;
   volatile  uint32_t WDT_DIV;
   volatile  uint32_t WDT_RLD;
   volatile  uint32_t WDT_STS;
} WDT_TypeDef;

typedef struct 
{
   volatile  uint32_t CTRL;
   volatile  uint32_t CFG;
   volatile  uint32_t STS;
} WWDT_TypeDef;

typedef struct 
{
   volatile  uint32_t BK1CTRL1; 
   volatile  uint32_t BK1TMG1;
   volatile  uint32_t RESERVED0[4];
   volatile  uint32_t BK1CTRL4;
   volatile  uint32_t BK1TMG4;
   volatile  uint32_t RESERVED1[16];
   volatile  uint32_t BK2CTRL;
   volatile  uint32_t BK2IS;
   volatile  uint32_t BK2TMGRG;
   volatile  uint32_t BK2TMGSP;
   volatile  uint32_t RESERVED2[1];
   volatile  uint32_t BK2ECC;
   volatile  uint32_t RESERVED3[35];
   volatile  uint32_t BK1TMGWR1;
   volatile  uint32_t RESERVED4[5];
   volatile  uint32_t BK1TMGWR4;
   volatile  uint32_t RESERVED5[64];
   volatile  uint32_t EXT1;
   volatile  uint32_t RESERVED6[2];
   volatile  uint32_t EXT4;
} XMC_TypeDef;


/* XMC - Flexible static memory controller */
#define XMC_BK1CTRL1_MWMC_MASK            (0x01 << 19)
#define XMC_BK1CTRL1_MWMC_SHIFT           (19)
#define XMC_BK1CTRL1_MWMC(x)              (x << 19)
#define XMC_BK1CTRL1_CRPGS_MASK           (0x07 << 16)
#define XMC_BK1CTRL1_CRPGS_SHIFT          (16)
#define XMC_BK1CTRL1_CRPGS(x)             (x << 16)
#define XMC_BK1CTRL1_NWASEN_MASK          (0x01 << 15)
#define XMC_BK1CTRL1_NWASEN_SHIFT         (15)
#define XMC_BK1CTRL1_NWASEN(x)            (x << 15)
#define XMC_BK1CTRL1_RWTD_MASK            (0x01 << 14)
#define XMC_BK1CTRL1_RWTD_SHIFT           (14)
#define XMC_BK1CTRL1_RWTD(x)              (x << 14)
#define XMC_BK1CTRL1_NWSEN_MASK           (0x01 << 13)
#define XMC_BK1CTRL1_NWSEN_SHIFT          (13)
#define XMC_BK1CTRL1_NWSEN(x)             (x << 13)
#define XMC_BK1CTRL1_WEN_MASK             (0x01 << 12)
#define XMC_BK1CTRL1_WEN_SHIFT            (12)
#define XMC_BK1CTRL1_WEN(x)               (x << 12)
#define XMC_BK1CTRL1_NWTCFG_MASK          (0x01 << 11)
#define XMC_BK1CTRL1_NWTCFG_SHIFT         (11)
#define XMC_BK1CTRL1_NWTCFG(x)            (x << 11)
#define XMC_BK1CTRL1_WRAPEN_MASK          (0x01 << 10)
#define XMC_BK1CTRL1_WRAPEN_SHIFT         (10)
#define XMC_BK1CTRL1_WRAPEN(x)            (x << 10)
#define XMC_BK1CTRL1_NWPOL_MASK           (0x01 << 9)
#define XMC_BK1CTRL1_NWPOL_SHIFT          (9)
#define XMC_BK1CTRL1_NWPOL(x)             (x << 9)
#define XMC_BK1CTRL1_SYNCBEN_MASK         (0x01 << 8)
#define XMC_BK1CTRL1_SYNCBEN_SHIFT        (8)
#define XMC_BK1CTRL1_SYNCBEN(x)           (x << 8)
#define XMC_BK1CTRL1_NOREN_MASK           (0x01 << 6)
#define XMC_BK1CTRL1_NOREN_SHIFT          (6)
#define XMC_BK1CTRL1_NOREN(x)             (x << 6)
#define XMC_BK1CTRL1_EXTMDBW_MASK         (0x03 << 4)
#define XMC_BK1CTRL1_EXTMDBW_SHIFT        (4)
#define XMC_BK1CTRL1_EXTMDBW(x)           (x << 4)
#define XMC_BK1CTRL1_DEV_MASK             (0x03 << 2)
#define XMC_BK1CTRL1_DEV_SHIFT            (2)
#define XMC_BK1CTRL1_DEV(x)               (x << 2)
#define XMC_BK1CTRL1_ADMUXEN_MASK         (0x01 << 1)
#define XMC_BK1CTRL1_ADMUXEN_SHIFT        (1)
#define XMC_BK1CTRL1_ADMUXEN(x)           (x << 1)
#define XMC_BK1CTRL1_EN_MASK              (0x01 << 0)
#define XMC_BK1CTRL1_EN_SHIFT             (0)
#define XMC_BK1CTRL1_EN(x)                (x << 0)
#define XMC_BK1TMG1_ASYNCM_MASK           (0x03 << 28)
#define XMC_BK1TMG1_ASYNCM_SHIFT          (28)
#define XMC_BK1TMG1_ASYNCM(x)             (x << 28)
#define XMC_BK1TMG1_DTLAT_MASK            (0x0f << 24)
#define XMC_BK1TMG1_DTLAT_SHIFT           (24)
#define XMC_BK1TMG1_DTLAT(x)              (x << 24)
#define XMC_BK1TMG1_CLKPSC_MASK           (0x0f << 20)
#define XMC_BK1TMG1_CLKPSC_SHIFT          (20)
#define XMC_BK1TMG1_CLKPSC(x)             (x << 20)
#define XMC_BK1TMG1_BUSLAT_MASK           (0x0f << 16)
#define XMC_BK1TMG1_BUSLAT_SHIFT          (16)
#define XMC_BK1TMG1_BUSLAT(x)             (x << 16)
#define XMC_BK1TMG1_DTST_MASK             (0xff << 8)
#define XMC_BK1TMG1_DTST_SHIFT            (8)
#define XMC_BK1TMG1_DTST(x)               (x << 8)
#define XMC_BK1TMG1_ADDRHT_MASK           (0x0f << 4)
#define XMC_BK1TMG1_ADDRHT_SHIFT          (4)
#define XMC_BK1TMG1_ADDRHT(x)             (x << 4)
#define XMC_BK1TMG1_ADDRST_MASK           (0x0f << 0)
#define XMC_BK1TMG1_ADDRST_SHIFT          (0)
#define XMC_BK1TMG1_ADDRST(x)             (x << 0)
#define XMC_BK1CTRL4_MWMC_MASK            (0x01 << 19)
#define XMC_BK1CTRL4_MWMC_SHIFT           (19)
#define XMC_BK1CTRL4_MWMC(x)              (x << 19)
#define XMC_BK1CTRL4_CRPGS_MASK           (0x07 << 16)
#define XMC_BK1CTRL4_CRPGS_SHIFT          (16)
#define XMC_BK1CTRL4_CRPGS(x)             (x << 16)
#define XMC_BK1CTRL4_NWASEN_MASK          (0x01 << 15)
#define XMC_BK1CTRL4_NWASEN_SHIFT         (15)
#define XMC_BK1CTRL4_NWASEN(x)            (x << 15)
#define XMC_BK1CTRL4_RWTD_MASK            (0x01 << 14)
#define XMC_BK1CTRL4_RWTD_SHIFT           (14)
#define XMC_BK1CTRL4_RWTD(x)              (x << 14)
#define XMC_BK1CTRL4_NWSEN_MASK           (0x01 << 13)
#define XMC_BK1CTRL4_NWSEN_SHIFT          (13)
#define XMC_BK1CTRL4_NWSEN(x)             (x << 13)
#define XMC_BK1CTRL4_WEN_MASK             (0x01 << 12)
#define XMC_BK1CTRL4_WEN_SHIFT            (12)
#define XMC_BK1CTRL4_WEN(x)               (x << 12)
#define XMC_BK1CTRL4_NWTCFG_MASK          (0x01 << 11)
#define XMC_BK1CTRL4_NWTCFG_SHIFT         (11)
#define XMC_BK1CTRL4_NWTCFG(x)            (x << 11)
#define XMC_BK1CTRL4_WRAPEN_MASK          (0x01 << 10)
#define XMC_BK1CTRL4_WRAPEN_SHIFT         (10)
#define XMC_BK1CTRL4_WRAPEN(x)            (x << 10)
#define XMC_BK1CTRL4_NWPOL_MASK           (0x01 << 9)
#define XMC_BK1CTRL4_NWPOL_SHIFT          (9)
#define XMC_BK1CTRL4_NWPOL(x)             (x << 9)
#define XMC_BK1CTRL4_SYNCBEN_MASK         (0x01 << 8)
#define XMC_BK1CTRL4_SYNCBEN_SHIFT        (8)
#define XMC_BK1CTRL4_SYNCBEN(x)           (x << 8)
#define XMC_BK1CTRL4_NOREN_MASK           (0x01 << 6)
#define XMC_BK1CTRL4_NOREN_SHIFT          (6)
#define XMC_BK1CTRL4_NOREN(x)             (x << 6)
#define XMC_BK1CTRL4_EXTMDBW_MASK         (0x03 << 4)
#define XMC_BK1CTRL4_EXTMDBW_SHIFT        (4)
#define XMC_BK1CTRL4_EXTMDBW(x)           (x << 4)
#define XMC_BK1CTRL4_DEV_MASK             (0x03 << 2)
#define XMC_BK1CTRL4_DEV_SHIFT            (2)
#define XMC_BK1CTRL4_DEV(x)               (x << 2)
#define XMC_BK1CTRL4_ADMUXEN_MASK         (0x01 << 1)
#define XMC_BK1CTRL4_ADMUXEN_SHIFT        (1)
#define XMC_BK1CTRL4_ADMUXEN(x)           (x << 1)
#define XMC_BK1CTRL4_EN_MASK              (0x01 << 0)
#define XMC_BK1CTRL4_EN_SHIFT             (0)
#define XMC_BK1CTRL4_EN(x)                (x << 0)
#define XMC_BK1TMG4_ASYNCM_MASK           (0x03 << 28)
#define XMC_BK1TMG4_ASYNCM_SHIFT          (28)
#define XMC_BK1TMG4_ASYNCM(x)             (x << 28)
#define XMC_BK1TMG4_DTLAT_MASK            (0x0f << 24)
#define XMC_BK1TMG4_DTLAT_SHIFT           (24)
#define XMC_BK1TMG4_DTLAT(x)              (x << 24)
#define XMC_BK1TMG4_CLKPSC_MASK           (0x0f << 20)
#define XMC_BK1TMG4_CLKPSC_SHIFT          (20)
#define XMC_BK1TMG4_CLKPSC(x)             (x << 20)
#define XMC_BK1TMG4_BUSLAT_MASK           (0x0f << 16)
#define XMC_BK1TMG4_BUSLAT_SHIFT          (16)
#define XMC_BK1TMG4_BUSLAT(x)             (x << 16)
#define XMC_BK1TMG4_DTST_MASK             (0xff << 8)
#define XMC_BK1TMG4_DTST_SHIFT            (8)
#define XMC_BK1TMG4_DTST(x)               (x << 8)
#define XMC_BK1TMG4_ADDRHT_MASK           (0x0f << 4)
#define XMC_BK1TMG4_ADDRHT_SHIFT          (4)
#define XMC_BK1TMG4_ADDRHT(x)             (x << 4)
#define XMC_BK1TMG4_ADDRST_MASK           (0x0f << 0)
#define XMC_BK1TMG4_ADDRST_SHIFT          (0)
#define XMC_BK1TMG4_ADDRST(x)             (x << 0)
#define XMC_BK2CTRL_ECCPGS_MASK           (0x07 << 17)
#define XMC_BK2CTRL_ECCPGS_SHIFT          (17)
#define XMC_BK2CTRL_ECCPGS(x)             (x << 17)
#define XMC_BK2CTRL_TAR_MASK              (0x0f << 13)
#define XMC_BK2CTRL_TAR_SHIFT             (13)
#define XMC_BK2CTRL_TAR(x)                (x << 13)
#define XMC_BK2CTRL_TCR_MASK              (0x0f << 9)
#define XMC_BK2CTRL_TCR_SHIFT             (9)
#define XMC_BK2CTRL_TCR(x)                (x << 9)
#define XMC_BK2CTRL_ECCEN_MASK            (0x01 << 6)
#define XMC_BK2CTRL_ECCEN_SHIFT           (6)
#define XMC_BK2CTRL_ECCEN(x)              (x << 6)
#define XMC_BK2CTRL_EXTMDBW_MASK          (0x03 << 4)
#define XMC_BK2CTRL_EXTMDBW_SHIFT         (4)
#define XMC_BK2CTRL_EXTMDBW(x)            (x << 4)
#define XMC_BK2CTRL_DEV_MASK              (0x01 << 3)
#define XMC_BK2CTRL_DEV_SHIFT             (3)
#define XMC_BK2CTRL_DEV(x)                (x << 3)
#define XMC_BK2CTRL_EN_MASK               (0x01 << 2)
#define XMC_BK2CTRL_EN_SHIFT              (2)
#define XMC_BK2CTRL_EN(x)                 (x << 2)
#define XMC_BK2CTRL_NWEN_MASK             (0x01 << 1)
#define XMC_BK2CTRL_NWEN_SHIFT            (1)
#define XMC_BK2CTRL_NWEN(x)               (x << 1)
#define XMC_BK2IS_FIFOE_MASK              (0x01 << 6)
#define XMC_BK2IS_FIFOE_SHIFT             (6)
#define XMC_BK2IS_FIFOE(x)                (x << 6)
#define XMC_BK2IS_FEIEN_MASK              (0x01 << 5)
#define XMC_BK2IS_FEIEN_SHIFT             (5)
#define XMC_BK2IS_FEIEN(x)                (x << 5)
#define XMC_BK2IS_HLIEN_MASK              (0x01 << 4)
#define XMC_BK2IS_HLIEN_SHIFT             (4)
#define XMC_BK2IS_HLIEN(x)                (x << 4)
#define XMC_BK2IS_REIEN_MASK              (0x01 << 3)
#define XMC_BK2IS_REIEN_SHIFT             (3)
#define XMC_BK2IS_REIEN(x)                (x << 3)
#define XMC_BK2IS_FES_MASK                (0x01 << 2)
#define XMC_BK2IS_FES_SHIFT               (2)
#define XMC_BK2IS_FES(x)                  (x << 2)
#define XMC_BK2IS_HLS_MASK                (0x01 << 1)
#define XMC_BK2IS_HLS_SHIFT               (1)
#define XMC_BK2IS_HLS(x)                  (x << 1)
#define XMC_BK2IS_RES_MASK                (0x01 << 0)
#define XMC_BK2IS_RES_SHIFT               (0)
#define XMC_BK2IS_RES(x)                  (x << 0)
#define XMC_BK2TMGMEM_RGDHIZT_MASK        (0xff << 24)
#define XMC_BK2TMGMEM_RGDHIZT_SHIFT       (24)
#define XMC_BK2TMGMEM_RGDHIZT(x)          (x << 24)
#define XMC_BK2TMGMEM_RGHT_MASK           (0xff << 16)
#define XMC_BK2TMGMEM_RGHT_SHIFT          (16)
#define XMC_BK2TMGMEM_RGHT(x)             (x << 16)
#define XMC_BK2TMGMEM_RGWT_MASK           (0xff << 8)
#define XMC_BK2TMGMEM_RGWT_SHIFT          (8)
#define XMC_BK2TMGMEM_RGWT(x)             (x << 8)
#define XMC_BK2TMGMEM_RGST_MASK           (0xff << 0)
#define XMC_BK2TMGMEM_RGST_SHIFT          (0)
#define XMC_BK2TMGMEM_RGST(x)             (x << 0)
#define XMC_BK2TMGATT_SPDHIZT_MASK        (0xff << 24)
#define XMC_BK2TMGATT_SPDHIZT_SHIFT       (24)
#define XMC_BK2TMGATT_SPDHIZT(x)          (x << 24)
#define XMC_BK2TMGATT_SPHT_MASK           (0xff << 16)
#define XMC_BK2TMGATT_SPHT_SHIFT          (16)
#define XMC_BK2TMGATT_SPHT(x)             (x << 16)
#define XMC_BK2TMGATT_SPWT_MASK           (0xff << 8)
#define XMC_BK2TMGATT_SPWT_SHIFT          (8)
#define XMC_BK2TMGATT_SPWT(x)             (x << 8)
#define XMC_BK2TMGATT_SPST_MASK           (0xff << 0)
#define XMC_BK2TMGATT_SPST_SHIFT          (0)
#define XMC_BK2TMGATT_SPST(x)             (x << 0)
#define XMC_BK2ECC_ECC_MASK               (0xffffffff << 0)
#define XMC_BK2ECC_ECC_SHIFT              (0)
#define XMC_BK2ECC_ECC(x)                 (x << 0)
#define XMC_BK1TMGWR1_ASYNCM_MASK         (0x03 << 28)
#define XMC_BK1TMGWR1_ASYNCM_SHIFT        (28)
#define XMC_BK1TMGWR1_ASYNCM(x)           (x << 28)
#define XMC_BK1TMGWR1_BUSLAT_MASK         (0x0f << 16)
#define XMC_BK1TMGWR1_BUSLAT_SHIFT        (16)
#define XMC_BK1TMGWR1_BUSLAT(x)           (x << 16)
#define XMC_BK1TMGWR1_DTST_MASK           (0xff << 8)
#define XMC_BK1TMGWR1_DTST_SHIFT          (8)
#define XMC_BK1TMGWR1_DTST(x)             (x << 8)
#define XMC_BK1TMGWR1_ADDRHT_MASK         (0x0f << 4)
#define XMC_BK1TMGWR1_ADDRHT_SHIFT        (4)
#define XMC_BK1TMGWR1_ADDRHT(x)           (x << 4)
#define XMC_BK1TMGWR1_ADDRST_MASK         (0x0f << 0)
#define XMC_BK1TMGWR1_ADDRST_SHIFT        (0)
#define XMC_BK1TMGWR1_ADDRST(x)           (x << 0)
#define XMC_BK1TMGWR4_ASYNCM_MASK         (0x03 << 28)
#define XMC_BK1TMGWR4_ASYNCM_SHIFT        (28)
#define XMC_BK1TMGWR4_ASYNCM(x)           (x << 28)
#define XMC_BK1TMGWR4_BUSLAT_MASK         (0x0f << 16)
#define XMC_BK1TMGWR4_BUSLAT_SHIFT        (16)
#define XMC_BK1TMGWR4_BUSLAT(x)           (x << 16)
#define XMC_BK1TMGWR4_DTST_MASK           (0xff << 8)
#define XMC_BK1TMGWR4_DTST_SHIFT          (8)
#define XMC_BK1TMGWR4_DTST(x)             (x << 8)
#define XMC_BK1TMGWR4_ADDRHT_MASK         (0x0f << 4)
#define XMC_BK1TMGWR4_ADDRHT_SHIFT        (4)
#define XMC_BK1TMGWR4_ADDRHT(x)           (x << 4)
#define XMC_BK1TMGWR4_ADDRST_MASK         (0x0f << 0)
#define XMC_BK1TMGWR4_ADDRST_SHIFT        (0)
#define XMC_BK1TMGWR4_ADDRST(x)           (x << 0)
#define XMC_EXT1_BUSLATW2W_MASK           (0xff << 0)
#define XMC_EXT1_BUSLATW2W_SHIFT          (0)
#define XMC_EXT1_BUSLATW2W(x)             (x << 0)
#define XMC_EXT1_BUSLATR2R_MASK           (0xff << 8)
#define XMC_EXT1_BUSLATR2R_SHIFT          (8)
#define XMC_EXT1_BUSLATR2R(x)             (x << 8)
#define XMC_EXT4_BUSLATW2W_MASK           (0xff << 0)
#define XMC_EXT4_BUSLATW2W_SHIFT          (0)
#define XMC_EXT4_BUSLATW2W(x)             (x << 0)
#define XMC_EXT4_BUSLATR2R_MASK           (0xff << 8)
#define XMC_EXT4_BUSLATR2R_SHIFT          (8)
#define XMC_EXT4_BUSLATR2R(x)             (x << 8)

