eeucalyptus/at32f403a_minimal/at32f403a.h
/* PWC - Power control */
#define PWC_CTRL_VRSEL_MASK               (0x01 << 0)
#define PWC_CTRL_VRSEL_SHIFT              (0)
#define PWC_CTRL_VRSEL(x)                 (x << 0)
#define PWC_CTRL_LPSEL_MASK               (0x01 << 1)
#define PWC_CTRL_LPSEL_SHIFT              (1)
#define PWC_CTRL_LPSEL(x)                 (x << 1)
#define PWC_CTRL_CLSWEF_MASK              (0x01 << 2)
#define PWC_CTRL_CLSWEF_SHIFT             (2)
#define PWC_CTRL_CLSWEF(x)                (x << 2)
#define PWC_CTRL_CLSEF_MASK               (0x01 << 3)
#define PWC_CTRL_CLSEF_SHIFT              (3)
#define PWC_CTRL_CLSEF(x)                 (x << 3)
#define PWC_CTRL_PVMEN_MASK               (0x01 << 4)
#define PWC_CTRL_PVMEN_SHIFT              (4)
#define PWC_CTRL_PVMEN(x)                 (x << 4)
#define PWC_CTRL_PVMSEL_MASK              (0x07 << 5)
#define PWC_CTRL_PVMSEL_SHIFT             (5)
#define PWC_CTRL_PVMSEL(x)                (x << 5)
#define PWC_CTRL_BPWEN_MASK               (0x01 << 8)
#define PWC_CTRL_BPWEN_SHIFT              (8)
#define PWC_CTRL_BPWEN(x)                 (x << 8)
#define PWC_CTRLSTS_SWEF_MASK             (0x01 << 0)
#define PWC_CTRLSTS_SWEF_SHIFT            (0)
#define PWC_CTRLSTS_SWEF(x)               (x << 0)
#define PWC_CTRLSTS_SEF_MASK              (0x01 << 1)
#define PWC_CTRLSTS_SEF_SHIFT             (1)
#define PWC_CTRLSTS_SEF(x)                (x << 1)
#define PWC_CTRLSTS_PVMOF_MASK            (0x01 << 2)
#define PWC_CTRLSTS_PVMOF_SHIFT           (2)
#define PWC_CTRLSTS_PVMOF(x)              (x << 2)
#define PWC_CTRLSTS_SWPEN_MASK            (0x01 << 8)
#define PWC_CTRLSTS_SWPEN_SHIFT           (8)
#define PWC_CTRLSTS_SWPEN(x)              (x << 8)

/* CRM - Clock and reset management */
#define CRM_CTRL_HICKEN_MASK              (0x01 << 0)
#define CRM_CTRL_HICKEN_SHIFT             (0)
#define CRM_CTRL_HICKEN(x)                (x << 0)
#define CRM_CTRL_HICKSTBL_MASK            (0x01 << 1)
#define CRM_CTRL_HICKSTBL_SHIFT           (1)
#define CRM_CTRL_HICKSTBL(x)              (x << 1)
#define CRM_CTRL_HICKTRIM_MASK            (0x3f << 2)
#define CRM_CTRL_HICKTRIM_SHIFT           (2)
#define CRM_CTRL_HICKTRIM(x)              (x << 2)
#define CRM_CTRL_HICKCAL_MASK             (0xff << 8)
#define CRM_CTRL_HICKCAL_SHIFT            (8)
#define CRM_CTRL_HICKCAL(x)               (x << 8)
#define CRM_CTRL_HEXTEN_MASK              (0x01 << 16)
#define CRM_CTRL_HEXTEN_SHIFT             (16)
#define CRM_CTRL_HEXTEN(x)                (x << 16)
#define CRM_CTRL_HEXTSTBL_MASK            (0x01 << 17)
#define CRM_CTRL_HEXTSTBL_SHIFT           (17)
#define CRM_CTRL_HEXTSTBL(x)              (x << 17)
#define CRM_CTRL_HEXTBYPS_MASK            (0x01 << 18)
#define CRM_CTRL_HEXTBYPS_SHIFT           (18)
#define CRM_CTRL_HEXTBYPS(x)              (x << 18)
#define CRM_CTRL_CFDEN_MASK               (0x01 << 19)
#define CRM_CTRL_CFDEN_SHIFT              (19)
#define CRM_CTRL_CFDEN(x)                 (x << 19)
#define CRM_CTRL_PLLEN_MASK               (0x01 << 24)
#define CRM_CTRL_PLLEN_SHIFT              (24)
#define CRM_CTRL_PLLEN(x)                 (x << 24)
#define CRM_CTRL_PLLSTBL_MASK             (0x01 << 25)
#define CRM_CTRL_PLLSTBL_SHIFT            (25)
#define CRM_CTRL_PLLSTBL(x)               (x << 25)
#define CRM_CFG_SCLKSEL_MASK              (0x03 << 0)
#define CRM_CFG_SCLKSEL_SHIFT             (0)
#define CRM_CFG_SCLKSEL(x)                (x << 0)
#define CRM_CFG_SCLKSTS_MASK              (0x03 << 2)
#define CRM_CFG_SCLKSTS_SHIFT             (2)
#define CRM_CFG_SCLKSTS(x)                (x << 2)
#define CRM_CFG_AHBDIV_MASK               (0x0f << 4)
#define CRM_CFG_AHBDIV_SHIFT              (4)
#define CRM_CFG_AHBDIV(x)                 (x << 4)
#define CRM_CFG_APB1DIV_MASK              (0x07 << 8)
#define CRM_CFG_APB1DIV_SHIFT             (8)
#define CRM_CFG_APB1DIV(x)                (x << 8)
#define CRM_CFG_APB2DIV_MASK              (0x07 << 11)
#define CRM_CFG_APB2DIV_SHIFT             (11)
#define CRM_CFG_APB2DIV(x)                (x << 11)
#define CRM_CFG_ADCDIV1_0_MASK            (0x03 << 14)
#define CRM_CFG_ADCDIV1_0_SHIFT           (14)
#define CRM_CFG_ADCDIV1_0(x)              (x << 14)
#define CRM_CFG_PLLRCS_MASK               (0x01 << 16)
#define CRM_CFG_PLLRCS_SHIFT              (16)
#define CRM_CFG_PLLRCS(x)                 (x << 16)
#define CRM_CFG_PLLHEXTDIV_MASK           (0x01 << 17)
#define CRM_CFG_PLLHEXTDIV_SHIFT          (17)
#define CRM_CFG_PLLHEXTDIV(x)             (x << 17)
#define CRM_CFG_PLLMULT3_0_MASK           (0x0f << 18)
#define CRM_CFG_PLLMULT3_0_SHIFT          (18)
#define CRM_CFG_PLLMULT3_0(x)             (x << 18)
#define CRM_CFG_USBDIV1_0_MASK            (0x03 << 22)
#define CRM_CFG_USBDIV1_0_SHIFT           (22)
#define CRM_CFG_USBDIV1_0(x)              (x << 22)
#define CRM_CFG_CLKOUT_SEL_MASK           (0x07 << 24)
#define CRM_CFG_CLKOUT_SEL_SHIFT          (24)
#define CRM_CFG_CLKOUT_SEL(x)             (x << 24)
#define CRM_CFG_USBDIV2_MASK              (0x01 << 27)
#define CRM_CFG_USBDIV2_SHIFT             (27)
#define CRM_CFG_USBDIV2(x)                (x << 27)
#define CRM_CFG_ADCDIV2_MASK              (0x01 << 28)
#define CRM_CFG_ADCDIV2_SHIFT             (28)
#define CRM_CFG_ADCDIV2(x)                (x << 28)
#define CRM_CFG_PLLMULT5_4_MASK           (0x03 << 29)
#define CRM_CFG_PLLMULT5_4_SHIFT          (29)
#define CRM_CFG_PLLMULT5_4(x)             (x << 29)
#define CRM_CFG_PLLRANGE_MASK             (0x01 << 31)
#define CRM_CFG_PLLRANGE_SHIFT            (31)
#define CRM_CFG_PLLRANGE(x)               (x << 31)
#define CRM_CLKINT_LICKSTBLF_MASK         (0x01 << 0)
#define CRM_CLKINT_LICKSTBLF_SHIFT        (0)
#define CRM_CLKINT_LICKSTBLF(x)           (x << 0)
#define CRM_CLKINT_LEXTSTBLF_MASK         (0x01 << 1)
#define CRM_CLKINT_LEXTSTBLF_SHIFT        (1)
#define CRM_CLKINT_LEXTSTBLF(x)           (x << 1)
#define CRM_CLKINT_HICKSTBLF_MASK         (0x01 << 2)
#define CRM_CLKINT_HICKSTBLF_SHIFT        (2)
#define CRM_CLKINT_HICKSTBLF(x)           (x << 2)
#define CRM_CLKINT_HEXTSTBLF_MASK         (0x01 << 3)
#define CRM_CLKINT_HEXTSTBLF_SHIFT        (3)
#define CRM_CLKINT_HEXTSTBLF(x)           (x << 3)
#define CRM_CLKINT_PLLSTBLF_MASK          (0x01 << 4)
#define CRM_CLKINT_PLLSTBLF_SHIFT         (4)
#define CRM_CLKINT_PLLSTBLF(x)            (x << 4)
#define CRM_CLKINT_CFDF_MASK              (0x01 << 7)
#define CRM_CLKINT_CFDF_SHIFT             (7)
#define CRM_CLKINT_CFDF(x)                (x << 7)
#define CRM_CLKINT_LICKSTBLIEN_MASK       (0x01 << 8)
#define CRM_CLKINT_LICKSTBLIEN_SHIFT      (8)
#define CRM_CLKINT_LICKSTBLIEN(x)         (x << 8)
#define CRM_CLKINT_LEXTSTBLIEN_MASK       (0x01 << 9)
#define CRM_CLKINT_LEXTSTBLIEN_SHIFT      (9)
#define CRM_CLKINT_LEXTSTBLIEN(x)         (x << 9)
#define CRM_CLKINT_HICKSTBLIEN_MASK       (0x01 << 10)
#define CRM_CLKINT_HICKSTBLIEN_SHIFT      (10)
#define CRM_CLKINT_HICKSTBLIEN(x)         (x << 10)
#define CRM_CLKINT_HEXTSTBLIEN_MASK       (0x01 << 11)
#define CRM_CLKINT_HEXTSTBLIEN_SHIFT      (11)
#define CRM_CLKINT_HEXTSTBLIEN(x)         (x << 11)
#define CRM_CLKINT_PLLSTBLIEN_MASK        (0x01 << 12)
#define CRM_CLKINT_PLLSTBLIEN_SHIFT       (12)
#define CRM_CLKINT_PLLSTBLIEN(x)          (x << 12)
#define CRM_CLKINT_LICKSTBLFC_MASK        (0x01 << 16)
#define CRM_CLKINT_LICKSTBLFC_SHIFT       (16)
#define CRM_CLKINT_LICKSTBLFC(x)          (x << 16)
#define CRM_CLKINT_LEXTSTBLFC_MASK        (0x01 << 17)
#define CRM_CLKINT_LEXTSTBLFC_SHIFT       (17)
#define CRM_CLKINT_LEXTSTBLFC(x)          (x << 17)
#define CRM_CLKINT_HICKSTBLFC_MASK        (0x01 << 18)
#define CRM_CLKINT_HICKSTBLFC_SHIFT       (18)
#define CRM_CLKINT_HICKSTBLFC(x)          (x << 18)
#define CRM_CLKINT_HEXTSTBLFC_MASK        (0x01 << 19)
#define CRM_CLKINT_HEXTSTBLFC_SHIFT       (19)
#define CRM_CLKINT_HEXTSTBLFC(x)          (x << 19)
#define CRM_CLKINT_PLLSTBLFC_MASK         (0x01 << 20)
#define CRM_CLKINT_PLLSTBLFC_SHIFT        (20)
#define CRM_CLKINT_PLLSTBLFC(x)           (x << 20)
#define CRM_CLKINT_CFDFC_MASK             (0x01 << 23)
#define CRM_CLKINT_CFDFC_SHIFT            (23)
#define CRM_CLKINT_CFDFC(x)               (x << 23)
#define CRM_APB2RST_IOMUXRST_MASK         (0x01 << 0)
#define CRM_APB2RST_IOMUXRST_SHIFT        (0)
#define CRM_APB2RST_IOMUXRST(x)           (x << 0)
#define CRM_APB2RST_EXINTRST_MASK         (0x01 << 1)
#define CRM_APB2RST_EXINTRST_SHIFT        (1)
#define CRM_APB2RST_EXINTRST(x)           (x << 1)
#define CRM_APB2RST_GPIOARST_MASK         (0x01 << 2)
#define CRM_APB2RST_GPIOARST_SHIFT        (2)
#define CRM_APB2RST_GPIOARST(x)           (x << 2)
#define CRM_APB2RST_GPIOBRST_MASK         (0x01 << 3)
#define CRM_APB2RST_GPIOBRST_SHIFT        (3)
#define CRM_APB2RST_GPIOBRST(x)           (x << 3)
#define CRM_APB2RST_GPIOCRST_MASK         (0x01 << 4)
#define CRM_APB2RST_GPIOCRST_SHIFT        (4)
#define CRM_APB2RST_GPIOCRST(x)           (x << 4)
#define CRM_APB2RST_GPIODRST_MASK         (0x01 << 5)
#define CRM_APB2RST_GPIODRST_SHIFT        (5)
#define CRM_APB2RST_GPIODRST(x)           (x << 5)
#define CRM_APB2RST_GPIOERST_MASK         (0x01 << 6)
#define CRM_APB2RST_GPIOERST_SHIFT        (6)
#define CRM_APB2RST_GPIOERST(x)           (x << 6)
#define CRM_APB2RST_ADC1RST_MASK          (0x01 << 9)
#define CRM_APB2RST_ADC1RST_SHIFT         (9)
#define CRM_APB2RST_ADC1RST(x)            (x << 9)
#define CRM_APB2RST_ADC2RST_MASK          (0x01 << 10)
#define CRM_APB2RST_ADC2RST_SHIFT         (10)
#define CRM_APB2RST_ADC2RST(x)            (x << 10)
#define CRM_APB2RST_TMR1RST_MASK          (0x01 << 11)
#define CRM_APB2RST_TMR1RST_SHIFT         (11)
#define CRM_APB2RST_TMR1RST(x)            (x << 11)
#define CRM_APB2RST_SPI1RST_MASK          (0x01 << 12)
#define CRM_APB2RST_SPI1RST_SHIFT         (12)
#define CRM_APB2RST_SPI1RST(x)            (x << 12)
#define CRM_APB2RST_TMR8RST_MASK          (0x01 << 13)
#define CRM_APB2RST_TMR8RST_SHIFT         (13)
#define CRM_APB2RST_TMR8RST(x)            (x << 13)
#define CRM_APB2RST_USART1RST_MASK        (0x01 << 14)
#define CRM_APB2RST_USART1RST_SHIFT       (14)
#define CRM_APB2RST_USART1RST(x)          (x << 14)
#define CRM_APB2RST_ADC3RST_MASK          (0x01 << 15)
#define CRM_APB2RST_ADC3RST_SHIFT         (15)
#define CRM_APB2RST_ADC3RST(x)            (x << 15)
#define CRM_APB2RST_TMR9RST_MASK          (0x01 << 19)
#define CRM_APB2RST_TMR9RST_SHIFT         (19)
#define CRM_APB2RST_TMR9RST(x)            (x << 19)
#define CRM_APB2RST_TMR10RST_MASK         (0x01 << 20)
#define CRM_APB2RST_TMR10RST_SHIFT        (20)
#define CRM_APB2RST_TMR10RST(x)           (x << 20)
#define CRM_APB2RST_TMR11RST_MASK         (0x01 << 21)
#define CRM_APB2RST_TMR11RST_SHIFT        (21)
#define CRM_APB2RST_TMR11RST(x)           (x << 21)
#define CRM_APB2RST_ACCRST_MASK           (0x01 << 22)
#define CRM_APB2RST_ACCRST_SHIFT          (22)
#define CRM_APB2RST_ACCRST(x)             (x << 22)
#define CRM_APB2RST_I2C3RST_MASK          (0x01 << 23)
#define CRM_APB2RST_I2C3RST_SHIFT         (23)
#define CRM_APB2RST_I2C3RST(x)            (x << 23)
#define CRM_APB2RST_USART6RST_MASK        (0x01 << 24)
#define CRM_APB2RST_USART6RST_SHIFT       (24)
#define CRM_APB2RST_USART6RST(x)          (x << 24)
#define CRM_APB2RST_UART7RST_MASK         (0x01 << 25)
#define CRM_APB2RST_UART7RST_SHIFT        (25)
#define CRM_APB2RST_UART7RST(x)           (x << 25)
#define CRM_APB2RST_UART8RST_MASK         (0x01 << 26)
#define CRM_APB2RST_UART8RST_SHIFT        (26)
#define CRM_APB2RST_UART8RST(x)           (x << 26)
#define CRM_APB1RST_TMR2RST_MASK          (0x01 << 0)
#define CRM_APB1RST_TMR2RST_SHIFT         (0)
#define CRM_APB1RST_TMR2RST(x)            (x << 0)
#define CRM_APB1RST_TMR3RST_MASK          (0x01 << 1)
#define CRM_APB1RST_TMR3RST_SHIFT         (1)
#define CRM_APB1RST_TMR3RST(x)            (x << 1)
#define CRM_APB1RST_TMR4RST_MASK          (0x01 << 2)
#define CRM_APB1RST_TMR4RST_SHIFT         (2)
#define CRM_APB1RST_TMR4RST(x)            (x << 2)
#define CRM_APB1RST_TMR5RST_MASK          (0x01 << 3)
#define CRM_APB1RST_TMR5RST_SHIFT         (3)
#define CRM_APB1RST_TMR5RST(x)            (x << 3)
#define CRM_APB1RST_TMR6RST_MASK          (0x01 << 4)
#define CRM_APB1RST_TMR6RST_SHIFT         (4)
#define CRM_APB1RST_TMR6RST(x)            (x << 4)
#define CRM_APB1RST_TMR7RST_MASK          (0x01 << 5)
#define CRM_APB1RST_TMR7RST_SHIFT         (5)
#define CRM_APB1RST_TMR7RST(x)            (x << 5)
#define CRM_APB1RST_TMR12RST_MASK         (0x01 << 6)
#define CRM_APB1RST_TMR12RST_SHIFT        (6)
#define CRM_APB1RST_TMR12RST(x)           (x << 6)
#define CRM_APB1RST_TMR13RST_MASK         (0x01 << 7)
#define CRM_APB1RST_TMR13RST_SHIFT        (7)
#define CRM_APB1RST_TMR13RST(x)           (x << 7)
#define CRM_APB1RST_TMR14RST_MASK         (0x01 << 8)
#define CRM_APB1RST_TMR14RST_SHIFT        (8)
#define CRM_APB1RST_TMR14RST(x)           (x << 8)
#define CRM_APB1RST_WWDTRST_MASK          (0x01 << 11)
#define CRM_APB1RST_WWDTRST_SHIFT         (11)
#define CRM_APB1RST_WWDTRST(x)            (x << 11)
#define CRM_APB1RST_SPI2RST_MASK          (0x01 << 14)
#define CRM_APB1RST_SPI2RST_SHIFT         (14)
#define CRM_APB1RST_SPI2RST(x)            (x << 14)
#define CRM_APB1RST_SPI3RST_MASK          (0x01 << 15)
#define CRM_APB1RST_SPI3RST_SHIFT         (15)
#define CRM_APB1RST_SPI3RST(x)            (x << 15)
#define CRM_APB1RST_SPI4RST_MASK          (0x01 << 16)
#define CRM_APB1RST_SPI4RST_SHIFT         (16)
#define CRM_APB1RST_SPI4RST(x)            (x << 16)
#define CRM_APB1RST_USART2RST_MASK        (0x01 << 17)
#define CRM_APB1RST_USART2RST_SHIFT       (17)
#define CRM_APB1RST_USART2RST(x)          (x << 17)
#define CRM_APB1RST_USART3RST_MASK        (0x01 << 18)
#define CRM_APB1RST_USART3RST_SHIFT       (18)
#define CRM_APB1RST_USART3RST(x)          (x << 18)
#define CRM_APB1RST_UART4RST_MASK         (0x01 << 19)
#define CRM_APB1RST_UART4RST_SHIFT        (19)
#define CRM_APB1RST_UART4RST(x)           (x << 19)
#define CRM_APB1RST_UART5RST_MASK         (0x01 << 20)
#define CRM_APB1RST_UART5RST_SHIFT        (20)
#define CRM_APB1RST_UART5RST(x)           (x << 20)
#define CRM_APB1RST_I2C1RST_MASK          (0x01 << 21)
#define CRM_APB1RST_I2C1RST_SHIFT         (21)
#define CRM_APB1RST_I2C1RST(x)            (x << 21)
#define CRM_APB1RST_I2C2RST_MASK          (0x01 << 22)
#define CRM_APB1RST_I2C2RST_SHIFT         (22)
#define CRM_APB1RST_I2C2RST(x)            (x << 22)
#define CRM_APB1RST_USBRST_MASK           (0x01 << 23)
#define CRM_APB1RST_USBRST_SHIFT          (23)
#define CRM_APB1RST_USBRST(x)             (x << 23)
#define CRM_APB1RST_CAN1RST_MASK          (0x01 << 25)
#define CRM_APB1RST_CAN1RST_SHIFT         (25)
#define CRM_APB1RST_CAN1RST(x)            (x << 25)
#define CRM_APB1RST_CAN2RST_MASK          (0x01 << 26)
#define CRM_APB1RST_CAN2RST_SHIFT         (26)
#define CRM_APB1RST_CAN2RST(x)            (x << 26)
#define CRM_APB1RST_BPRRST_MASK           (0x01 << 27)
#define CRM_APB1RST_BPRRST_SHIFT          (27)
#define CRM_APB1RST_BPRRST(x)             (x << 27)
#define CRM_APB1RST_PWCRST_MASK           (0x01 << 28)
#define CRM_APB1RST_PWCRST_SHIFT          (28)
#define CRM_APB1RST_PWCRST(x)             (x << 28)
#define CRM_APB1RST_DACRST_MASK           (0x01 << 29)
#define CRM_APB1RST_DACRST_SHIFT          (29)
#define CRM_APB1RST_DACRST(x)             (x << 29)
#define CRM_AHBEN_DMA1EN_MASK             (0x01 << 0)
#define CRM_AHBEN_DMA1EN_SHIFT            (0)
#define CRM_AHBEN_DMA1EN(x)               (x << 0)
#define CRM_AHBEN_DMA2EN_MASK             (0x01 << 1)
#define CRM_AHBEN_DMA2EN_SHIFT            (1)
#define CRM_AHBEN_DMA2EN(x)               (x << 1)
#define CRM_AHBEN_SRAMEN_MASK             (0x01 << 2)
#define CRM_AHBEN_SRAMEN_SHIFT            (2)
#define CRM_AHBEN_SRAMEN(x)               (x << 2)
#define CRM_AHBEN_FLASHEN_MASK            (0x01 << 4)
#define CRM_AHBEN_FLASHEN_SHIFT           (4)
#define CRM_AHBEN_FLASHEN(x)              (x << 4)
#define CRM_AHBEN_CRCEN_MASK              (0x01 << 6)
#define CRM_AHBEN_CRCEN_SHIFT             (6)
#define CRM_AHBEN_CRCEN(x)                (x << 6)
#define CRM_AHBEN_XMCEN_MASK              (0x01 << 8)
#define CRM_AHBEN_XMCEN_SHIFT             (8)
#define CRM_AHBEN_XMCEN(x)                (x << 8)
#define CRM_AHBEN_SDIO1EN_MASK            (0x01 << 10)
#define CRM_AHBEN_SDIO1EN_SHIFT           (10)
#define CRM_AHBEN_SDIO1EN(x)              (x << 10)
#define CRM_AHBEN_SDIO2EN_MASK            (0x01 << 11)
#define CRM_AHBEN_SDIO2EN_SHIFT           (11)
#define CRM_AHBEN_SDIO2EN(x)              (x << 11)
#define CRM_AHBEN_EMACEN_MASK             (0x01 << 14)
#define CRM_AHBEN_EMACEN_SHIFT            (14)
#define CRM_AHBEN_EMACEN(x)               (x << 14)
#define CRM_AHBEN_EMACTXEN_MASK           (0x01 << 15)
#define CRM_AHBEN_EMACTXEN_SHIFT          (15)
#define CRM_AHBEN_EMACTXEN(x)             (x << 15)
#define CRM_AHBEN_EMACRXEN_MASK           (0x01 << 16)
#define CRM_AHBEN_EMACRXEN_SHIFT          (16)
#define CRM_AHBEN_EMACRXEN(x)             (x << 16)
#define CRM_AHBEN_EMACPTPEN_MASK          (0x01 << 28)
#define CRM_AHBEN_EMACPTPEN_SHIFT         (28)
#define CRM_AHBEN_EMACPTPEN(x)            (x << 28)
#define CRM_APB2EN_IOMUXEN_MASK           (0x01 << 0)
#define CRM_APB2EN_IOMUXEN_SHIFT          (0)
#define CRM_APB2EN_IOMUXEN(x)             (x << 0)
#define CRM_APB2EN_GPIOAEN_MASK           (0x01 << 2)
#define CRM_APB2EN_GPIOAEN_SHIFT          (2)
#define CRM_APB2EN_GPIOAEN(x)             (x << 2)
#define CRM_APB2EN_GPIOBEN_MASK           (0x01 << 3)
#define CRM_APB2EN_GPIOBEN_SHIFT          (3)
#define CRM_APB2EN_GPIOBEN(x)             (x << 3)
#define CRM_APB2EN_GPIOCEN_MASK           (0x01 << 4)
#define CRM_APB2EN_GPIOCEN_SHIFT          (4)
#define CRM_APB2EN_GPIOCEN(x)             (x << 4)
#define CRM_APB2EN_GPIODEN_MASK           (0x01 << 5)
#define CRM_APB2EN_GPIODEN_SHIFT          (5)
#define CRM_APB2EN_GPIODEN(x)             (x << 5)
#define CRM_APB2EN_GPIOEEN_MASK           (0x01 << 6)
#define CRM_APB2EN_GPIOEEN_SHIFT          (6)
#define CRM_APB2EN_GPIOEEN(x)             (x << 6)
#define CRM_APB2EN_ADC1EN_MASK            (0x01 << 9)
#define CRM_APB2EN_ADC1EN_SHIFT           (9)
#define CRM_APB2EN_ADC1EN(x)              (x << 9)
#define CRM_APB2EN_ADC2EN_MASK            (0x01 << 10)
#define CRM_APB2EN_ADC2EN_SHIFT           (10)
#define CRM_APB2EN_ADC2EN(x)              (x << 10)
#define CRM_APB2EN_TMR1EN_MASK            (0x01 << 11)
#define CRM_APB2EN_TMR1EN_SHIFT           (11)
#define CRM_APB2EN_TMR1EN(x)              (x << 11)
#define CRM_APB2EN_SPI1EN_MASK            (0x01 << 12)
#define CRM_APB2EN_SPI1EN_SHIFT           (12)
#define CRM_APB2EN_SPI1EN(x)              (x << 12)
#define CRM_APB2EN_TMR8EN_MASK            (0x01 << 13)
#define CRM_APB2EN_TMR8EN_SHIFT           (13)
#define CRM_APB2EN_TMR8EN(x)              (x << 13)
#define CRM_APB2EN_USART1EN_MASK          (0x01 << 14)
#define CRM_APB2EN_USART1EN_SHIFT         (14)
#define CRM_APB2EN_USART1EN(x)            (x << 14)
#define CRM_APB2EN_ADC3EN_MASK            (0x01 << 15)
#define CRM_APB2EN_ADC3EN_SHIFT           (15)
#define CRM_APB2EN_ADC3EN(x)              (x << 15)
#define CRM_APB2EN_TMR9EN_MASK            (0x01 << 19)
#define CRM_APB2EN_TMR9EN_SHIFT           (19)
#define CRM_APB2EN_TMR9EN(x)              (x << 19)
#define CRM_APB2EN_TMR10EN_MASK           (0x01 << 20)
#define CRM_APB2EN_TMR10EN_SHIFT          (20)
#define CRM_APB2EN_TMR10EN(x)             (x << 20)
#define CRM_APB2EN_TMR11EN_MASK           (0x01 << 21)
#define CRM_APB2EN_TMR11EN_SHIFT          (21)
#define CRM_APB2EN_TMR11EN(x)             (x << 21)
#define CRM_APB2EN_ACCEN_MASK             (0x01 << 22)
#define CRM_APB2EN_ACCEN_SHIFT            (22)
#define CRM_APB2EN_ACCEN(x)               (x << 22)
#define CRM_APB2EN_I2C3EN_MASK            (0x01 << 23)
#define CRM_APB2EN_I2C3EN_SHIFT           (23)
#define CRM_APB2EN_I2C3EN(x)              (x << 23)
#define CRM_APB2EN_USART6EN_MASK          (0x01 << 24)
#define CRM_APB2EN_USART6EN_SHIFT         (24)
#define CRM_APB2EN_USART6EN(x)            (x << 24)
#define CRM_APB2EN_UART7EN_MASK           (0x01 << 25)
#define CRM_APB2EN_UART7EN_SHIFT          (25)
#define CRM_APB2EN_UART7EN(x)             (x << 25)
#define CRM_APB2EN_UART8EN_MASK           (0x01 << 26)
#define CRM_APB2EN_UART8EN_SHIFT          (26)
#define CRM_APB2EN_UART8EN(x)             (x << 26)
#define CRM_APB1EN_TMR2EN_MASK            (0x01 << 0)
#define CRM_APB1EN_TMR2EN_SHIFT           (0)
#define CRM_APB1EN_TMR2EN(x)              (x << 0)
#define CRM_APB1EN_TMR3EN_MASK            (0x01 << 1)
#define CRM_APB1EN_TMR3EN_SHIFT           (1)
#define CRM_APB1EN_TMR3EN(x)              (x << 1)
#define CRM_APB1EN_TMR4EN_MASK            (0x01 << 2)
#define CRM_APB1EN_TMR4EN_SHIFT           (2)
#define CRM_APB1EN_TMR4EN(x)              (x << 2)
#define CRM_APB1EN_TMR5EN_MASK            (0x01 << 3)
#define CRM_APB1EN_TMR5EN_SHIFT           (3)
#define CRM_APB1EN_TMR5EN(x)              (x << 3)
#define CRM_APB1EN_TMR6EN_MASK            (0x01 << 4)
#define CRM_APB1EN_TMR6EN_SHIFT           (4)
#define CRM_APB1EN_TMR6EN(x)              (x << 4)
#define CRM_APB1EN_TMR7EN_MASK            (0x01 << 5)
#define CRM_APB1EN_TMR7EN_SHIFT           (5)
#define CRM_APB1EN_TMR7EN(x)              (x << 5)
#define CRM_APB1EN_TMR12EN_MASK           (0x01 << 6)
#define CRM_APB1EN_TMR12EN_SHIFT          (6)
#define CRM_APB1EN_TMR12EN(x)             (x << 6)
#define CRM_APB1EN_TMR13EN_MASK           (0x01 << 7)
#define CRM_APB1EN_TMR13EN_SHIFT          (7)
#define CRM_APB1EN_TMR13EN(x)             (x << 7)
#define CRM_APB1EN_TMR14EN_MASK           (0x01 << 8)
#define CRM_APB1EN_TMR14EN_SHIFT          (8)
#define CRM_APB1EN_TMR14EN(x)             (x << 8)
#define CRM_APB1EN_WWDTEN_MASK            (0x01 << 11)
#define CRM_APB1EN_WWDTEN_SHIFT           (11)
#define CRM_APB1EN_WWDTEN(x)              (x << 11)
#define CRM_APB1EN_SPI2EN_MASK            (0x01 << 14)
#define CRM_APB1EN_SPI2EN_SHIFT           (14)
#define CRM_APB1EN_SPI2EN(x)              (x << 14)
#define CRM_APB1EN_SPI3EN_MASK            (0x01 << 15)
#define CRM_APB1EN_SPI3EN_SHIFT           (15)
#define CRM_APB1EN_SPI3EN(x)              (x << 15)
#define CRM_APB1EN_SPI4EN_MASK            (0x01 << 16)
#define CRM_APB1EN_SPI4EN_SHIFT           (16)
#define CRM_APB1EN_SPI4EN(x)              (x << 16)
#define CRM_APB1EN_USART2EN_MASK          (0x01 << 17)
#define CRM_APB1EN_USART2EN_SHIFT         (17)
#define CRM_APB1EN_USART2EN(x)            (x << 17)
#define CRM_APB1EN_USART3EN_MASK          (0x01 << 18)
#define CRM_APB1EN_USART3EN_SHIFT         (18)
#define CRM_APB1EN_USART3EN(x)            (x << 18)
#define CRM_APB1EN_UART4EN_MASK           (0x01 << 19)
#define CRM_APB1EN_UART4EN_SHIFT          (19)
#define CRM_APB1EN_UART4EN(x)             (x << 19)
#define CRM_APB1EN_UART5EN_MASK           (0x01 << 20)
#define CRM_APB1EN_UART5EN_SHIFT          (20)
#define CRM_APB1EN_UART5EN(x)             (x << 20)
#define CRM_APB1EN_I2C1EN_MASK            (0x01 << 21)
#define CRM_APB1EN_I2C1EN_SHIFT           (21)
#define CRM_APB1EN_I2C1EN(x)              (x << 21)
#define CRM_APB1EN_I2C2EN_MASK            (0x01 << 22)
#define CRM_APB1EN_I2C2EN_SHIFT           (22)
#define CRM_APB1EN_I2C2EN(x)              (x << 22)
#define CRM_APB1EN_USBEN_MASK             (0x01 << 23)
#define CRM_APB1EN_USBEN_SHIFT            (23)
#define CRM_APB1EN_USBEN(x)               (x << 23)
#define CRM_APB1EN_CAN1EN_MASK            (0x01 << 25)
#define CRM_APB1EN_CAN1EN_SHIFT           (25)
#define CRM_APB1EN_CAN1EN(x)              (x << 25)
#define CRM_APB1EN_CAN2EN_MASK            (0x01 << 26)
#define CRM_APB1EN_CAN2EN_SHIFT           (26)
#define CRM_APB1EN_CAN2EN(x)              (x << 26)
#define CRM_APB1EN_BPREN_MASK             (0x01 << 27)
#define CRM_APB1EN_BPREN_SHIFT            (27)
#define CRM_APB1EN_BPREN(x)               (x << 27)
#define CRM_APB1EN_PWCEN_MASK             (0x01 << 28)
#define CRM_APB1EN_PWCEN_SHIFT            (28)
