eeucalyptus/at32f403a_minimal/at32f403a.h
#define CRM_APB1EN_PWCEN(x)               (x << 28)
#define CRM_APB1EN_DACEN_MASK             (0x01 << 29)
#define CRM_APB1EN_DACEN_SHIFT            (29)
#define CRM_APB1EN_DACEN(x)               (x << 29)
#define CRM_BPDC_LEXTEN_MASK              (0x01 << 0)
#define CRM_BPDC_LEXTEN_SHIFT             (0)
#define CRM_BPDC_LEXTEN(x)                (x << 0)
#define CRM_BPDC_LEXTSTBL_MASK            (0x01 << 1)
#define CRM_BPDC_LEXTSTBL_SHIFT           (1)
#define CRM_BPDC_LEXTSTBL(x)              (x << 1)
#define CRM_BPDC_LEXTBYPS_MASK            (0x01 << 2)
#define CRM_BPDC_LEXTBYPS_SHIFT           (2)
#define CRM_BPDC_LEXTBYPS(x)              (x << 2)
#define CRM_BPDC_RTCSEL_MASK              (0x03 << 8)
#define CRM_BPDC_RTCSEL_SHIFT             (8)
#define CRM_BPDC_RTCSEL(x)                (x << 8)
#define CRM_BPDC_RTCEN_MASK               (0x01 << 15)
#define CRM_BPDC_RTCEN_SHIFT              (15)
#define CRM_BPDC_RTCEN(x)                 (x << 15)
#define CRM_BPDC_BPDRST_MASK              (0x01 << 16)
#define CRM_BPDC_BPDRST_SHIFT             (16)
#define CRM_BPDC_BPDRST(x)                (x << 16)
#define CRM_CTRLSTS_LICKEN_MASK           (0x01 << 0)
#define CRM_CTRLSTS_LICKEN_SHIFT          (0)
#define CRM_CTRLSTS_LICKEN(x)             (x << 0)
#define CRM_CTRLSTS_LICKSTBL_MASK         (0x01 << 1)
#define CRM_CTRLSTS_LICKSTBL_SHIFT        (1)
#define CRM_CTRLSTS_LICKSTBL(x)           (x << 1)
#define CRM_CTRLSTS_RSTFC_MASK            (0x01 << 24)
#define CRM_CTRLSTS_RSTFC_SHIFT           (24)
#define CRM_CTRLSTS_RSTFC(x)              (x << 24)
#define CRM_CTRLSTS_NRSTF_MASK            (0x01 << 26)
#define CRM_CTRLSTS_NRSTF_SHIFT           (26)
#define CRM_CTRLSTS_NRSTF(x)              (x << 26)
#define CRM_CTRLSTS_PORRSTF_MASK          (0x01 << 27)
#define CRM_CTRLSTS_PORRSTF_SHIFT         (27)
#define CRM_CTRLSTS_PORRSTF(x)            (x << 27)
#define CRM_CTRLSTS_SWRSTF_MASK           (0x01 << 28)
#define CRM_CTRLSTS_SWRSTF_SHIFT          (28)
#define CRM_CTRLSTS_SWRSTF(x)             (x << 28)
#define CRM_CTRLSTS_WDTRSTF_MASK          (0x01 << 29)
#define CRM_CTRLSTS_WDTRSTF_SHIFT         (29)
#define CRM_CTRLSTS_WDTRSTF(x)            (x << 29)
#define CRM_CTRLSTS_WWDTRSTF_MASK         (0x01 << 30)
#define CRM_CTRLSTS_WWDTRSTF_SHIFT        (30)
#define CRM_CTRLSTS_WWDTRSTF(x)           (x << 30)
#define CRM_CTRLSTS_LPRSTF_MASK           (0x01 << 31)
#define CRM_CTRLSTS_LPRSTF_SHIFT          (31)
#define CRM_CTRLSTS_LPRSTF(x)             (x << 31)
#define CRM_AHBRST_EMACRST_MASK           (0x01 << 14)
#define CRM_AHBRST_EMACRST_SHIFT          (14)
#define CRM_AHBRST_EMACRST(x)             (x << 14)
#define CRM_MISC1_HICKCAL_KEY_MASK        (0xff << 0)
#define CRM_MISC1_HICKCAL_KEY_SHIFT       (0)
#define CRM_MISC1_HICKCAL_KEY(x)          (x << 0)
#define CRM_MISC1_CLKOUT_SEL3_MASK        (0x01 << 16)
#define CRM_MISC1_CLKOUT_SEL3_SHIFT       (16)
#define CRM_MISC1_CLKOUT_SEL3(x)          (x << 16)
#define CRM_MISC1_USBBUFS_MASK            (0x01 << 24)
#define CRM_MISC1_USBBUFS_SHIFT           (24)
#define CRM_MISC1_USBBUFS(x)              (x << 24)
#define CRM_MISC1_HICKDIV_MASK            (0x01 << 25)
#define CRM_MISC1_HICKDIV_SHIFT           (25)
#define CRM_MISC1_HICKDIV(x)              (x << 25)
#define CRM_MISC1_CLKOUTDIV_MASK          (0x0f << 28)
#define CRM_MISC1_CLKOUTDIV_SHIFT         (28)
#define CRM_MISC1_CLKOUTDIV(x)            (x << 28)
#define CRM_MISC2_CLK_TO_TMR_MASK         (0x01 << 16)
#define CRM_MISC2_CLK_TO_TMR_SHIFT        (16)
#define CRM_MISC2_CLK_TO_TMR(x)           (x << 16)
#define CRM_MISC3_AUTO_STEP_EN_MASK       (0x03 << 4)
#define CRM_MISC3_AUTO_STEP_EN_SHIFT      (4)
#define CRM_MISC3_AUTO_STEP_EN(x)         (x << 4)
#define CRM_MISC3_HICK_TO_USB_MASK        (0x01 << 8)
#define CRM_MISC3_HICK_TO_USB_SHIFT       (8)
#define CRM_MISC3_HICK_TO_USB(x)          (x << 8)
#define CRM_MISC3_HICK_TO_SCLK_MASK       (0x01 << 9)
#define CRM_MISC3_HICK_TO_SCLK_SHIFT      (9)
#define CRM_MISC3_HICK_TO_SCLK(x)         (x << 9)
#define CRM_MISC3_HEXTDIV_MASK            (0x03 << 12)
#define CRM_MISC3_HEXTDIV_SHIFT           (12)
#define CRM_MISC3_HEXTDIV(x)              (x << 12)
#define CRM_MISC3_EMAC_PPS_SEL_MASK       (0x01 << 15)
#define CRM_MISC3_EMAC_PPS_SEL_SHIFT      (15)
#define CRM_MISC3_EMAC_PPS_SEL(x)         (x << 15)
#define CRM_INTMAP_USB_INT_MAP_MASK       (0x01 << 0)
#define CRM_INTMAP_USB_INT_MAP_SHIFT      (0)
#define CRM_INTMAP_USB_INT_MAP(x)         (x << 0)

/* GPIOA - General purpose IO */
#define GPIO_CFGLR_IOMC0_MASK             (0x03 << 0)
#define GPIO_CFGLR_IOMC0_SHIFT            (0)
#define GPIO_CFGLR_IOMC0(x)               (x << 0)
#define GPIO_CFGLR_IOFC0_MASK             (0x03 << 2)
#define GPIO_CFGLR_IOFC0_SHIFT            (2)
#define GPIO_CFGLR_IOFC0(x)               (x << 2)
#define GPIO_CFGLR_IOMC1_MASK             (0x03 << 4)
#define GPIO_CFGLR_IOMC1_SHIFT            (4)
#define GPIO_CFGLR_IOMC1(x)               (x << 4)
#define GPIO_CFGLR_IOFC1_MASK             (0x03 << 6)
#define GPIO_CFGLR_IOFC1_SHIFT            (6)
#define GPIO_CFGLR_IOFC1(x)               (x << 6)
#define GPIO_CFGLR_IOMC2_MASK             (0x03 << 8)
#define GPIO_CFGLR_IOMC2_SHIFT            (8)
#define GPIO_CFGLR_IOMC2(x)               (x << 8)
#define GPIO_CFGLR_IOFC2_MASK             (0x03 << 10)
#define GPIO_CFGLR_IOFC2_SHIFT            (10)
#define GPIO_CFGLR_IOFC2(x)               (x << 10)
#define GPIO_CFGLR_IOMC3_MASK             (0x03 << 12)
#define GPIO_CFGLR_IOMC3_SHIFT            (12)
#define GPIO_CFGLR_IOMC3(x)               (x << 12)
#define GPIO_CFGLR_IOFC3_MASK             (0x03 << 14)
#define GPIO_CFGLR_IOFC3_SHIFT            (14)
#define GPIO_CFGLR_IOFC3(x)               (x << 14)
#define GPIO_CFGLR_IOMC4_MASK             (0x03 << 16)
#define GPIO_CFGLR_IOMC4_SHIFT            (16)
#define GPIO_CFGLR_IOMC4(x)               (x << 16)
#define GPIO_CFGLR_IOFC4_MASK             (0x03 << 18)
#define GPIO_CFGLR_IOFC4_SHIFT            (18)
#define GPIO_CFGLR_IOFC4(x)               (x << 18)
#define GPIO_CFGLR_IOMC5_MASK             (0x03 << 20)
#define GPIO_CFGLR_IOMC5_SHIFT            (20)
#define GPIO_CFGLR_IOMC5(x)               (x << 20)
#define GPIO_CFGLR_IOFC5_MASK             (0x03 << 22)
#define GPIO_CFGLR_IOFC5_SHIFT            (22)
#define GPIO_CFGLR_IOFC5(x)               (x << 22)
#define GPIO_CFGLR_IOMC6_MASK             (0x03 << 24)
#define GPIO_CFGLR_IOMC6_SHIFT            (24)
#define GPIO_CFGLR_IOMC6(x)               (x << 24)
#define GPIO_CFGLR_IOFC6_MASK             (0x03 << 26)
#define GPIO_CFGLR_IOFC6_SHIFT            (26)
#define GPIO_CFGLR_IOFC6(x)               (x << 26)
#define GPIO_CFGLR_IOMC7_MASK             (0x03 << 28)
#define GPIO_CFGLR_IOMC7_SHIFT            (28)
#define GPIO_CFGLR_IOMC7(x)               (x << 28)
#define GPIO_CFGLR_IOFC7_MASK             (0x03 << 30)
#define GPIO_CFGLR_IOFC7_SHIFT            (30)
#define GPIO_CFGLR_IOFC7(x)               (x << 30)
#define GPIO_CFGHR_IOMC8_MASK             (0x03 << 0)
#define GPIO_CFGHR_IOMC8_SHIFT            (0)
#define GPIO_CFGHR_IOMC8(x)               (x << 0)
#define GPIO_CFGHR_IOFC8_MASK             (0x03 << 2)
#define GPIO_CFGHR_IOFC8_SHIFT            (2)
#define GPIO_CFGHR_IOFC8(x)               (x << 2)
#define GPIO_CFGHR_IOMC9_MASK             (0x03 << 4)
#define GPIO_CFGHR_IOMC9_SHIFT            (4)
#define GPIO_CFGHR_IOMC9(x)               (x << 4)
#define GPIO_CFGHR_IOFC9_MASK             (0x03 << 6)
#define GPIO_CFGHR_IOFC9_SHIFT            (6)
#define GPIO_CFGHR_IOFC9(x)               (x << 6)
#define GPIO_CFGHR_IOMC10_MASK            (0x03 << 8)
#define GPIO_CFGHR_IOMC10_SHIFT           (8)
#define GPIO_CFGHR_IOMC10(x)              (x << 8)
#define GPIO_CFGHR_IOFC10_MASK            (0x03 << 10)
#define GPIO_CFGHR_IOFC10_SHIFT           (10)
#define GPIO_CFGHR_IOFC10(x)              (x << 10)
#define GPIO_CFGHR_IOMC11_MASK            (0x03 << 12)
#define GPIO_CFGHR_IOMC11_SHIFT           (12)
#define GPIO_CFGHR_IOMC11(x)              (x << 12)
#define GPIO_CFGHR_IOFC11_MASK            (0x03 << 14)
#define GPIO_CFGHR_IOFC11_SHIFT           (14)
#define GPIO_CFGHR_IOFC11(x)              (x << 14)
#define GPIO_CFGHR_IOMC12_MASK            (0x03 << 16)
#define GPIO_CFGHR_IOMC12_SHIFT           (16)
#define GPIO_CFGHR_IOMC12(x)              (x << 16)
#define GPIO_CFGHR_IOFC12_MASK            (0x03 << 18)
#define GPIO_CFGHR_IOFC12_SHIFT           (18)
#define GPIO_CFGHR_IOFC12(x)              (x << 18)
#define GPIO_CFGHR_IOMC13_MASK            (0x03 << 20)
#define GPIO_CFGHR_IOMC13_SHIFT           (20)
#define GPIO_CFGHR_IOMC13(x)              (x << 20)
#define GPIO_CFGHR_IOFC13_MASK            (0x03 << 22)
#define GPIO_CFGHR_IOFC13_SHIFT           (22)
#define GPIO_CFGHR_IOFC13(x)              (x << 22)
#define GPIO_CFGHR_IOMC14_MASK            (0x03 << 24)
#define GPIO_CFGHR_IOMC14_SHIFT           (24)
#define GPIO_CFGHR_IOMC14(x)              (x << 24)
#define GPIO_CFGHR_IOFC14_MASK            (0x03 << 26)
#define GPIO_CFGHR_IOFC14_SHIFT           (26)
#define GPIO_CFGHR_IOFC14(x)              (x << 26)
#define GPIO_CFGHR_IOMC15_MASK            (0x03 << 28)
#define GPIO_CFGHR_IOMC15_SHIFT           (28)
#define GPIO_CFGHR_IOMC15(x)              (x << 28)
#define GPIO_CFGHR_IOFC15_MASK            (0x03 << 30)
#define GPIO_CFGHR_IOFC15_SHIFT           (30)
#define GPIO_CFGHR_IOFC15(x)              (x << 30)
#define GPIO_IDT_IDT0_MASK                (0x01 << 0)
#define GPIO_IDT_IDT0_SHIFT               (0)
#define GPIO_IDT_IDT0(x)                  (x << 0)
#define GPIO_IDT_IDT1_MASK                (0x01 << 1)
#define GPIO_IDT_IDT1_SHIFT               (1)
#define GPIO_IDT_IDT1(x)                  (x << 1)
#define GPIO_IDT_IDT2_MASK                (0x01 << 2)
#define GPIO_IDT_IDT2_SHIFT               (2)
#define GPIO_IDT_IDT2(x)                  (x << 2)
#define GPIO_IDT_IDT3_MASK                (0x01 << 3)
#define GPIO_IDT_IDT3_SHIFT               (3)
#define GPIO_IDT_IDT3(x)                  (x << 3)
#define GPIO_IDT_IDT4_MASK                (0x01 << 4)
#define GPIO_IDT_IDT4_SHIFT               (4)
#define GPIO_IDT_IDT4(x)                  (x << 4)
#define GPIO_IDT_IDT5_MASK                (0x01 << 5)
#define GPIO_IDT_IDT5_SHIFT               (5)
#define GPIO_IDT_IDT5(x)                  (x << 5)
#define GPIO_IDT_IDT6_MASK                (0x01 << 6)
#define GPIO_IDT_IDT6_SHIFT               (6)
#define GPIO_IDT_IDT6(x)                  (x << 6)
#define GPIO_IDT_IDT7_MASK                (0x01 << 7)
#define GPIO_IDT_IDT7_SHIFT               (7)
#define GPIO_IDT_IDT7(x)                  (x << 7)
#define GPIO_IDT_IDT8_MASK                (0x01 << 8)
#define GPIO_IDT_IDT8_SHIFT               (8)
#define GPIO_IDT_IDT8(x)                  (x << 8)
#define GPIO_IDT_IDT9_MASK                (0x01 << 9)
#define GPIO_IDT_IDT9_SHIFT               (9)
#define GPIO_IDT_IDT9(x)                  (x << 9)
#define GPIO_IDT_IDT10_MASK               (0x01 << 10)
#define GPIO_IDT_IDT10_SHIFT              (10)
#define GPIO_IDT_IDT10(x)                 (x << 10)
#define GPIO_IDT_IDT11_MASK               (0x01 << 11)
#define GPIO_IDT_IDT11_SHIFT              (11)
#define GPIO_IDT_IDT11(x)                 (x << 11)
#define GPIO_IDT_IDT12_MASK               (0x01 << 12)
#define GPIO_IDT_IDT12_SHIFT              (12)
#define GPIO_IDT_IDT12(x)                 (x << 12)
#define GPIO_IDT_IDT13_MASK               (0x01 << 13)
#define GPIO_IDT_IDT13_SHIFT              (13)
#define GPIO_IDT_IDT13(x)                 (x << 13)
#define GPIO_IDT_IDT14_MASK               (0x01 << 14)
#define GPIO_IDT_IDT14_SHIFT              (14)
#define GPIO_IDT_IDT14(x)                 (x << 14)
#define GPIO_IDT_IDT15_MASK               (0x01 << 15)
#define GPIO_IDT_IDT15_SHIFT              (15)
#define GPIO_IDT_IDT15(x)                 (x << 15)
#define GPIO_ODT_ODT0_MASK                (0x01 << 0)
#define GPIO_ODT_ODT0_SHIFT               (0)
#define GPIO_ODT_ODT0(x)                  (x << 0)
#define GPIO_ODT_ODT1_MASK                (0x01 << 1)
#define GPIO_ODT_ODT1_SHIFT               (1)
#define GPIO_ODT_ODT1(x)                  (x << 1)
#define GPIO_ODT_ODT2_MASK                (0x01 << 2)
#define GPIO_ODT_ODT2_SHIFT               (2)
#define GPIO_ODT_ODT2(x)                  (x << 2)
#define GPIO_ODT_ODT3_MASK                (0x01 << 3)
#define GPIO_ODT_ODT3_SHIFT               (3)
#define GPIO_ODT_ODT3(x)                  (x << 3)
#define GPIO_ODT_ODT4_MASK                (0x01 << 4)
#define GPIO_ODT_ODT4_SHIFT               (4)
#define GPIO_ODT_ODT4(x)                  (x << 4)
#define GPIO_ODT_ODT5_MASK                (0x01 << 5)
#define GPIO_ODT_ODT5_SHIFT               (5)
#define GPIO_ODT_ODT5(x)                  (x << 5)
#define GPIO_ODT_ODT6_MASK                (0x01 << 6)
#define GPIO_ODT_ODT6_SHIFT               (6)
#define GPIO_ODT_ODT6(x)                  (x << 6)
#define GPIO_ODT_ODT7_MASK                (0x01 << 7)
#define GPIO_ODT_ODT7_SHIFT               (7)
#define GPIO_ODT_ODT7(x)                  (x << 7)
#define GPIO_ODT_ODT8_MASK                (0x01 << 8)
#define GPIO_ODT_ODT8_SHIFT               (8)
#define GPIO_ODT_ODT8(x)                  (x << 8)
#define GPIO_ODT_ODT9_MASK                (0x01 << 9)
#define GPIO_ODT_ODT9_SHIFT               (9)
#define GPIO_ODT_ODT9(x)                  (x << 9)
#define GPIO_ODT_ODT10_MASK               (0x01 << 10)
#define GPIO_ODT_ODT10_SHIFT              (10)
#define GPIO_ODT_ODT10(x)                 (x << 10)
#define GPIO_ODT_ODT11_MASK               (0x01 << 11)
#define GPIO_ODT_ODT11_SHIFT              (11)
#define GPIO_ODT_ODT11(x)                 (x << 11)
#define GPIO_ODT_ODT12_MASK               (0x01 << 12)
#define GPIO_ODT_ODT12_SHIFT              (12)
#define GPIO_ODT_ODT12(x)                 (x << 12)
#define GPIO_ODT_ODT13_MASK               (0x01 << 13)
#define GPIO_ODT_ODT13_SHIFT              (13)
#define GPIO_ODT_ODT13(x)                 (x << 13)
#define GPIO_ODT_ODT14_MASK               (0x01 << 14)
#define GPIO_ODT_ODT14_SHIFT              (14)
#define GPIO_ODT_ODT14(x)                 (x << 14)
#define GPIO_ODT_ODT15_MASK               (0x01 << 15)
#define GPIO_ODT_ODT15_SHIFT              (15)
#define GPIO_ODT_ODT15(x)                 (x << 15)
#define GPIO_SCR_IOSB0_MASK               (0x01 << 0)
#define GPIO_SCR_IOSB0_SHIFT              (0)
#define GPIO_SCR_IOSB0(x)                 (x << 0)
#define GPIO_SCR_IOSB1_MASK               (0x01 << 1)
#define GPIO_SCR_IOSB1_SHIFT              (1)
#define GPIO_SCR_IOSB1(x)                 (x << 1)
#define GPIO_SCR_IOSB2_MASK               (0x01 << 2)
#define GPIO_SCR_IOSB2_SHIFT              (2)
#define GPIO_SCR_IOSB2(x)                 (x << 2)
#define GPIO_SCR_IOSB3_MASK               (0x01 << 3)
#define GPIO_SCR_IOSB3_SHIFT              (3)
#define GPIO_SCR_IOSB3(x)                 (x << 3)
#define GPIO_SCR_IOSB4_MASK               (0x01 << 4)
#define GPIO_SCR_IOSB4_SHIFT              (4)
#define GPIO_SCR_IOSB4(x)                 (x << 4)
#define GPIO_SCR_IOSB5_MASK               (0x01 << 5)
#define GPIO_SCR_IOSB5_SHIFT              (5)
#define GPIO_SCR_IOSB5(x)                 (x << 5)
#define GPIO_SCR_IOSB6_MASK               (0x01 << 6)
#define GPIO_SCR_IOSB6_SHIFT              (6)
#define GPIO_SCR_IOSB6(x)                 (x << 6)
#define GPIO_SCR_IOSB7_MASK               (0x01 << 7)
#define GPIO_SCR_IOSB7_SHIFT              (7)
#define GPIO_SCR_IOSB7(x)                 (x << 7)
#define GPIO_SCR_IOSB8_MASK               (0x01 << 8)
#define GPIO_SCR_IOSB8_SHIFT              (8)
#define GPIO_SCR_IOSB8(x)                 (x << 8)
#define GPIO_SCR_IOSB9_MASK               (0x01 << 9)
#define GPIO_SCR_IOSB9_SHIFT              (9)
#define GPIO_SCR_IOSB9(x)                 (x << 9)
#define GPIO_SCR_IOSB10_MASK              (0x01 << 10)
#define GPIO_SCR_IOSB10_SHIFT             (10)
#define GPIO_SCR_IOSB10(x)                (x << 10)
#define GPIO_SCR_IOSB11_MASK              (0x01 << 11)
#define GPIO_SCR_IOSB11_SHIFT             (11)
#define GPIO_SCR_IOSB11(x)                (x << 11)
#define GPIO_SCR_IOSB12_MASK              (0x01 << 12)
#define GPIO_SCR_IOSB12_SHIFT             (12)
#define GPIO_SCR_IOSB12(x)                (x << 12)
#define GPIO_SCR_IOSB13_MASK              (0x01 << 13)
#define GPIO_SCR_IOSB13_SHIFT             (13)
#define GPIO_SCR_IOSB13(x)                (x << 13)
#define GPIO_SCR_IOSB14_MASK              (0x01 << 14)
#define GPIO_SCR_IOSB14_SHIFT             (14)
#define GPIO_SCR_IOSB14(x)                (x << 14)
#define GPIO_SCR_IOSB15_MASK              (0x01 << 15)
#define GPIO_SCR_IOSB15_SHIFT             (15)
#define GPIO_SCR_IOSB15(x)                (x << 15)
#define GPIO_SCR_IOCB0_MASK               (0x01 << 16)
#define GPIO_SCR_IOCB0_SHIFT              (16)
#define GPIO_SCR_IOCB0(x)                 (x << 16)
#define GPIO_SCR_IOCB1_MASK               (0x01 << 17)
#define GPIO_SCR_IOCB1_SHIFT              (17)
#define GPIO_SCR_IOCB1(x)                 (x << 17)
#define GPIO_SCR_IOCB2_MASK               (0x01 << 18)
#define GPIO_SCR_IOCB2_SHIFT              (18)
#define GPIO_SCR_IOCB2(x)                 (x << 18)
#define GPIO_SCR_IOCB3_MASK               (0x01 << 19)
#define GPIO_SCR_IOCB3_SHIFT              (19)
#define GPIO_SCR_IOCB3(x)                 (x << 19)
#define GPIO_SCR_IOCB4_MASK               (0x01 << 20)
#define GPIO_SCR_IOCB4_SHIFT              (20)
#define GPIO_SCR_IOCB4(x)                 (x << 20)
#define GPIO_SCR_IOCB5_MASK               (0x01 << 21)
#define GPIO_SCR_IOCB5_SHIFT              (21)
#define GPIO_SCR_IOCB5(x)                 (x << 21)
#define GPIO_SCR_IOCB6_MASK               (0x01 << 22)
#define GPIO_SCR_IOCB6_SHIFT              (22)
#define GPIO_SCR_IOCB6(x)                 (x << 22)
#define GPIO_SCR_IOCB7_MASK               (0x01 << 23)
#define GPIO_SCR_IOCB7_SHIFT              (23)
#define GPIO_SCR_IOCB7(x)                 (x << 23)
#define GPIO_SCR_IOCB8_MASK               (0x01 << 24)
#define GPIO_SCR_IOCB8_SHIFT              (24)
#define GPIO_SCR_IOCB8(x)                 (x << 24)
#define GPIO_SCR_IOCB9_MASK               (0x01 << 25)
#define GPIO_SCR_IOCB9_SHIFT              (25)
#define GPIO_SCR_IOCB9(x)                 (x << 25)
#define GPIO_SCR_IOCB10_MASK              (0x01 << 26)
#define GPIO_SCR_IOCB10_SHIFT             (26)
#define GPIO_SCR_IOCB10(x)                (x << 26)
#define GPIO_SCR_IOCB11_MASK              (0x01 << 27)
#define GPIO_SCR_IOCB11_SHIFT             (27)
#define GPIO_SCR_IOCB11(x)                (x << 27)
#define GPIO_SCR_IOCB12_MASK              (0x01 << 28)
#define GPIO_SCR_IOCB12_SHIFT             (28)
#define GPIO_SCR_IOCB12(x)                (x << 28)
#define GPIO_SCR_IOCB13_MASK              (0x01 << 29)
#define GPIO_SCR_IOCB13_SHIFT             (29)
#define GPIO_SCR_IOCB13(x)                (x << 29)
#define GPIO_SCR_IOCB14_MASK              (0x01 << 30)
#define GPIO_SCR_IOCB14_SHIFT             (30)
#define GPIO_SCR_IOCB14(x)                (x << 30)
#define GPIO_SCR_IOCB15_MASK              (0x01 << 31)
#define GPIO_SCR_IOCB15_SHIFT             (31)
#define GPIO_SCR_IOCB15(x)                (x << 31)
#define GPIO_CLR_IOCB0_MASK               (0x01 << 0)
#define GPIO_CLR_IOCB0_SHIFT              (0)
#define GPIO_CLR_IOCB0(x)                 (x << 0)
#define GPIO_CLR_IOCB1_MASK               (0x01 << 1)
#define GPIO_CLR_IOCB1_SHIFT              (1)
#define GPIO_CLR_IOCB1(x)                 (x << 1)
#define GPIO_CLR_IOCB2_MASK               (0x01 << 2)
#define GPIO_CLR_IOCB2_SHIFT              (2)
#define GPIO_CLR_IOCB2(x)                 (x << 2)
#define GPIO_CLR_IOCB3_MASK               (0x01 << 3)
#define GPIO_CLR_IOCB3_SHIFT              (3)
#define GPIO_CLR_IOCB3(x)                 (x << 3)
#define GPIO_CLR_IOCB4_MASK               (0x01 << 4)
#define GPIO_CLR_IOCB4_SHIFT              (4)
#define GPIO_CLR_IOCB4(x)                 (x << 4)
#define GPIO_CLR_IOCB5_MASK               (0x01 << 5)
#define GPIO_CLR_IOCB5_SHIFT              (5)
#define GPIO_CLR_IOCB5(x)                 (x << 5)
#define GPIO_CLR_IOCB6_MASK               (0x01 << 6)
#define GPIO_CLR_IOCB6_SHIFT              (6)
#define GPIO_CLR_IOCB6(x)                 (x << 6)
#define GPIO_CLR_IOCB7_MASK               (0x01 << 7)
#define GPIO_CLR_IOCB7_SHIFT              (7)
#define GPIO_CLR_IOCB7(x)                 (x << 7)
#define GPIO_CLR_IOCB8_MASK               (0x01 << 8)
#define GPIO_CLR_IOCB8_SHIFT              (8)
#define GPIO_CLR_IOCB8(x)                 (x << 8)
#define GPIO_CLR_IOCB9_MASK               (0x01 << 9)
#define GPIO_CLR_IOCB9_SHIFT              (9)
#define GPIO_CLR_IOCB9(x)                 (x << 9)
#define GPIO_CLR_IOCB10_MASK              (0x01 << 10)
#define GPIO_CLR_IOCB10_SHIFT             (10)
#define GPIO_CLR_IOCB10(x)                (x << 10)
#define GPIO_CLR_IOCB11_MASK              (0x01 << 11)
#define GPIO_CLR_IOCB11_SHIFT             (11)
#define GPIO_CLR_IOCB11(x)                (x << 11)
#define GPIO_CLR_IOCB12_MASK              (0x01 << 12)
#define GPIO_CLR_IOCB12_SHIFT             (12)
#define GPIO_CLR_IOCB12(x)                (x << 12)
#define GPIO_CLR_IOCB13_MASK              (0x01 << 13)
#define GPIO_CLR_IOCB13_SHIFT             (13)
#define GPIO_CLR_IOCB13(x)                (x << 13)
#define GPIO_CLR_IOCB14_MASK              (0x01 << 14)
#define GPIO_CLR_IOCB14_SHIFT             (14)
#define GPIO_CLR_IOCB14(x)                (x << 14)
#define GPIO_CLR_IOCB15_MASK              (0x01 << 15)
#define GPIO_CLR_IOCB15_SHIFT             (15)
#define GPIO_CLR_IOCB15(x)                (x << 15)
#define GPIO_WPR_WPEN0_MASK               (0x01 << 0)
#define GPIO_WPR_WPEN0_SHIFT              (0)
#define GPIO_WPR_WPEN0(x)                 (x << 0)
#define GPIO_WPR_WPEN1_MASK               (0x01 << 1)
#define GPIO_WPR_WPEN1_SHIFT              (1)
#define GPIO_WPR_WPEN1(x)                 (x << 1)
#define GPIO_WPR_WPEN2_MASK               (0x01 << 2)
#define GPIO_WPR_WPEN2_SHIFT              (2)
#define GPIO_WPR_WPEN2(x)                 (x << 2)
#define GPIO_WPR_WPEN3_MASK               (0x01 << 3)
#define GPIO_WPR_WPEN3_SHIFT              (3)
#define GPIO_WPR_WPEN3(x)                 (x << 3)
#define GPIO_WPR_WPEN4_MASK               (0x01 << 4)
#define GPIO_WPR_WPEN4_SHIFT              (4)
#define GPIO_WPR_WPEN4(x)                 (x << 4)
#define GPIO_WPR_WPEN5_MASK               (0x01 << 5)
#define GPIO_WPR_WPEN5_SHIFT              (5)
#define GPIO_WPR_WPEN5(x)                 (x << 5)
#define GPIO_WPR_WPEN6_MASK               (0x01 << 6)
#define GPIO_WPR_WPEN6_SHIFT              (6)
#define GPIO_WPR_WPEN6(x)                 (x << 6)
#define GPIO_WPR_WPEN7_MASK               (0x01 << 7)
#define GPIO_WPR_WPEN7_SHIFT              (7)
#define GPIO_WPR_WPEN7(x)                 (x << 7)
#define GPIO_WPR_WPEN8_MASK               (0x01 << 8)
#define GPIO_WPR_WPEN8_SHIFT              (8)
#define GPIO_WPR_WPEN8(x)                 (x << 8)
#define GPIO_WPR_WPEN9_MASK               (0x01 << 9)
#define GPIO_WPR_WPEN9_SHIFT              (9)
#define GPIO_WPR_WPEN9(x)                 (x << 9)
#define GPIO_WPR_WPEN10_MASK              (0x01 << 10)
#define GPIO_WPR_WPEN10_SHIFT             (10)
#define GPIO_WPR_WPEN10(x)                (x << 10)
#define GPIO_WPR_WPEN11_MASK              (0x01 << 11)
#define GPIO_WPR_WPEN11_SHIFT             (11)
#define GPIO_WPR_WPEN11(x)                (x << 11)
#define GPIO_WPR_WPEN12_MASK              (0x01 << 12)
#define GPIO_WPR_WPEN12_SHIFT             (12)
#define GPIO_WPR_WPEN12(x)                (x << 12)
#define GPIO_WPR_WPEN13_MASK              (0x01 << 13)
#define GPIO_WPR_WPEN13_SHIFT             (13)
#define GPIO_WPR_WPEN13(x)                (x << 13)
#define GPIO_WPR_WPEN14_MASK              (0x01 << 14)
#define GPIO_WPR_WPEN14_SHIFT             (14)
#define GPIO_WPR_WPEN14(x)                (x << 14)
#define GPIO_WPR_WPEN15_MASK              (0x01 << 15)
#define GPIO_WPR_WPEN15_SHIFT             (15)
