eeucalyptus/at32f403a_minimal/at32f403a.h
#define GPIO_WPR_WPEN15(x)                (x << 15)
#define GPIO_WPR_WPSEQ_MASK               (0x01 << 16)
#define GPIO_WPR_WPSEQ_SHIFT              (16)
#define GPIO_WPR_WPSEQ(x)                 (x << 16)
#define GPIO_HDRV_HDRV0_MASK              (0x01 << 0)
#define GPIO_HDRV_HDRV0_SHIFT             (0)
#define GPIO_HDRV_HDRV0(x)                (x << 0)
#define GPIO_HDRV_HDRV1_MASK              (0x01 << 1)
#define GPIO_HDRV_HDRV1_SHIFT             (1)
#define GPIO_HDRV_HDRV1(x)                (x << 1)
#define GPIO_HDRV_HDRV2_MASK              (0x01 << 2)
#define GPIO_HDRV_HDRV2_SHIFT             (2)
#define GPIO_HDRV_HDRV2(x)                (x << 2)
#define GPIO_HDRV_HDRV3_MASK              (0x01 << 3)
#define GPIO_HDRV_HDRV3_SHIFT             (3)
#define GPIO_HDRV_HDRV3(x)                (x << 3)
#define GPIO_HDRV_HDRV4_MASK              (0x01 << 4)
#define GPIO_HDRV_HDRV4_SHIFT             (4)
#define GPIO_HDRV_HDRV4(x)                (x << 4)
#define GPIO_HDRV_HDRV5_MASK              (0x01 << 5)
#define GPIO_HDRV_HDRV5_SHIFT             (5)
#define GPIO_HDRV_HDRV5(x)                (x << 5)
#define GPIO_HDRV_HDRV6_MASK              (0x01 << 6)
#define GPIO_HDRV_HDRV6_SHIFT             (6)
#define GPIO_HDRV_HDRV6(x)                (x << 6)
#define GPIO_HDRV_HDRV7_MASK              (0x01 << 7)
#define GPIO_HDRV_HDRV7_SHIFT             (7)
#define GPIO_HDRV_HDRV7(x)                (x << 7)
#define GPIO_HDRV_HDRV8_MASK              (0x01 << 8)
#define GPIO_HDRV_HDRV8_SHIFT             (8)
#define GPIO_HDRV_HDRV8(x)                (x << 8)
#define GPIO_HDRV_HDRV9_MASK              (0x01 << 9)
#define GPIO_HDRV_HDRV9_SHIFT             (9)
#define GPIO_HDRV_HDRV9(x)                (x << 9)
#define GPIO_HDRV_HDRV10_MASK             (0x01 << 10)
#define GPIO_HDRV_HDRV10_SHIFT            (10)
#define GPIO_HDRV_HDRV10(x)               (x << 10)
#define GPIO_HDRV_HDRV11_MASK             (0x01 << 11)
#define GPIO_HDRV_HDRV11_SHIFT            (11)
#define GPIO_HDRV_HDRV11(x)               (x << 11)
#define GPIO_HDRV_HDRV12_MASK             (0x01 << 12)
#define GPIO_HDRV_HDRV12_SHIFT            (12)
#define GPIO_HDRV_HDRV12(x)               (x << 12)
#define GPIO_HDRV_HDRV13_MASK             (0x01 << 13)
#define GPIO_HDRV_HDRV13_SHIFT            (13)
#define GPIO_HDRV_HDRV13(x)               (x << 13)
#define GPIO_HDRV_HDRV14_MASK             (0x01 << 14)
#define GPIO_HDRV_HDRV14_SHIFT            (14)
#define GPIO_HDRV_HDRV14(x)               (x << 14)
#define GPIO_HDRV_HDRV15_MASK             (0x01 << 15)
#define GPIO_HDRV_HDRV15_SHIFT            (15)
#define GPIO_HDRV_HDRV15(x)               (x << 15)

/* IOMUX - IO MUX function */
#define IOMUX_EVTOUT_SELPIN_MASK          (0x0f << 0)
#define IOMUX_EVTOUT_SELPIN_SHIFT         (0)
#define IOMUX_EVTOUT_SELPIN(x)            (x << 0)
#define IOMUX_EVTOUT_SELPORT_MASK         (0x07 << 4)
#define IOMUX_EVTOUT_SELPORT_SHIFT        (4)
#define IOMUX_EVTOUT_SELPORT(x)           (x << 4)
#define IOMUX_EVTOUT_EVOEN_MASK           (0x01 << 7)
#define IOMUX_EVTOUT_EVOEN_SHIFT          (7)
#define IOMUX_EVTOUT_EVOEN(x)             (x << 7)
#define IOMUX_REMAP_SPI1_MUX0_MASK        (0x01 << 0)
#define IOMUX_REMAP_SPI1_MUX0_SHIFT       (0)
#define IOMUX_REMAP_SPI1_MUX0(x)          (x << 0)
#define IOMUX_REMAP_I2C1_MUX_MASK         (0x01 << 1)
#define IOMUX_REMAP_I2C1_MUX_SHIFT        (1)
#define IOMUX_REMAP_I2C1_MUX(x)           (x << 1)
#define IOMUX_REMAP_USART1_MUX_MASK       (0x01 << 2)
#define IOMUX_REMAP_USART1_MUX_SHIFT      (2)
#define IOMUX_REMAP_USART1_MUX(x)         (x << 2)
#define IOMUX_REMAP_USART2_MUX_MASK       (0x01 << 3)
#define IOMUX_REMAP_USART2_MUX_SHIFT      (3)
#define IOMUX_REMAP_USART2_MUX(x)         (x << 3)
#define IOMUX_REMAP_USART3_MUX_MASK       (0x03 << 4)
#define IOMUX_REMAP_USART3_MUX_SHIFT      (4)
#define IOMUX_REMAP_USART3_MUX(x)         (x << 4)
#define IOMUX_REMAP_TMR1_MUX_MASK         (0x03 << 6)
#define IOMUX_REMAP_TMR1_MUX_SHIFT        (6)
#define IOMUX_REMAP_TMR1_MUX(x)           (x << 6)
#define IOMUX_REMAP_TMR2_MUX_MASK         (0x03 << 8)
#define IOMUX_REMAP_TMR2_MUX_SHIFT        (8)
#define IOMUX_REMAP_TMR2_MUX(x)           (x << 8)
#define IOMUX_REMAP_TMR3_MUX_MASK         (0x03 << 10)
#define IOMUX_REMAP_TMR3_MUX_SHIFT        (10)
#define IOMUX_REMAP_TMR3_MUX(x)           (x << 10)
#define IOMUX_REMAP_TMR4_MUX_MASK         (0x01 << 12)
#define IOMUX_REMAP_TMR4_MUX_SHIFT        (12)
#define IOMUX_REMAP_TMR4_MUX(x)           (x << 12)
#define IOMUX_REMAP_CAN_MUX_MASK          (0x03 << 13)
#define IOMUX_REMAP_CAN_MUX_SHIFT         (13)
#define IOMUX_REMAP_CAN_MUX(x)            (x << 13)
#define IOMUX_REMAP_PD01_MUX_MASK         (0x01 << 15)
#define IOMUX_REMAP_PD01_MUX_SHIFT        (15)
#define IOMUX_REMAP_PD01_MUX(x)           (x << 15)
#define IOMUX_REMAP_TMR5CH4_MUX_MASK      (0x01 << 16)
#define IOMUX_REMAP_TMR5CH4_MUX_SHIFT     (16)
#define IOMUX_REMAP_TMR5CH4_MUX(x)        (x << 16)
#define IOMUX_REMAP_ADC1_ETP_MUX_MASK     (0x01 << 17)
#define IOMUX_REMAP_ADC1_ETP_MUX_SHIFT    (17)
#define IOMUX_REMAP_ADC1_ETP_MUX(x)       (x << 17)
#define IOMUX_REMAP_ADC1_ETO_MUX_MASK     (0x01 << 18)
#define IOMUX_REMAP_ADC1_ETO_MUX_SHIFT    (18)
#define IOMUX_REMAP_ADC1_ETO_MUX(x)       (x << 18)
#define IOMUX_REMAP_ADC2_ETP_MUX_MASK     (0x01 << 19)
#define IOMUX_REMAP_ADC2_ETP_MUX_SHIFT    (19)
#define IOMUX_REMAP_ADC2_ETP_MUX(x)       (x << 19)
#define IOMUX_REMAP_ADC2_ETO_MUX_MASK     (0x01 << 20)
#define IOMUX_REMAP_ADC2_ETO_MUX_SHIFT    (20)
#define IOMUX_REMAP_ADC2_ETO_MUX(x)       (x << 20)
#define IOMUX_REMAP_EMAC_MUX_MASK         (0x01 << 21)
#define IOMUX_REMAP_EMAC_MUX_SHIFT        (21)
#define IOMUX_REMAP_EMAC_MUX(x)           (x << 21)
#define IOMUX_REMAP_CAN2_MUX_MASK         (0x01 << 22)
#define IOMUX_REMAP_CAN2_MUX_SHIFT        (22)
#define IOMUX_REMAP_CAN2_MUX(x)           (x << 22)
#define IOMUX_REMAP_MII_RMII_SEL_MUX_MASK (0x01 << 23)
#define IOMUX_REMAP_MII_RMII_SEL_MUX_SHIFT (23)
#define IOMUX_REMAP_MII_RMII_SEL_MUX(x)   (x << 23)
#define IOMUX_REMAP_SWJTAG_MUX_MASK       (0x07 << 24)
#define IOMUX_REMAP_SWJTAG_MUX_SHIFT      (24)
#define IOMUX_REMAP_SWJTAG_MUX(x)         (x << 24)
#define IOMUX_REMAP_SPI3_MUX_MASK         (0x01 << 28)
#define IOMUX_REMAP_SPI3_MUX_SHIFT        (28)
#define IOMUX_REMAP_SPI3_MUX(x)           (x << 28)
#define IOMUX_REMAP_TMR2ITR1_MUX_MASK     (0x01 << 29)
#define IOMUX_REMAP_TMR2ITR1_MUX_SHIFT    (29)
#define IOMUX_REMAP_TMR2ITR1_MUX(x)       (x << 29)
#define IOMUX_REMAP_PTP_PPS_MUX_MASK      (0x01 << 30)
#define IOMUX_REMAP_PTP_PPS_MUX_SHIFT     (30)
#define IOMUX_REMAP_PTP_PPS_MUX(x)        (x << 30)
#define IOMUX_REMAP_SPI1_MUX1_MASK        (0x01 << 31)
#define IOMUX_REMAP_SPI1_MUX1_SHIFT       (31)
#define IOMUX_REMAP_SPI1_MUX1(x)          (x << 31)
#define IOMUX_EXINTC1_EXINT0_MASK         (0x0f << 0)
#define IOMUX_EXINTC1_EXINT0_SHIFT        (0)
#define IOMUX_EXINTC1_EXINT0(x)           (x << 0)
#define IOMUX_EXINTC1_EXINT1_MASK         (0x0f << 4)
#define IOMUX_EXINTC1_EXINT1_SHIFT        (4)
#define IOMUX_EXINTC1_EXINT1(x)           (x << 4)
#define IOMUX_EXINTC1_EXINT2_MASK         (0x0f << 8)
#define IOMUX_EXINTC1_EXINT2_SHIFT        (8)
#define IOMUX_EXINTC1_EXINT2(x)           (x << 8)
#define IOMUX_EXINTC1_EXINT3_MASK         (0x0f << 12)
#define IOMUX_EXINTC1_EXINT3_SHIFT        (12)
#define IOMUX_EXINTC1_EXINT3(x)           (x << 12)
#define IOMUX_EXINTC2_EXINT4_MASK         (0x0f << 0)
#define IOMUX_EXINTC2_EXINT4_SHIFT        (0)
#define IOMUX_EXINTC2_EXINT4(x)           (x << 0)
#define IOMUX_EXINTC2_EXINT5_MASK         (0x0f << 4)
#define IOMUX_EXINTC2_EXINT5_SHIFT        (4)
#define IOMUX_EXINTC2_EXINT5(x)           (x << 4)
#define IOMUX_EXINTC2_EXINT6_MASK         (0x0f << 8)
#define IOMUX_EXINTC2_EXINT6_SHIFT        (8)
#define IOMUX_EXINTC2_EXINT6(x)           (x << 8)
#define IOMUX_EXINTC2_EXINT7_MASK         (0x0f << 12)
#define IOMUX_EXINTC2_EXINT7_SHIFT        (12)
#define IOMUX_EXINTC2_EXINT7(x)           (x << 12)
#define IOMUX_EXINTC3_EXINT8_MASK         (0x0f << 0)
#define IOMUX_EXINTC3_EXINT8_SHIFT        (0)
#define IOMUX_EXINTC3_EXINT8(x)           (x << 0)
#define IOMUX_EXINTC3_EXINT9_MASK         (0x0f << 4)
#define IOMUX_EXINTC3_EXINT9_SHIFT        (4)
#define IOMUX_EXINTC3_EXINT9(x)           (x << 4)
#define IOMUX_EXINTC3_EXINT10_MASK        (0x0f << 8)
#define IOMUX_EXINTC3_EXINT10_SHIFT       (8)
#define IOMUX_EXINTC3_EXINT10(x)          (x << 8)
#define IOMUX_EXINTC3_EXINT11_MASK        (0x0f << 12)
#define IOMUX_EXINTC3_EXINT11_SHIFT       (12)
#define IOMUX_EXINTC3_EXINT11(x)          (x << 12)
#define IOMUX_EXINTC4_EXINT12_MASK        (0x0f << 0)
#define IOMUX_EXINTC4_EXINT12_SHIFT       (0)
#define IOMUX_EXINTC4_EXINT12(x)          (x << 0)
#define IOMUX_EXINTC4_EXINT13_MASK        (0x0f << 4)
#define IOMUX_EXINTC4_EXINT13_SHIFT       (4)
#define IOMUX_EXINTC4_EXINT13(x)          (x << 4)
#define IOMUX_EXINTC4_EXINT14_MASK        (0x0f << 8)
#define IOMUX_EXINTC4_EXINT14_SHIFT       (8)
#define IOMUX_EXINTC4_EXINT14(x)          (x << 8)
#define IOMUX_EXINTC4_EXINT15_MASK        (0x0f << 12)
#define IOMUX_EXINTC4_EXINT15_SHIFT       (12)
#define IOMUX_EXINTC4_EXINT15(x)          (x << 12)
#define IOMUX_REMAP2_TMR9_MUX_MASK        (0x01 << 5)
#define IOMUX_REMAP2_TMR9_MUX_SHIFT       (5)
#define IOMUX_REMAP2_TMR9_MUX(x)          (x << 5)
#define IOMUX_REMAP2_XMC_NADV_MUX_MASK    (0x01 << 10)
#define IOMUX_REMAP2_XMC_NADV_MUX_SHIFT   (10)
#define IOMUX_REMAP2_XMC_NADV_MUX(x)      (x << 10)
#define IOMUX_REMAP2_SPI4_MUX_MASK        (0x01 << 17)
#define IOMUX_REMAP2_SPI4_MUX_SHIFT       (17)
#define IOMUX_REMAP2_SPI4_MUX(x)          (x << 17)
#define IOMUX_REMAP2_I2C3_MUX_MASK        (0x01 << 18)
#define IOMUX_REMAP2_I2C3_MUX_SHIFT       (18)
#define IOMUX_REMAP2_I2C3_MUX(x)          (x << 18)
#define IOMUX_REMAP2_SDIO2_MUX_MASK       (0x03 << 19)
#define IOMUX_REMAP2_SDIO2_MUX_SHIFT      (19)
#define IOMUX_REMAP2_SDIO2_MUX(x)         (x << 19)
#define IOMUX_REMAP2_EXT_SPIM_EN_MUX_MASK (0x01 << 21)
#define IOMUX_REMAP2_EXT_SPIM_EN_MUX_SHIFT (21)
#define IOMUX_REMAP2_EXT_SPIM_EN_MUX(x)   (x << 21)
#define IOMUX_REMAP3_TMR9_GMUX_MASK       (0x0f << 0)
#define IOMUX_REMAP3_TMR9_GMUX_SHIFT      (0)
#define IOMUX_REMAP3_TMR9_GMUX(x)         (x << 0)
#define IOMUX_REMAP4_TMR1_GMUX_MASK       (0x0f << 0)
#define IOMUX_REMAP4_TMR1_GMUX_SHIFT      (0)
#define IOMUX_REMAP4_TMR1_GMUX(x)         (x << 0)
#define IOMUX_REMAP4_TMR2_GMUX_MASK       (0x03 << 4)
#define IOMUX_REMAP4_TMR2_GMUX_SHIFT      (4)
#define IOMUX_REMAP4_TMR2_GMUX(x)         (x << 4)
#define IOMUX_REMAP4_TMR2ITR1_GMUX_MASK   (0x03 << 6)
#define IOMUX_REMAP4_TMR2ITR1_GMUX_SHIFT  (6)
#define IOMUX_REMAP4_TMR2ITR1_GMUX(x)     (x << 6)
#define IOMUX_REMAP4_TMR3_GMUX_MASK       (0x0f << 8)
#define IOMUX_REMAP4_TMR3_GMUX_SHIFT      (8)
#define IOMUX_REMAP4_TMR3_GMUX(x)         (x << 8)
#define IOMUX_REMAP4_TMR4_GMUX_MASK       (0x0f << 12)
#define IOMUX_REMAP4_TMR4_GMUX_SHIFT      (12)
#define IOMUX_REMAP4_TMR4_GMUX(x)         (x << 12)
#define IOMUX_REMAP4_TMR5CH4_GMUX_MASK    (0x01 << 19)
#define IOMUX_REMAP4_TMR5CH4_GMUX_SHIFT   (19)
#define IOMUX_REMAP4_TMR5CH4_GMUX(x)      (x << 19)
#define IOMUX_REMAP5_USART5_GMUX_MASK     (0x0f << 0)
#define IOMUX_REMAP5_USART5_GMUX_SHIFT    (0)
#define IOMUX_REMAP5_USART5_GMUX(x)       (x << 0)
#define IOMUX_REMAP5_I2C1_GMUX_MASK       (0x0f << 4)
#define IOMUX_REMAP5_I2C1_GMUX_SHIFT      (4)
#define IOMUX_REMAP5_I2C1_GMUX(x)         (x << 4)
#define IOMUX_REMAP5_I2C3_GMUX_MASK       (0x0f << 12)
#define IOMUX_REMAP5_I2C3_GMUX_SHIFT      (12)
#define IOMUX_REMAP5_I2C3_GMUX(x)         (x << 12)
#define IOMUX_REMAP5_SPI1_GMUX_MASK       (0x0f << 16)
#define IOMUX_REMAP5_SPI1_GMUX_SHIFT      (16)
#define IOMUX_REMAP5_SPI1_GMUX(x)         (x << 16)
#define IOMUX_REMAP5_SPI2_GMUX_MASK       (0x0f << 20)
#define IOMUX_REMAP5_SPI2_GMUX_SHIFT      (20)
#define IOMUX_REMAP5_SPI2_GMUX(x)         (x << 20)
#define IOMUX_REMAP5_SPI3_GMUX_MASK       (0x0f << 24)
#define IOMUX_REMAP5_SPI3_GMUX_SHIFT      (24)
#define IOMUX_REMAP5_SPI3_GMUX(x)         (x << 24)
#define IOMUX_REMAP5_SPI4_GMUX_MASK       (0x0f << 28)
#define IOMUX_REMAP5_SPI4_GMUX_SHIFT      (28)
#define IOMUX_REMAP5_SPI4_GMUX(x)         (x << 28)
#define IOMUX_REMAP6_CAN1_GMUX_MASK       (0x0f << 0)
#define IOMUX_REMAP6_CAN1_GMUX_SHIFT      (0)
#define IOMUX_REMAP6_CAN1_GMUX(x)         (x << 0)
#define IOMUX_REMAP6_CAN2_GMUX_MASK       (0x0f << 4)
#define IOMUX_REMAP6_CAN2_GMUX_SHIFT      (4)
#define IOMUX_REMAP6_CAN2_GMUX(x)         (x << 4)
#define IOMUX_REMAP6_SDIO2_GMUX_MASK      (0x0f << 12)
#define IOMUX_REMAP6_SDIO2_GMUX_SHIFT     (12)
#define IOMUX_REMAP6_SDIO2_GMUX(x)        (x << 12)
#define IOMUX_REMAP6_USART1_GMUX_MASK     (0x0f << 16)
#define IOMUX_REMAP6_USART1_GMUX_SHIFT    (16)
#define IOMUX_REMAP6_USART1_GMUX(x)       (x << 16)
#define IOMUX_REMAP6_USART2_GMUX_MASK     (0x0f << 20)
#define IOMUX_REMAP6_USART2_GMUX_SHIFT    (20)
#define IOMUX_REMAP6_USART2_GMUX(x)       (x << 20)
#define IOMUX_REMAP6_USART3_GMUX_MASK     (0x0f << 24)
#define IOMUX_REMAP6_USART3_GMUX_SHIFT    (24)
#define IOMUX_REMAP6_USART3_GMUX(x)       (x << 24)
#define IOMUX_REMAP6_UART4_GMUX_MASK      (0x0f << 28)
#define IOMUX_REMAP6_UART4_GMUX_SHIFT     (28)
#define IOMUX_REMAP6_UART4_GMUX(x)        (x << 28)
#define IOMUX_REMAP7_EXT_SPIM_GMUX_MASK   (0x07 << 0)
#define IOMUX_REMAP7_EXT_SPIM_GMUX_SHIFT  (0)
#define IOMUX_REMAP7_EXT_SPIM_GMUX(x)     (x << 0)
#define IOMUX_REMAP7_EXT_SPIM_GEN_MASK    (0x01 << 3)
#define IOMUX_REMAP7_EXT_SPIM_GEN_SHIFT   (3)
#define IOMUX_REMAP7_EXT_SPIM_GEN(x)      (x << 3)
#define IOMUX_REMAP7_ADC1_ETP_GMUX_MASK   (0x01 << 4)
#define IOMUX_REMAP7_ADC1_ETP_GMUX_SHIFT  (4)
#define IOMUX_REMAP7_ADC1_ETP_GMUX(x)     (x << 4)
#define IOMUX_REMAP7_ADC1_ETO_GMUX_MASK   (0x01 << 5)
#define IOMUX_REMAP7_ADC1_ETO_GMUX_SHIFT  (5)
#define IOMUX_REMAP7_ADC1_ETO_GMUX(x)     (x << 5)
#define IOMUX_REMAP7_ADC2_ETP_GMUX_MASK   (0x01 << 8)
#define IOMUX_REMAP7_ADC2_ETP_GMUX_SHIFT  (8)
#define IOMUX_REMAP7_ADC2_ETP_GMUX(x)     (x << 8)
#define IOMUX_REMAP7_ADC2_ETO_GMUX_MASK   (0x01 << 9)
#define IOMUX_REMAP7_ADC2_ETO_GMUX_SHIFT  (9)
#define IOMUX_REMAP7_ADC2_ETO_GMUX(x)     (x << 9)
#define IOMUX_REMAP7_SWJTAG_GMUX_MASK     (0x07 << 16)
#define IOMUX_REMAP7_SWJTAG_GMUX_SHIFT    (16)
#define IOMUX_REMAP7_SWJTAG_GMUX(x)       (x << 16)
#define IOMUX_REMAP7_PD01_GMUX_MASK       (0x01 << 20)
#define IOMUX_REMAP7_PD01_GMUX_SHIFT      (20)
#define IOMUX_REMAP7_PD01_GMUX(x)         (x << 20)
#define IOMUX_REMAP7_XMC_GMUX_MASK        (0x07 << 24)
#define IOMUX_REMAP7_XMC_GMUX_SHIFT       (24)
#define IOMUX_REMAP7_XMC_GMUX(x)          (x << 24)
#define IOMUX_REMAP7_XMC_NADV_GMUX_MASK   (0x01 << 27)
#define IOMUX_REMAP7_XMC_NADV_GMUX_SHIFT  (27)
#define IOMUX_REMAP7_XMC_NADV_GMUX(x)     (x << 27)
#define IOMUX_REMAP8_EMAC_GMUX_MASK       (0x03 << 16)
#define IOMUX_REMAP8_EMAC_GMUX_SHIFT      (16)
#define IOMUX_REMAP8_EMAC_GMUX(x)         (x << 16)
#define IOMUX_REMAP8_MII_RMII_SEL_GMUX_MASK (0x01 << 18)
#define IOMUX_REMAP8_MII_RMII_SEL_GMUX_SHIFT (18)
#define IOMUX_REMAP8_MII_RMII_SEL_GMUX(x) (x << 18)
#define IOMUX_REMAP8_PTP_PPS_GMUX_MASK    (0x01 << 19)
#define IOMUX_REMAP8_PTP_PPS_GMUX_SHIFT   (19)
#define IOMUX_REMAP8_PTP_PPS_GMUX(x)      (x << 19)
#define IOMUX_REMAP8_USART6_GMUX_MASK     (0x0f << 20)
#define IOMUX_REMAP8_USART6_GMUX_SHIFT    (20)
#define IOMUX_REMAP8_USART6_GMUX(x)       (x << 20)
#define IOMUX_REMAP8_UART7_GMUX_MASK      (0x0f << 24)
#define IOMUX_REMAP8_UART7_GMUX_SHIFT     (24)
#define IOMUX_REMAP8_UART7_GMUX(x)        (x << 24)
#define IOMUX_REMAP8_UART8_GMUX_MASK      (0x0f << 28)
#define IOMUX_REMAP8_UART8_GMUX_SHIFT     (28)
#define IOMUX_REMAP8_UART8_GMUX(x)        (x << 28)

