eeucalyptus/at32f403a_minimal/at32f403a.h
/* EXINT - EXINT */
#define EXINT_INTEN_INTEN0_MASK           (0x01 << 0)
#define EXINT_INTEN_INTEN0_SHIFT          (0)
#define EXINT_INTEN_INTEN0(x)             (x << 0)
#define EXINT_INTEN_INTEN1_MASK           (0x01 << 1)
#define EXINT_INTEN_INTEN1_SHIFT          (1)
#define EXINT_INTEN_INTEN1(x)             (x << 1)
#define EXINT_INTEN_INTEN2_MASK           (0x01 << 2)
#define EXINT_INTEN_INTEN2_SHIFT          (2)
#define EXINT_INTEN_INTEN2(x)             (x << 2)
#define EXINT_INTEN_INTEN3_MASK           (0x01 << 3)
#define EXINT_INTEN_INTEN3_SHIFT          (3)
#define EXINT_INTEN_INTEN3(x)             (x << 3)
#define EXINT_INTEN_INTEN4_MASK           (0x01 << 4)
#define EXINT_INTEN_INTEN4_SHIFT          (4)
#define EXINT_INTEN_INTEN4(x)             (x << 4)
#define EXINT_INTEN_INTEN5_MASK           (0x01 << 5)
#define EXINT_INTEN_INTEN5_SHIFT          (5)
#define EXINT_INTEN_INTEN5(x)             (x << 5)
#define EXINT_INTEN_INTEN6_MASK           (0x01 << 6)
#define EXINT_INTEN_INTEN6_SHIFT          (6)
#define EXINT_INTEN_INTEN6(x)             (x << 6)
#define EXINT_INTEN_INTEN7_MASK           (0x01 << 7)
#define EXINT_INTEN_INTEN7_SHIFT          (7)
#define EXINT_INTEN_INTEN7(x)             (x << 7)
#define EXINT_INTEN_INTEN8_MASK           (0x01 << 8)
#define EXINT_INTEN_INTEN8_SHIFT          (8)
#define EXINT_INTEN_INTEN8(x)             (x << 8)
#define EXINT_INTEN_INTEN9_MASK           (0x01 << 9)
#define EXINT_INTEN_INTEN9_SHIFT          (9)
#define EXINT_INTEN_INTEN9(x)             (x << 9)
#define EXINT_INTEN_INTEN10_MASK          (0x01 << 10)
#define EXINT_INTEN_INTEN10_SHIFT         (10)
#define EXINT_INTEN_INTEN10(x)            (x << 10)
#define EXINT_INTEN_INTEN11_MASK          (0x01 << 11)
#define EXINT_INTEN_INTEN11_SHIFT         (11)
#define EXINT_INTEN_INTEN11(x)            (x << 11)
#define EXINT_INTEN_INTEN12_MASK          (0x01 << 12)
#define EXINT_INTEN_INTEN12_SHIFT         (12)
#define EXINT_INTEN_INTEN12(x)            (x << 12)
#define EXINT_INTEN_INTEN13_MASK          (0x01 << 13)
#define EXINT_INTEN_INTEN13_SHIFT         (13)
#define EXINT_INTEN_INTEN13(x)            (x << 13)
#define EXINT_INTEN_INTEN14_MASK          (0x01 << 14)
#define EXINT_INTEN_INTEN14_SHIFT         (14)
#define EXINT_INTEN_INTEN14(x)            (x << 14)
#define EXINT_INTEN_INTEN15_MASK          (0x01 << 15)
#define EXINT_INTEN_INTEN15_SHIFT         (15)
#define EXINT_INTEN_INTEN15(x)            (x << 15)
#define EXINT_INTEN_INTEN16_MASK          (0x01 << 16)
#define EXINT_INTEN_INTEN16_SHIFT         (16)
#define EXINT_INTEN_INTEN16(x)            (x << 16)
#define EXINT_INTEN_INTEN17_MASK          (0x01 << 17)
#define EXINT_INTEN_INTEN17_SHIFT         (17)
#define EXINT_INTEN_INTEN17(x)            (x << 17)
#define EXINT_INTEN_INTEN18_MASK          (0x01 << 18)
#define EXINT_INTEN_INTEN18_SHIFT         (18)
#define EXINT_INTEN_INTEN18(x)            (x << 18)
#define EXINT_INTEN_INTEN19_MASK          (0x01 << 19)
#define EXINT_INTEN_INTEN19_SHIFT         (19)
#define EXINT_INTEN_INTEN19(x)            (x << 19)
#define EXINT_EVTEN_EVTEN0_MASK           (0x01 << 0)
#define EXINT_EVTEN_EVTEN0_SHIFT          (0)
#define EXINT_EVTEN_EVTEN0(x)             (x << 0)
#define EXINT_EVTEN_EVTEN1_MASK           (0x01 << 1)
#define EXINT_EVTEN_EVTEN1_SHIFT          (1)
#define EXINT_EVTEN_EVTEN1(x)             (x << 1)
#define EXINT_EVTEN_EVTEN2_MASK           (0x01 << 2)
#define EXINT_EVTEN_EVTEN2_SHIFT          (2)
#define EXINT_EVTEN_EVTEN2(x)             (x << 2)
#define EXINT_EVTEN_EVTEN3_MASK           (0x01 << 3)
#define EXINT_EVTEN_EVTEN3_SHIFT          (3)
#define EXINT_EVTEN_EVTEN3(x)             (x << 3)
#define EXINT_EVTEN_EVTEN4_MASK           (0x01 << 4)
#define EXINT_EVTEN_EVTEN4_SHIFT          (4)
#define EXINT_EVTEN_EVTEN4(x)             (x << 4)
#define EXINT_EVTEN_EVTEN5_MASK           (0x01 << 5)
#define EXINT_EVTEN_EVTEN5_SHIFT          (5)
#define EXINT_EVTEN_EVTEN5(x)             (x << 5)
#define EXINT_EVTEN_EVTEN6_MASK           (0x01 << 6)
#define EXINT_EVTEN_EVTEN6_SHIFT          (6)
#define EXINT_EVTEN_EVTEN6(x)             (x << 6)
#define EXINT_EVTEN_EVTEN7_MASK           (0x01 << 7)
#define EXINT_EVTEN_EVTEN7_SHIFT          (7)
#define EXINT_EVTEN_EVTEN7(x)             (x << 7)
#define EXINT_EVTEN_EVTEN8_MASK           (0x01 << 8)
#define EXINT_EVTEN_EVTEN8_SHIFT          (8)
#define EXINT_EVTEN_EVTEN8(x)             (x << 8)
#define EXINT_EVTEN_EVTEN9_MASK           (0x01 << 9)
#define EXINT_EVTEN_EVTEN9_SHIFT          (9)
#define EXINT_EVTEN_EVTEN9(x)             (x << 9)
#define EXINT_EVTEN_EVTEN10_MASK          (0x01 << 10)
#define EXINT_EVTEN_EVTEN10_SHIFT         (10)
#define EXINT_EVTEN_EVTEN10(x)            (x << 10)
#define EXINT_EVTEN_EVTEN11_MASK          (0x01 << 11)
#define EXINT_EVTEN_EVTEN11_SHIFT         (11)
#define EXINT_EVTEN_EVTEN11(x)            (x << 11)
#define EXINT_EVTEN_EVTEN12_MASK          (0x01 << 12)
#define EXINT_EVTEN_EVTEN12_SHIFT         (12)
#define EXINT_EVTEN_EVTEN12(x)            (x << 12)
#define EXINT_EVTEN_EVTEN13_MASK          (0x01 << 13)
#define EXINT_EVTEN_EVTEN13_SHIFT         (13)
#define EXINT_EVTEN_EVTEN13(x)            (x << 13)
#define EXINT_EVTEN_EVTEN14_MASK          (0x01 << 14)
#define EXINT_EVTEN_EVTEN14_SHIFT         (14)
#define EXINT_EVTEN_EVTEN14(x)            (x << 14)
#define EXINT_EVTEN_EVTEN15_MASK          (0x01 << 15)
#define EXINT_EVTEN_EVTEN15_SHIFT         (15)
#define EXINT_EVTEN_EVTEN15(x)            (x << 15)
#define EXINT_EVTEN_EVTEN16_MASK          (0x01 << 16)
#define EXINT_EVTEN_EVTEN16_SHIFT         (16)
#define EXINT_EVTEN_EVTEN16(x)            (x << 16)
#define EXINT_EVTEN_EVTEN17_MASK          (0x01 << 17)
#define EXINT_EVTEN_EVTEN17_SHIFT         (17)
#define EXINT_EVTEN_EVTEN17(x)            (x << 17)
#define EXINT_EVTEN_EVTEN18_MASK          (0x01 << 18)
#define EXINT_EVTEN_EVTEN18_SHIFT         (18)
#define EXINT_EVTEN_EVTEN18(x)            (x << 18)
#define EXINT_EVTEN_EVTEN19_MASK          (0x01 << 19)
#define EXINT_EVTEN_EVTEN19_SHIFT         (19)
#define EXINT_EVTEN_EVTEN19(x)            (x << 19)
#define EXINT_POLCFG1_RP0_MASK            (0x01 << 0)
#define EXINT_POLCFG1_RP0_SHIFT           (0)
#define EXINT_POLCFG1_RP0(x)              (x << 0)
#define EXINT_POLCFG1_RP1_MASK            (0x01 << 1)
#define EXINT_POLCFG1_RP1_SHIFT           (1)
#define EXINT_POLCFG1_RP1(x)              (x << 1)
#define EXINT_POLCFG1_RP2_MASK            (0x01 << 2)
#define EXINT_POLCFG1_RP2_SHIFT           (2)
#define EXINT_POLCFG1_RP2(x)              (x << 2)
#define EXINT_POLCFG1_RP3_MASK            (0x01 << 3)
#define EXINT_POLCFG1_RP3_SHIFT           (3)
#define EXINT_POLCFG1_RP3(x)              (x << 3)
#define EXINT_POLCFG1_RP4_MASK            (0x01 << 4)
#define EXINT_POLCFG1_RP4_SHIFT           (4)
#define EXINT_POLCFG1_RP4(x)              (x << 4)
#define EXINT_POLCFG1_RP5_MASK            (0x01 << 5)
#define EXINT_POLCFG1_RP5_SHIFT           (5)
#define EXINT_POLCFG1_RP5(x)              (x << 5)
#define EXINT_POLCFG1_RP6_MASK            (0x01 << 6)
#define EXINT_POLCFG1_RP6_SHIFT           (6)
#define EXINT_POLCFG1_RP6(x)              (x << 6)
#define EXINT_POLCFG1_RP7_MASK            (0x01 << 7)
#define EXINT_POLCFG1_RP7_SHIFT           (7)
#define EXINT_POLCFG1_RP7(x)              (x << 7)
#define EXINT_POLCFG1_RP8_MASK            (0x01 << 8)
#define EXINT_POLCFG1_RP8_SHIFT           (8)
#define EXINT_POLCFG1_RP8(x)              (x << 8)
#define EXINT_POLCFG1_RP9_MASK            (0x01 << 9)
#define EXINT_POLCFG1_RP9_SHIFT           (9)
#define EXINT_POLCFG1_RP9(x)              (x << 9)
#define EXINT_POLCFG1_RP10_MASK           (0x01 << 10)
#define EXINT_POLCFG1_RP10_SHIFT          (10)
#define EXINT_POLCFG1_RP10(x)             (x << 10)
#define EXINT_POLCFG1_RP11_MASK           (0x01 << 11)
#define EXINT_POLCFG1_RP11_SHIFT          (11)
#define EXINT_POLCFG1_RP11(x)             (x << 11)
#define EXINT_POLCFG1_RP12_MASK           (0x01 << 12)
#define EXINT_POLCFG1_RP12_SHIFT          (12)
#define EXINT_POLCFG1_RP12(x)             (x << 12)
#define EXINT_POLCFG1_RP13_MASK           (0x01 << 13)
#define EXINT_POLCFG1_RP13_SHIFT          (13)
#define EXINT_POLCFG1_RP13(x)             (x << 13)
#define EXINT_POLCFG1_RP14_MASK           (0x01 << 14)
#define EXINT_POLCFG1_RP14_SHIFT          (14)
#define EXINT_POLCFG1_RP14(x)             (x << 14)
#define EXINT_POLCFG1_RP15_MASK           (0x01 << 15)
#define EXINT_POLCFG1_RP15_SHIFT          (15)
#define EXINT_POLCFG1_RP15(x)             (x << 15)
#define EXINT_POLCFG1_RP16_MASK           (0x01 << 16)
#define EXINT_POLCFG1_RP16_SHIFT          (16)
#define EXINT_POLCFG1_RP16(x)             (x << 16)
#define EXINT_POLCFG1_RP17_MASK           (0x01 << 17)
#define EXINT_POLCFG1_RP17_SHIFT          (17)
#define EXINT_POLCFG1_RP17(x)             (x << 17)
#define EXINT_POLCFG1_RP18_MASK           (0x01 << 18)
#define EXINT_POLCFG1_RP18_SHIFT          (18)
#define EXINT_POLCFG1_RP18(x)             (x << 18)
#define EXINT_POLCFG1_RP19_MASK           (0x01 << 19)
#define EXINT_POLCFG1_RP19_SHIFT          (19)
#define EXINT_POLCFG1_RP19(x)             (x << 19)
#define EXINT_POLCFG2_FP0_MASK            (0x01 << 0)
#define EXINT_POLCFG2_FP0_SHIFT           (0)
#define EXINT_POLCFG2_FP0(x)              (x << 0)
#define EXINT_POLCFG2_FP1_MASK            (0x01 << 1)
#define EXINT_POLCFG2_FP1_SHIFT           (1)
#define EXINT_POLCFG2_FP1(x)              (x << 1)
#define EXINT_POLCFG2_FP2_MASK            (0x01 << 2)
#define EXINT_POLCFG2_FP2_SHIFT           (2)
#define EXINT_POLCFG2_FP2(x)              (x << 2)
#define EXINT_POLCFG2_FP3_MASK            (0x01 << 3)
#define EXINT_POLCFG2_FP3_SHIFT           (3)
#define EXINT_POLCFG2_FP3(x)              (x << 3)
#define EXINT_POLCFG2_FP4_MASK            (0x01 << 4)
#define EXINT_POLCFG2_FP4_SHIFT           (4)
#define EXINT_POLCFG2_FP4(x)              (x << 4)
#define EXINT_POLCFG2_FP5_MASK            (0x01 << 5)
#define EXINT_POLCFG2_FP5_SHIFT           (5)
#define EXINT_POLCFG2_FP5(x)              (x << 5)
#define EXINT_POLCFG2_FP6_MASK            (0x01 << 6)
#define EXINT_POLCFG2_FP6_SHIFT           (6)
#define EXINT_POLCFG2_FP6(x)              (x << 6)
#define EXINT_POLCFG2_FP7_MASK            (0x01 << 7)
#define EXINT_POLCFG2_FP7_SHIFT           (7)
#define EXINT_POLCFG2_FP7(x)              (x << 7)
#define EXINT_POLCFG2_FP8_MASK            (0x01 << 8)
#define EXINT_POLCFG2_FP8_SHIFT           (8)
#define EXINT_POLCFG2_FP8(x)              (x << 8)
#define EXINT_POLCFG2_FP9_MASK            (0x01 << 9)
#define EXINT_POLCFG2_FP9_SHIFT           (9)
#define EXINT_POLCFG2_FP9(x)              (x << 9)
#define EXINT_POLCFG2_FP10_MASK           (0x01 << 10)
#define EXINT_POLCFG2_FP10_SHIFT          (10)
#define EXINT_POLCFG2_FP10(x)             (x << 10)
#define EXINT_POLCFG2_FP11_MASK           (0x01 << 11)
#define EXINT_POLCFG2_FP11_SHIFT          (11)
#define EXINT_POLCFG2_FP11(x)             (x << 11)
#define EXINT_POLCFG2_FP12_MASK           (0x01 << 12)
#define EXINT_POLCFG2_FP12_SHIFT          (12)
#define EXINT_POLCFG2_FP12(x)             (x << 12)
#define EXINT_POLCFG2_FP13_MASK           (0x01 << 13)
#define EXINT_POLCFG2_FP13_SHIFT          (13)
#define EXINT_POLCFG2_FP13(x)             (x << 13)
#define EXINT_POLCFG2_FP14_MASK           (0x01 << 14)
#define EXINT_POLCFG2_FP14_SHIFT          (14)
#define EXINT_POLCFG2_FP14(x)             (x << 14)
#define EXINT_POLCFG2_FP15_MASK           (0x01 << 15)
#define EXINT_POLCFG2_FP15_SHIFT          (15)
#define EXINT_POLCFG2_FP15(x)             (x << 15)
#define EXINT_POLCFG2_FP16_MASK           (0x01 << 16)
#define EXINT_POLCFG2_FP16_SHIFT          (16)
#define EXINT_POLCFG2_FP16(x)             (x << 16)
#define EXINT_POLCFG2_FP17_MASK           (0x01 << 17)
#define EXINT_POLCFG2_FP17_SHIFT          (17)
#define EXINT_POLCFG2_FP17(x)             (x << 17)
#define EXINT_POLCFG2_FP18_MASK           (0x01 << 18)
#define EXINT_POLCFG2_FP18_SHIFT          (18)
#define EXINT_POLCFG2_FP18(x)             (x << 18)
#define EXINT_POLCFG2_FP19_MASK           (0x01 << 19)
#define EXINT_POLCFG2_FP19_SHIFT          (19)
#define EXINT_POLCFG2_FP19(x)             (x << 19)
#define EXINT_SWTRG_SWT0_MASK             (0x01 << 0)
#define EXINT_SWTRG_SWT0_SHIFT            (0)
#define EXINT_SWTRG_SWT0(x)               (x << 0)
#define EXINT_SWTRG_SWT1_MASK             (0x01 << 1)
#define EXINT_SWTRG_SWT1_SHIFT            (1)
#define EXINT_SWTRG_SWT1(x)               (x << 1)
#define EXINT_SWTRG_SWT2_MASK             (0x01 << 2)
#define EXINT_SWTRG_SWT2_SHIFT            (2)
#define EXINT_SWTRG_SWT2(x)               (x << 2)
#define EXINT_SWTRG_SWT3_MASK             (0x01 << 3)
#define EXINT_SWTRG_SWT3_SHIFT            (3)
#define EXINT_SWTRG_SWT3(x)               (x << 3)
#define EXINT_SWTRG_SWT4_MASK             (0x01 << 4)
#define EXINT_SWTRG_SWT4_SHIFT            (4)
#define EXINT_SWTRG_SWT4(x)               (x << 4)
#define EXINT_SWTRG_SWT5_MASK             (0x01 << 5)
#define EXINT_SWTRG_SWT5_SHIFT            (5)
#define EXINT_SWTRG_SWT5(x)               (x << 5)
#define EXINT_SWTRG_SWT6_MASK             (0x01 << 6)
#define EXINT_SWTRG_SWT6_SHIFT            (6)
#define EXINT_SWTRG_SWT6(x)               (x << 6)
#define EXINT_SWTRG_SWT7_MASK             (0x01 << 7)
#define EXINT_SWTRG_SWT7_SHIFT            (7)
#define EXINT_SWTRG_SWT7(x)               (x << 7)
#define EXINT_SWTRG_SWT8_MASK             (0x01 << 8)
#define EXINT_SWTRG_SWT8_SHIFT            (8)
#define EXINT_SWTRG_SWT8(x)               (x << 8)
#define EXINT_SWTRG_SWT9_MASK             (0x01 << 9)
#define EXINT_SWTRG_SWT9_SHIFT            (9)
#define EXINT_SWTRG_SWT9(x)               (x << 9)
#define EXINT_SWTRG_SWT10_MASK            (0x01 << 10)
#define EXINT_SWTRG_SWT10_SHIFT           (10)
#define EXINT_SWTRG_SWT10(x)              (x << 10)
#define EXINT_SWTRG_SWT11_MASK            (0x01 << 11)
#define EXINT_SWTRG_SWT11_SHIFT           (11)
#define EXINT_SWTRG_SWT11(x)              (x << 11)
#define EXINT_SWTRG_SWT12_MASK            (0x01 << 12)
#define EXINT_SWTRG_SWT12_SHIFT           (12)
#define EXINT_SWTRG_SWT12(x)              (x << 12)
#define EXINT_SWTRG_SWT13_MASK            (0x01 << 13)
#define EXINT_SWTRG_SWT13_SHIFT           (13)
#define EXINT_SWTRG_SWT13(x)              (x << 13)
#define EXINT_SWTRG_SWT14_MASK            (0x01 << 14)
#define EXINT_SWTRG_SWT14_SHIFT           (14)
#define EXINT_SWTRG_SWT14(x)              (x << 14)
#define EXINT_SWTRG_SWT15_MASK            (0x01 << 15)
#define EXINT_SWTRG_SWT15_SHIFT           (15)
#define EXINT_SWTRG_SWT15(x)              (x << 15)
#define EXINT_SWTRG_SWT16_MASK            (0x01 << 16)
#define EXINT_SWTRG_SWT16_SHIFT           (16)
#define EXINT_SWTRG_SWT16(x)              (x << 16)
#define EXINT_SWTRG_SWT17_MASK            (0x01 << 17)
#define EXINT_SWTRG_SWT17_SHIFT           (17)
#define EXINT_SWTRG_SWT17(x)              (x << 17)
#define EXINT_SWTRG_SWT18_MASK            (0x01 << 18)
#define EXINT_SWTRG_SWT18_SHIFT           (18)
#define EXINT_SWTRG_SWT18(x)              (x << 18)
#define EXINT_SWTRG_SWT19_MASK            (0x01 << 19)
#define EXINT_SWTRG_SWT19_SHIFT           (19)
#define EXINT_SWTRG_SWT19(x)              (x << 19)
#define EXINT_INTSTS_LINE0_MASK           (0x01 << 0)
#define EXINT_INTSTS_LINE0_SHIFT          (0)
#define EXINT_INTSTS_LINE0(x)             (x << 0)
#define EXINT_INTSTS_LINE1_MASK           (0x01 << 1)
#define EXINT_INTSTS_LINE1_SHIFT          (1)
#define EXINT_INTSTS_LINE1(x)             (x << 1)
#define EXINT_INTSTS_LINE2_MASK           (0x01 << 2)
#define EXINT_INTSTS_LINE2_SHIFT          (2)
#define EXINT_INTSTS_LINE2(x)             (x << 2)
#define EXINT_INTSTS_LINE3_MASK           (0x01 << 3)
#define EXINT_INTSTS_LINE3_SHIFT          (3)
#define EXINT_INTSTS_LINE3(x)             (x << 3)
#define EXINT_INTSTS_LINE4_MASK           (0x01 << 4)
#define EXINT_INTSTS_LINE4_SHIFT          (4)
#define EXINT_INTSTS_LINE4(x)             (x << 4)
#define EXINT_INTSTS_LINE5_MASK           (0x01 << 5)
#define EXINT_INTSTS_LINE5_SHIFT          (5)
#define EXINT_INTSTS_LINE5(x)             (x << 5)
#define EXINT_INTSTS_LINE6_MASK           (0x01 << 6)
#define EXINT_INTSTS_LINE6_SHIFT          (6)
#define EXINT_INTSTS_LINE6(x)             (x << 6)
#define EXINT_INTSTS_LINE7_MASK           (0x01 << 7)
#define EXINT_INTSTS_LINE7_SHIFT          (7)
#define EXINT_INTSTS_LINE7(x)             (x << 7)
#define EXINT_INTSTS_LINE8_MASK           (0x01 << 8)
#define EXINT_INTSTS_LINE8_SHIFT          (8)
#define EXINT_INTSTS_LINE8(x)             (x << 8)
#define EXINT_INTSTS_LINE9_MASK           (0x01 << 9)
#define EXINT_INTSTS_LINE9_SHIFT          (9)
#define EXINT_INTSTS_LINE9(x)             (x << 9)
#define EXINT_INTSTS_LINE10_MASK          (0x01 << 10)
#define EXINT_INTSTS_LINE10_SHIFT         (10)
#define EXINT_INTSTS_LINE10(x)            (x << 10)
#define EXINT_INTSTS_LINE11_MASK          (0x01 << 11)
#define EXINT_INTSTS_LINE11_SHIFT         (11)
#define EXINT_INTSTS_LINE11(x)            (x << 11)
#define EXINT_INTSTS_LINE12_MASK          (0x01 << 12)
#define EXINT_INTSTS_LINE12_SHIFT         (12)
#define EXINT_INTSTS_LINE12(x)            (x << 12)
#define EXINT_INTSTS_LINE13_MASK          (0x01 << 13)
#define EXINT_INTSTS_LINE13_SHIFT         (13)
#define EXINT_INTSTS_LINE13(x)            (x << 13)
#define EXINT_INTSTS_LINE14_MASK          (0x01 << 14)
#define EXINT_INTSTS_LINE14_SHIFT         (14)
#define EXINT_INTSTS_LINE14(x)            (x << 14)
#define EXINT_INTSTS_LINE15_MASK          (0x01 << 15)
#define EXINT_INTSTS_LINE15_SHIFT         (15)
#define EXINT_INTSTS_LINE15(x)            (x << 15)
#define EXINT_INTSTS_LINE16_MASK          (0x01 << 16)
#define EXINT_INTSTS_LINE16_SHIFT         (16)
#define EXINT_INTSTS_LINE16(x)            (x << 16)
#define EXINT_INTSTS_LINE17_MASK          (0x01 << 17)
#define EXINT_INTSTS_LINE17_SHIFT         (17)
#define EXINT_INTSTS_LINE17(x)            (x << 17)
#define EXINT_INTSTS_LINE18_MASK          (0x01 << 18)
#define EXINT_INTSTS_LINE18_SHIFT         (18)
#define EXINT_INTSTS_LINE18(x)            (x << 18)
#define EXINT_INTSTS_LINE19_MASK          (0x01 << 19)
#define EXINT_INTSTS_LINE19_SHIFT         (19)
#define EXINT_INTSTS_LINE19(x)            (x << 19)

