eeucalyptus/at32f403a_minimal/at32f403a.h
/* DMA1 - DMA controller */
#define DMA_STS_GF1_MASK                  (0x01 << 0)
#define DMA_STS_GF1_SHIFT                 (0)
#define DMA_STS_GF1(x)                    (x << 0)
#define DMA_STS_GF2_MASK                  (0x01 << 4)
#define DMA_STS_GF2_SHIFT                 (4)
#define DMA_STS_GF2(x)                    (x << 4)
#define DMA_STS_GF3_MASK                  (0x01 << 8)
#define DMA_STS_GF3_SHIFT                 (8)
#define DMA_STS_GF3(x)                    (x << 8)
#define DMA_STS_GF4_MASK                  (0x01 << 12)
#define DMA_STS_GF4_SHIFT                 (12)
#define DMA_STS_GF4(x)                    (x << 12)
#define DMA_STS_GF5_MASK                  (0x01 << 16)
#define DMA_STS_GF5_SHIFT                 (16)
#define DMA_STS_GF5(x)                    (x << 16)
#define DMA_STS_GF6_MASK                  (0x01 << 20)
#define DMA_STS_GF6_SHIFT                 (20)
#define DMA_STS_GF6(x)                    (x << 20)
#define DMA_STS_GF7_MASK                  (0x01 << 24)
#define DMA_STS_GF7_SHIFT                 (24)
#define DMA_STS_GF7(x)                    (x << 24)
#define DMA_STS_FDTF1_MASK                (0x01 << 1)
#define DMA_STS_FDTF1_SHIFT               (1)
#define DMA_STS_FDTF1(x)                  (x << 1)
#define DMA_STS_FDTF2_MASK                (0x01 << 5)
#define DMA_STS_FDTF2_SHIFT               (5)
#define DMA_STS_FDTF2(x)                  (x << 5)
#define DMA_STS_FDTF3_MASK                (0x01 << 9)
#define DMA_STS_FDTF3_SHIFT               (9)
#define DMA_STS_FDTF3(x)                  (x << 9)
#define DMA_STS_FDTF4_MASK                (0x01 << 13)
#define DMA_STS_FDTF4_SHIFT               (13)
#define DMA_STS_FDTF4(x)                  (x << 13)
#define DMA_STS_FDTF5_MASK                (0x01 << 17)
#define DMA_STS_FDTF5_SHIFT               (17)
#define DMA_STS_FDTF5(x)                  (x << 17)
#define DMA_STS_FDTF6_MASK                (0x01 << 21)
#define DMA_STS_FDTF6_SHIFT               (21)
#define DMA_STS_FDTF6(x)                  (x << 21)
#define DMA_STS_FDTF7_MASK                (0x01 << 25)
#define DMA_STS_FDTF7_SHIFT               (25)
#define DMA_STS_FDTF7(x)                  (x << 25)
#define DMA_STS_HDTF1_MASK                (0x01 << 2)
#define DMA_STS_HDTF1_SHIFT               (2)
#define DMA_STS_HDTF1(x)                  (x << 2)
#define DMA_STS_HDTF2_MASK                (0x01 << 6)
#define DMA_STS_HDTF2_SHIFT               (6)
#define DMA_STS_HDTF2(x)                  (x << 6)
#define DMA_STS_HDTF3_MASK                (0x01 << 10)
#define DMA_STS_HDTF3_SHIFT               (10)
#define DMA_STS_HDTF3(x)                  (x << 10)
#define DMA_STS_HDTF4_MASK                (0x01 << 14)
#define DMA_STS_HDTF4_SHIFT               (14)
#define DMA_STS_HDTF4(x)                  (x << 14)
#define DMA_STS_HDTF5_MASK                (0x01 << 18)
#define DMA_STS_HDTF5_SHIFT               (18)
#define DMA_STS_HDTF5(x)                  (x << 18)
#define DMA_STS_HDTF6_MASK                (0x01 << 22)
#define DMA_STS_HDTF6_SHIFT               (22)
#define DMA_STS_HDTF6(x)                  (x << 22)
#define DMA_STS_HDTF7_MASK                (0x01 << 26)
#define DMA_STS_HDTF7_SHIFT               (26)
#define DMA_STS_HDTF7(x)                  (x << 26)
#define DMA_STS_DTERRF1_MASK              (0x01 << 3)
#define DMA_STS_DTERRF1_SHIFT             (3)
#define DMA_STS_DTERRF1(x)                (x << 3)
#define DMA_STS_DTERRF2_MASK              (0x01 << 7)
#define DMA_STS_DTERRF2_SHIFT             (7)
#define DMA_STS_DTERRF2(x)                (x << 7)
#define DMA_STS_DTERRF3_MASK              (0x01 << 11)
#define DMA_STS_DTERRF3_SHIFT             (11)
#define DMA_STS_DTERRF3(x)                (x << 11)
#define DMA_STS_DTERRF4_MASK              (0x01 << 15)
#define DMA_STS_DTERRF4_SHIFT             (15)
#define DMA_STS_DTERRF4(x)                (x << 15)
#define DMA_STS_DTERRF5_MASK              (0x01 << 19)
#define DMA_STS_DTERRF5_SHIFT             (19)
#define DMA_STS_DTERRF5(x)                (x << 19)
#define DMA_STS_DTERRF6_MASK              (0x01 << 23)
#define DMA_STS_DTERRF6_SHIFT             (23)
#define DMA_STS_DTERRF6(x)                (x << 23)
#define DMA_STS_DTERRF7_MASK              (0x01 << 27)
#define DMA_STS_DTERRF7_SHIFT             (27)
#define DMA_STS_DTERRF7(x)                (x << 27)
#define DMA_CLR_GFC1_MASK                 (0x01 << 0)
#define DMA_CLR_GFC1_SHIFT                (0)
#define DMA_CLR_GFC1(x)                   (x << 0)
#define DMA_CLR_GFC2_MASK                 (0x01 << 4)
#define DMA_CLR_GFC2_SHIFT                (4)
#define DMA_CLR_GFC2(x)                   (x << 4)
#define DMA_CLR_GFC3_MASK                 (0x01 << 8)
#define DMA_CLR_GFC3_SHIFT                (8)
#define DMA_CLR_GFC3(x)                   (x << 8)
#define DMA_CLR_GFC4_MASK                 (0x01 << 12)
#define DMA_CLR_GFC4_SHIFT                (12)
#define DMA_CLR_GFC4(x)                   (x << 12)
#define DMA_CLR_GFC5_MASK                 (0x01 << 16)
#define DMA_CLR_GFC5_SHIFT                (16)
#define DMA_CLR_GFC5(x)                   (x << 16)
#define DMA_CLR_GFC6_MASK                 (0x01 << 20)
#define DMA_CLR_GFC6_SHIFT                (20)
#define DMA_CLR_GFC6(x)                   (x << 20)
#define DMA_CLR_GFC7_MASK                 (0x01 << 24)
#define DMA_CLR_GFC7_SHIFT                (24)
#define DMA_CLR_GFC7(x)                   (x << 24)
#define DMA_CLR_FDTFC1_MASK               (0x01 << 1)
#define DMA_CLR_FDTFC1_SHIFT              (1)
#define DMA_CLR_FDTFC1(x)                 (x << 1)
#define DMA_CLR_FDTFC2_MASK               (0x01 << 5)
#define DMA_CLR_FDTFC2_SHIFT              (5)
#define DMA_CLR_FDTFC2(x)                 (x << 5)
#define DMA_CLR_FDTFC3_MASK               (0x01 << 9)
#define DMA_CLR_FDTFC3_SHIFT              (9)
#define DMA_CLR_FDTFC3(x)                 (x << 9)
#define DMA_CLR_FDTFC4_MASK               (0x01 << 13)
#define DMA_CLR_FDTFC4_SHIFT              (13)
#define DMA_CLR_FDTFC4(x)                 (x << 13)
#define DMA_CLR_FDTFC5_MASK               (0x01 << 17)
#define DMA_CLR_FDTFC5_SHIFT              (17)
#define DMA_CLR_FDTFC5(x)                 (x << 17)
#define DMA_CLR_FDTFC6_MASK               (0x01 << 21)
#define DMA_CLR_FDTFC6_SHIFT              (21)
#define DMA_CLR_FDTFC6(x)                 (x << 21)
#define DMA_CLR_FDTFC7_MASK               (0x01 << 25)
#define DMA_CLR_FDTFC7_SHIFT              (25)
#define DMA_CLR_FDTFC7(x)                 (x << 25)
#define DMA_CLR_HDTFC1_MASK               (0x01 << 2)
#define DMA_CLR_HDTFC1_SHIFT              (2)
#define DMA_CLR_HDTFC1(x)                 (x << 2)
#define DMA_CLR_HDTFC2_MASK               (0x01 << 6)
#define DMA_CLR_HDTFC2_SHIFT              (6)
#define DMA_CLR_HDTFC2(x)                 (x << 6)
#define DMA_CLR_HDTFC3_MASK               (0x01 << 10)
#define DMA_CLR_HDTFC3_SHIFT              (10)
#define DMA_CLR_HDTFC3(x)                 (x << 10)
#define DMA_CLR_HDTFC4_MASK               (0x01 << 14)
#define DMA_CLR_HDTFC4_SHIFT              (14)
#define DMA_CLR_HDTFC4(x)                 (x << 14)
#define DMA_CLR_HDTFC5_MASK               (0x01 << 18)
#define DMA_CLR_HDTFC5_SHIFT              (18)
#define DMA_CLR_HDTFC5(x)                 (x << 18)
#define DMA_CLR_HDTFC6_MASK               (0x01 << 22)
#define DMA_CLR_HDTFC6_SHIFT              (22)
#define DMA_CLR_HDTFC6(x)                 (x << 22)
#define DMA_CLR_HDTFC7_MASK               (0x01 << 26)
#define DMA_CLR_HDTFC7_SHIFT              (26)
#define DMA_CLR_HDTFC7(x)                 (x << 26)
#define DMA_CLR_DTERRFC1_MASK             (0x01 << 3)
#define DMA_CLR_DTERRFC1_SHIFT            (3)
#define DMA_CLR_DTERRFC1(x)               (x << 3)
#define DMA_CLR_DTERRFC2_MASK             (0x01 << 7)
#define DMA_CLR_DTERRFC2_SHIFT            (7)
#define DMA_CLR_DTERRFC2(x)               (x << 7)
#define DMA_CLR_DTERRFC3_MASK             (0x01 << 11)
#define DMA_CLR_DTERRFC3_SHIFT            (11)
#define DMA_CLR_DTERRFC3(x)               (x << 11)
#define DMA_CLR_DTERRFC4_MASK             (0x01 << 15)
#define DMA_CLR_DTERRFC4_SHIFT            (15)
#define DMA_CLR_DTERRFC4(x)               (x << 15)
#define DMA_CLR_DTERRFC5_MASK             (0x01 << 19)
#define DMA_CLR_DTERRFC5_SHIFT            (19)
#define DMA_CLR_DTERRFC5(x)               (x << 19)
#define DMA_CLR_DTERRFC6_MASK             (0x01 << 23)
#define DMA_CLR_DTERRFC6_SHIFT            (23)
#define DMA_CLR_DTERRFC6(x)               (x << 23)
#define DMA_CLR_DTERRFC7_MASK             (0x01 << 27)
#define DMA_CLR_DTERRFC7_SHIFT            (27)
#define DMA_CLR_DTERRFC7(x)               (x << 27)
#define DMA_C1CTRL_CHEN_MASK              (0x01 << 0)
#define DMA_C1CTRL_CHEN_SHIFT             (0)
#define DMA_C1CTRL_CHEN(x)                (x << 0)
#define DMA_C1CTRL_FDTIEN_MASK            (0x01 << 1)
#define DMA_C1CTRL_FDTIEN_SHIFT           (1)
#define DMA_C1CTRL_FDTIEN(x)              (x << 1)
#define DMA_C1CTRL_HDTIEN_MASK            (0x01 << 2)
#define DMA_C1CTRL_HDTIEN_SHIFT           (2)
#define DMA_C1CTRL_HDTIEN(x)              (x << 2)
#define DMA_C1CTRL_DTERRIEN_MASK          (0x01 << 3)
#define DMA_C1CTRL_DTERRIEN_SHIFT         (3)
#define DMA_C1CTRL_DTERRIEN(x)            (x << 3)
#define DMA_C1CTRL_DTD_MASK               (0x01 << 4)
#define DMA_C1CTRL_DTD_SHIFT              (4)
#define DMA_C1CTRL_DTD(x)                 (x << 4)
#define DMA_C1CTRL_LM_MASK                (0x01 << 5)
#define DMA_C1CTRL_LM_SHIFT               (5)
#define DMA_C1CTRL_LM(x)                  (x << 5)
#define DMA_C1CTRL_PINCM_MASK             (0x01 << 6)
#define DMA_C1CTRL_PINCM_SHIFT            (6)
#define DMA_C1CTRL_PINCM(x)               (x << 6)
#define DMA_C1CTRL_MINCM_MASK             (0x01 << 7)
#define DMA_C1CTRL_MINCM_SHIFT            (7)
#define DMA_C1CTRL_MINCM(x)               (x << 7)
#define DMA_C1CTRL_PWIDTH_MASK            (0x03 << 8)
#define DMA_C1CTRL_PWIDTH_SHIFT           (8)
#define DMA_C1CTRL_PWIDTH(x)              (x << 8)
#define DMA_C1CTRL_MWIDTH_MASK            (0x03 << 10)
#define DMA_C1CTRL_MWIDTH_SHIFT           (10)
#define DMA_C1CTRL_MWIDTH(x)              (x << 10)
#define DMA_C1CTRL_CHPL_MASK              (0x03 << 12)
#define DMA_C1CTRL_CHPL_SHIFT             (12)
#define DMA_C1CTRL_CHPL(x)                (x << 12)
#define DMA_C1CTRL_M2M_MASK               (0x01 << 14)
#define DMA_C1CTRL_M2M_SHIFT              (14)
#define DMA_C1CTRL_M2M(x)                 (x << 14)
#define DMA_C1DTCNT_CNT_MASK              (0xffff << 0)
#define DMA_C1DTCNT_CNT_SHIFT             (0)
#define DMA_C1DTCNT_CNT(x)                (x << 0)
#define DMA_C1PADDR_PADDR_MASK            (0xffffffff << 0)
#define DMA_C1PADDR_PADDR_SHIFT           (0)
#define DMA_C1PADDR_PADDR(x)              (x << 0)
#define DMA_C1MADDR_MADDR_MASK            (0xffffffff << 0)
#define DMA_C1MADDR_MADDR_SHIFT           (0)
#define DMA_C1MADDR_MADDR(x)              (x << 0)
#define DMA_C2CTRL_CHEN_MASK              (0x01 << 0)
#define DMA_C2CTRL_CHEN_SHIFT             (0)
#define DMA_C2CTRL_CHEN(x)                (x << 0)
#define DMA_C2CTRL_FDTIEN_MASK            (0x01 << 1)
#define DMA_C2CTRL_FDTIEN_SHIFT           (1)
#define DMA_C2CTRL_FDTIEN(x)              (x << 1)
#define DMA_C2CTRL_HDTIEN_MASK            (0x01 << 2)
#define DMA_C2CTRL_HDTIEN_SHIFT           (2)
#define DMA_C2CTRL_HDTIEN(x)              (x << 2)
#define DMA_C2CTRL_DTERRIEN_MASK          (0x01 << 3)
#define DMA_C2CTRL_DTERRIEN_SHIFT         (3)
#define DMA_C2CTRL_DTERRIEN(x)            (x << 3)
#define DMA_C2CTRL_DTD_MASK               (0x01 << 4)
#define DMA_C2CTRL_DTD_SHIFT              (4)
#define DMA_C2CTRL_DTD(x)                 (x << 4)
#define DMA_C2CTRL_LM_MASK                (0x01 << 5)
#define DMA_C2CTRL_LM_SHIFT               (5)
#define DMA_C2CTRL_LM(x)                  (x << 5)
#define DMA_C2CTRL_PINCM_MASK             (0x01 << 6)
#define DMA_C2CTRL_PINCM_SHIFT            (6)
#define DMA_C2CTRL_PINCM(x)               (x << 6)
#define DMA_C2CTRL_MINCM_MASK             (0x01 << 7)
#define DMA_C2CTRL_MINCM_SHIFT            (7)
#define DMA_C2CTRL_MINCM(x)               (x << 7)
#define DMA_C2CTRL_PWIDTH_MASK            (0x03 << 8)
#define DMA_C2CTRL_PWIDTH_SHIFT           (8)
#define DMA_C2CTRL_PWIDTH(x)              (x << 8)
#define DMA_C2CTRL_MWIDTH_MASK            (0x03 << 10)
#define DMA_C2CTRL_MWIDTH_SHIFT           (10)
#define DMA_C2CTRL_MWIDTH(x)              (x << 10)
#define DMA_C2CTRL_CHPL_MASK              (0x03 << 12)
#define DMA_C2CTRL_CHPL_SHIFT             (12)
#define DMA_C2CTRL_CHPL(x)                (x << 12)
#define DMA_C2CTRL_M2M_MASK               (0x01 << 14)
#define DMA_C2CTRL_M2M_SHIFT              (14)
#define DMA_C2CTRL_M2M(x)                 (x << 14)
#define DMA_C2DTCNT_CNT_MASK              (0xffff << 0)
#define DMA_C2DTCNT_CNT_SHIFT             (0)
#define DMA_C2DTCNT_CNT(x)                (x << 0)
#define DMA_C2PADDR_PADDR_MASK            (0xffffffff << 0)
#define DMA_C2PADDR_PADDR_SHIFT           (0)
#define DMA_C2PADDR_PADDR(x)              (x << 0)
#define DMA_C2MADDR_MADDR_MASK            (0xffffffff << 0)
#define DMA_C2MADDR_MADDR_SHIFT           (0)
#define DMA_C2MADDR_MADDR(x)              (x << 0)
#define DMA_C3CTRL_CHEN_MASK              (0x01 << 0)
#define DMA_C3CTRL_CHEN_SHIFT             (0)
#define DMA_C3CTRL_CHEN(x)                (x << 0)
#define DMA_C3CTRL_FDTIEN_MASK            (0x01 << 1)
#define DMA_C3CTRL_FDTIEN_SHIFT           (1)
#define DMA_C3CTRL_FDTIEN(x)              (x << 1)
#define DMA_C3CTRL_HDTIEN_MASK            (0x01 << 2)
#define DMA_C3CTRL_HDTIEN_SHIFT           (2)
#define DMA_C3CTRL_HDTIEN(x)              (x << 2)
#define DMA_C3CTRL_DTERRIEN_MASK          (0x01 << 3)
#define DMA_C3CTRL_DTERRIEN_SHIFT         (3)
#define DMA_C3CTRL_DTERRIEN(x)            (x << 3)
#define DMA_C3CTRL_DTD_MASK               (0x01 << 4)
#define DMA_C3CTRL_DTD_SHIFT              (4)
#define DMA_C3CTRL_DTD(x)                 (x << 4)
#define DMA_C3CTRL_LM_MASK                (0x01 << 5)
#define DMA_C3CTRL_LM_SHIFT               (5)
#define DMA_C3CTRL_LM(x)                  (x << 5)
#define DMA_C3CTRL_PINCM_MASK             (0x01 << 6)
#define DMA_C3CTRL_PINCM_SHIFT            (6)
#define DMA_C3CTRL_PINCM(x)               (x << 6)
#define DMA_C3CTRL_MINCM_MASK             (0x01 << 7)
#define DMA_C3CTRL_MINCM_SHIFT            (7)
#define DMA_C3CTRL_MINCM(x)               (x << 7)
#define DMA_C3CTRL_PWIDTH_MASK            (0x03 << 8)
#define DMA_C3CTRL_PWIDTH_SHIFT           (8)
#define DMA_C3CTRL_PWIDTH(x)              (x << 8)
#define DMA_C3CTRL_MWIDTH_MASK            (0x03 << 10)
#define DMA_C3CTRL_MWIDTH_SHIFT           (10)
#define DMA_C3CTRL_MWIDTH(x)              (x << 10)
#define DMA_C3CTRL_CHPL_MASK              (0x03 << 12)
#define DMA_C3CTRL_CHPL_SHIFT             (12)
#define DMA_C3CTRL_CHPL(x)                (x << 12)
#define DMA_C3CTRL_M2M_MASK               (0x01 << 14)
#define DMA_C3CTRL_M2M_SHIFT              (14)
#define DMA_C3CTRL_M2M(x)                 (x << 14)
#define DMA_C3DTCNT_CNT_MASK              (0xffff << 0)
#define DMA_C3DTCNT_CNT_SHIFT             (0)
#define DMA_C3DTCNT_CNT(x)                (x << 0)
#define DMA_C3PADDR_PADDR_MASK            (0xffffffff << 0)
#define DMA_C3PADDR_PADDR_SHIFT           (0)
#define DMA_C3PADDR_PADDR(x)              (x << 0)
#define DMA_C3MADDR_MADDR_MASK            (0xffffffff << 0)
#define DMA_C3MADDR_MADDR_SHIFT           (0)
#define DMA_C3MADDR_MADDR(x)              (x << 0)
#define DMA_C4CTRL_CHEN_MASK              (0x01 << 0)
#define DMA_C4CTRL_CHEN_SHIFT             (0)
#define DMA_C4CTRL_CHEN(x)                (x << 0)
#define DMA_C4CTRL_FDTIEN_MASK            (0x01 << 1)
#define DMA_C4CTRL_FDTIEN_SHIFT           (1)
#define DMA_C4CTRL_FDTIEN(x)              (x << 1)
#define DMA_C4CTRL_HDTIEN_MASK            (0x01 << 2)
#define DMA_C4CTRL_HDTIEN_SHIFT           (2)
#define DMA_C4CTRL_HDTIEN(x)              (x << 2)
#define DMA_C4CTRL_DTERRIEN_MASK          (0x01 << 3)
#define DMA_C4CTRL_DTERRIEN_SHIFT         (3)
#define DMA_C4CTRL_DTERRIEN(x)            (x << 3)
#define DMA_C4CTRL_DTD_MASK               (0x01 << 4)
#define DMA_C4CTRL_DTD_SHIFT              (4)
#define DMA_C4CTRL_DTD(x)                 (x << 4)
#define DMA_C4CTRL_LM_MASK                (0x01 << 5)
#define DMA_C4CTRL_LM_SHIFT               (5)
#define DMA_C4CTRL_LM(x)                  (x << 5)
#define DMA_C4CTRL_PINCM_MASK             (0x01 << 6)
#define DMA_C4CTRL_PINCM_SHIFT            (6)
#define DMA_C4CTRL_PINCM(x)               (x << 6)
#define DMA_C4CTRL_MINCM_MASK             (0x01 << 7)
#define DMA_C4CTRL_MINCM_SHIFT            (7)
#define DMA_C4CTRL_MINCM(x)               (x << 7)
#define DMA_C4CTRL_PWIDTH_MASK            (0x03 << 8)
#define DMA_C4CTRL_PWIDTH_SHIFT           (8)
#define DMA_C4CTRL_PWIDTH(x)              (x << 8)
#define DMA_C4CTRL_MWIDTH_MASK            (0x03 << 10)
#define DMA_C4CTRL_MWIDTH_SHIFT           (10)
#define DMA_C4CTRL_MWIDTH(x)              (x << 10)
#define DMA_C4CTRL_CHPL_MASK              (0x03 << 12)
#define DMA_C4CTRL_CHPL_SHIFT             (12)
#define DMA_C4CTRL_CHPL(x)                (x << 12)
#define DMA_C4CTRL_M2M_MASK               (0x01 << 14)
#define DMA_C4CTRL_M2M_SHIFT              (14)
#define DMA_C4CTRL_M2M(x)                 (x << 14)
#define DMA_C4DTCNT_CNT_MASK              (0xffff << 0)
#define DMA_C4DTCNT_CNT_SHIFT             (0)
#define DMA_C4DTCNT_CNT(x)                (x << 0)
#define DMA_C4PADDR_PADDR_MASK            (0xffffffff << 0)
#define DMA_C4PADDR_PADDR_SHIFT           (0)
#define DMA_C4PADDR_PADDR(x)              (x << 0)
#define DMA_C4MADDR_MADDR_MASK            (0xffffffff << 0)
#define DMA_C4MADDR_MADDR_SHIFT           (0)
#define DMA_C4MADDR_MADDR(x)              (x << 0)
#define DMA_C5CTRL_CHEN_MASK              (0x01 << 0)
#define DMA_C5CTRL_CHEN_SHIFT             (0)
#define DMA_C5CTRL_CHEN(x)                (x << 0)
#define DMA_C5CTRL_FDTIEN_MASK            (0x01 << 1)
#define DMA_C5CTRL_FDTIEN_SHIFT           (1)
#define DMA_C5CTRL_FDTIEN(x)              (x << 1)
#define DMA_C5CTRL_HDTIEN_MASK            (0x01 << 2)
#define DMA_C5CTRL_HDTIEN_SHIFT           (2)
#define DMA_C5CTRL_HDTIEN(x)              (x << 2)
#define DMA_C5CTRL_DTERRIEN_MASK          (0x01 << 3)
#define DMA_C5CTRL_DTERRIEN_SHIFT         (3)
#define DMA_C5CTRL_DTERRIEN(x)            (x << 3)
#define DMA_C5CTRL_DTD_MASK               (0x01 << 4)
#define DMA_C5CTRL_DTD_SHIFT              (4)
#define DMA_C5CTRL_DTD(x)                 (x << 4)
#define DMA_C5CTRL_LM_MASK                (0x01 << 5)
#define DMA_C5CTRL_LM_SHIFT               (5)
#define DMA_C5CTRL_LM(x)                  (x << 5)
#define DMA_C5CTRL_PINCM_MASK             (0x01 << 6)
#define DMA_C5CTRL_PINCM_SHIFT            (6)
#define DMA_C5CTRL_PINCM(x)               (x << 6)
#define DMA_C5CTRL_MINCM_MASK             (0x01 << 7)
#define DMA_C5CTRL_MINCM_SHIFT            (7)
#define DMA_C5CTRL_MINCM(x)               (x << 7)
#define DMA_C5CTRL_PWIDTH_MASK            (0x03 << 8)
#define DMA_C5CTRL_PWIDTH_SHIFT           (8)
#define DMA_C5CTRL_PWIDTH(x)              (x << 8)
#define DMA_C5CTRL_MWIDTH_MASK            (0x03 << 10)
#define DMA_C5CTRL_MWIDTH_SHIFT           (10)
#define DMA_C5CTRL_MWIDTH(x)              (x << 10)
#define DMA_C5CTRL_CHPL_MASK              (0x03 << 12)
#define DMA_C5CTRL_CHPL_SHIFT             (12)
#define DMA_C5CTRL_CHPL(x)                (x << 12)
#define DMA_C5CTRL_M2M_MASK               (0x01 << 14)
#define DMA_C5CTRL_M2M_SHIFT              (14)
#define DMA_C5CTRL_M2M(x)                 (x << 14)
#define DMA_C5DTCNT_CNT_MASK              (0xffff << 0)
#define DMA_C5DTCNT_CNT_SHIFT             (0)
#define DMA_C5DTCNT_CNT(x)                (x << 0)
#define DMA_C5PADDR_PADDR_MASK            (0xffffffff << 0)
#define DMA_C5PADDR_PADDR_SHIFT           (0)
#define DMA_C5PADDR_PADDR(x)              (x << 0)
#define DMA_C5MADDR_MADDR_MASK            (0xffffffff << 0)
#define DMA_C5MADDR_MADDR_SHIFT           (0)
#define DMA_C5MADDR_MADDR(x)              (x << 0)
#define DMA_C6CTRL_CHEN_MASK              (0x01 << 0)
#define DMA_C6CTRL_CHEN_SHIFT             (0)
#define DMA_C6CTRL_CHEN(x)                (x << 0)
#define DMA_C6CTRL_FDTIEN_MASK            (0x01 << 1)
#define DMA_C6CTRL_FDTIEN_SHIFT           (1)
#define DMA_C6CTRL_FDTIEN(x)              (x << 1)
#define DMA_C6CTRL_HDTIEN_MASK            (0x01 << 2)
#define DMA_C6CTRL_HDTIEN_SHIFT           (2)
#define DMA_C6CTRL_HDTIEN(x)              (x << 2)
#define DMA_C6CTRL_DTERRIEN_MASK          (0x01 << 3)
#define DMA_C6CTRL_DTERRIEN_SHIFT         (3)
#define DMA_C6CTRL_DTERRIEN(x)            (x << 3)
#define DMA_C6CTRL_DTD_MASK               (0x01 << 4)
#define DMA_C6CTRL_DTD_SHIFT              (4)
#define DMA_C6CTRL_DTD(x)                 (x << 4)
#define DMA_C6CTRL_LM_MASK                (0x01 << 5)
#define DMA_C6CTRL_LM_SHIFT               (5)
#define DMA_C6CTRL_LM(x)                  (x << 5)
#define DMA_C6CTRL_PINCM_MASK             (0x01 << 6)
#define DMA_C6CTRL_PINCM_SHIFT            (6)
#define DMA_C6CTRL_PINCM(x)               (x << 6)
#define DMA_C6CTRL_MINCM_MASK             (0x01 << 7)
#define DMA_C6CTRL_MINCM_SHIFT            (7)
#define DMA_C6CTRL_MINCM(x)               (x << 7)
#define DMA_C6CTRL_PWIDTH_MASK            (0x03 << 8)
#define DMA_C6CTRL_PWIDTH_SHIFT           (8)
#define DMA_C6CTRL_PWIDTH(x)              (x << 8)
#define DMA_C6CTRL_MWIDTH_MASK            (0x03 << 10)
#define DMA_C6CTRL_MWIDTH_SHIFT           (10)
#define DMA_C6CTRL_MWIDTH(x)              (x << 10)
#define DMA_C6CTRL_CHPL_MASK              (0x03 << 12)
#define DMA_C6CTRL_CHPL_SHIFT             (12)
#define DMA_C6CTRL_CHPL(x)                (x << 12)
#define DMA_C6CTRL_M2M_MASK               (0x01 << 14)
#define DMA_C6CTRL_M2M_SHIFT              (14)
#define DMA_C6CTRL_M2M(x)                 (x << 14)
#define DMA_C6DTCNT_CNT_MASK              (0xffff << 0)
#define DMA_C6DTCNT_CNT_SHIFT             (0)
#define DMA_C6DTCNT_CNT(x)                (x << 0)
#define DMA_C6PADDR_PADDR_MASK            (0xffffffff << 0)
#define DMA_C6PADDR_PADDR_SHIFT           (0)
#define DMA_C6PADDR_PADDR(x)              (x << 0)
#define DMA_C6MADDR_MADDR_MASK            (0xffffffff << 0)
#define DMA_C6MADDR_MADDR_SHIFT           (0)
#define DMA_C6MADDR_MADDR(x)              (x << 0)
#define DMA_C7CTRL_CHEN_MASK              (0x01 << 0)
#define DMA_C7CTRL_CHEN_SHIFT             (0)
#define DMA_C7CTRL_CHEN(x)                (x << 0)
#define DMA_C7CTRL_FDTIEN_MASK            (0x01 << 1)
#define DMA_C7CTRL_FDTIEN_SHIFT           (1)
#define DMA_C7CTRL_FDTIEN(x)              (x << 1)
#define DMA_C7CTRL_HDTIEN_MASK            (0x01 << 2)
#define DMA_C7CTRL_HDTIEN_SHIFT           (2)
#define DMA_C7CTRL_HDTIEN(x)              (x << 2)
#define DMA_C7CTRL_DTERRIEN_MASK          (0x01 << 3)
#define DMA_C7CTRL_DTERRIEN_SHIFT         (3)
#define DMA_C7CTRL_DTERRIEN(x)            (x << 3)
#define DMA_C7CTRL_DTD_MASK               (0x01 << 4)
#define DMA_C7CTRL_DTD_SHIFT              (4)
#define DMA_C7CTRL_DTD(x)                 (x << 4)
#define DMA_C7CTRL_LM_MASK                (0x01 << 5)
#define DMA_C7CTRL_LM_SHIFT               (5)
#define DMA_C7CTRL_LM(x)                  (x << 5)
#define DMA_C7CTRL_PINCM_MASK             (0x01 << 6)
#define DMA_C7CTRL_PINCM_SHIFT            (6)
#define DMA_C7CTRL_PINCM(x)               (x << 6)
#define DMA_C7CTRL_MINCM_MASK             (0x01 << 7)
#define DMA_C7CTRL_MINCM_SHIFT            (7)
#define DMA_C7CTRL_MINCM(x)               (x << 7)
#define DMA_C7CTRL_PWIDTH_MASK            (0x03 << 8)
#define DMA_C7CTRL_PWIDTH_SHIFT           (8)
#define DMA_C7CTRL_PWIDTH(x)              (x << 8)
#define DMA_C7CTRL_MWIDTH_MASK            (0x03 << 10)
#define DMA_C7CTRL_MWIDTH_SHIFT           (10)
#define DMA_C7CTRL_MWIDTH(x)              (x << 10)
#define DMA_C7CTRL_CHPL_MASK              (0x03 << 12)
#define DMA_C7CTRL_CHPL_SHIFT             (12)
#define DMA_C7CTRL_CHPL(x)                (x << 12)
