eeucalyptus/at32f403a_minimal/at32f403a.h
#define DMA_C7CTRL_M2M_MASK               (0x01 << 14)
#define DMA_C7CTRL_M2M_SHIFT              (14)
#define DMA_C7CTRL_M2M(x)                 (x << 14)
#define DMA_C7DTCNT_CNT_MASK              (0xffff << 0)
#define DMA_C7DTCNT_CNT_SHIFT             (0)
#define DMA_C7DTCNT_CNT(x)                (x << 0)
#define DMA_C7PADDR_PADDR_MASK            (0xffffffff << 0)
#define DMA_C7PADDR_PADDR_SHIFT           (0)
#define DMA_C7PADDR_PADDR(x)              (x << 0)
#define DMA_C7MADDR_MADDR_MASK            (0xffffffff << 0)
#define DMA_C7MADDR_MADDR_SHIFT           (0)
#define DMA_C7MADDR_MADDR(x)              (x << 0)
#define DMA_DMA_SRC_SEL0_CH1_SRC_MASK     (0xff << 0)
#define DMA_DMA_SRC_SEL0_CH1_SRC_SHIFT    (0)
#define DMA_DMA_SRC_SEL0_CH1_SRC(x)       (x << 0)
#define DMA_DMA_SRC_SEL0_CH2_SRC_MASK     (0xff << 8)
#define DMA_DMA_SRC_SEL0_CH2_SRC_SHIFT    (8)
#define DMA_DMA_SRC_SEL0_CH2_SRC(x)       (x << 8)
#define DMA_DMA_SRC_SEL0_CH3_SRC_MASK     (0xff << 16)
#define DMA_DMA_SRC_SEL0_CH3_SRC_SHIFT    (16)
#define DMA_DMA_SRC_SEL0_CH3_SRC(x)       (x << 16)
#define DMA_DMA_SRC_SEL0_CH4_SRC_MASK     (0xff << 24)
#define DMA_DMA_SRC_SEL0_CH4_SRC_SHIFT    (24)
#define DMA_DMA_SRC_SEL0_CH4_SRC(x)       (x << 24)
#define DMA_DMA_SRC_SEL1_CH5_SRC_MASK     (0xff << 0)
#define DMA_DMA_SRC_SEL1_CH5_SRC_SHIFT    (0)
#define DMA_DMA_SRC_SEL1_CH5_SRC(x)       (x << 0)
#define DMA_DMA_SRC_SEL1_CH6_SRC_MASK     (0xff << 8)
#define DMA_DMA_SRC_SEL1_CH6_SRC_SHIFT    (8)
#define DMA_DMA_SRC_SEL1_CH6_SRC(x)       (x << 8)
#define DMA_DMA_SRC_SEL1_CH7_SRC_MASK     (0xff << 16)
#define DMA_DMA_SRC_SEL1_CH7_SRC_SHIFT    (16)
#define DMA_DMA_SRC_SEL1_CH7_SRC(x)       (x << 16)
#define DMA_DMA_SRC_SEL1_DMA_FLEX_EN_MASK (0x01 << 24)
#define DMA_DMA_SRC_SEL1_DMA_FLEX_EN_SHIFT (24)
#define DMA_DMA_SRC_SEL1_DMA_FLEX_EN(x)   (x << 24)

/* SDIO1 - Secure digital input/output interface */
#define SDIO_PWRCTRL_PS_MASK              (0x03 << 0)
#define SDIO_PWRCTRL_PS_SHIFT             (0)
#define SDIO_PWRCTRL_PS(x)                (x << 0)
#define SDIO_CLKCTRL_CLKDIV_MASK          (0xff << 0)
#define SDIO_CLKCTRL_CLKDIV_SHIFT         (0)
#define SDIO_CLKCTRL_CLKDIV(x)            (x << 0)
#define SDIO_CLKCTRL_CLKOEN_MASK          (0x01 << 8)
#define SDIO_CLKCTRL_CLKOEN_SHIFT         (8)
#define SDIO_CLKCTRL_CLKOEN(x)            (x << 8)
#define SDIO_CLKCTRL_PWRSVEN_MASK         (0x01 << 9)
#define SDIO_CLKCTRL_PWRSVEN_SHIFT        (9)
#define SDIO_CLKCTRL_PWRSVEN(x)           (x << 9)
#define SDIO_CLKCTRL_BYPSEN_MASK          (0x01 << 10)
#define SDIO_CLKCTRL_BYPSEN_SHIFT         (10)
#define SDIO_CLKCTRL_BYPSEN(x)            (x << 10)
#define SDIO_CLKCTRL_BUSWS_MASK           (0x03 << 11)
#define SDIO_CLKCTRL_BUSWS_SHIFT          (11)
#define SDIO_CLKCTRL_BUSWS(x)             (x << 11)
#define SDIO_CLKCTRL_CLKEDS_MASK          (0x01 << 13)
#define SDIO_CLKCTRL_CLKEDS_SHIFT         (13)
#define SDIO_CLKCTRL_CLKEDS(x)            (x << 13)
#define SDIO_CLKCTRL_HFCEN_MASK           (0x01 << 14)
#define SDIO_CLKCTRL_HFCEN_SHIFT          (14)
#define SDIO_CLKCTRL_HFCEN(x)             (x << 14)
#define SDIO_CLKCTRL_CLKDIV98_MASK        (0x03 << 15)
#define SDIO_CLKCTRL_CLKDIV98_SHIFT       (15)
#define SDIO_CLKCTRL_CLKDIV98(x)          (x << 15)
#define SDIO_ARGU_ARGU_MASK               (0xffffffff << 0)
#define SDIO_ARGU_ARGU_SHIFT              (0)
#define SDIO_ARGU_ARGU(x)                 (x << 0)
#define SDIO_CMDCTRL_CMDIDX_MASK          (0x3f << 0)
#define SDIO_CMDCTRL_CMDIDX_SHIFT         (0)
#define SDIO_CMDCTRL_CMDIDX(x)            (x << 0)
#define SDIO_CMDCTRL_RSPWT_MASK           (0x03 << 6)
#define SDIO_CMDCTRL_RSPWT_SHIFT          (6)
#define SDIO_CMDCTRL_RSPWT(x)             (x << 6)
#define SDIO_CMDCTRL_INTWT_MASK           (0x01 << 8)
#define SDIO_CMDCTRL_INTWT_SHIFT          (8)
#define SDIO_CMDCTRL_INTWT(x)             (x << 8)
#define SDIO_CMDCTRL_PNDWT_MASK           (0x01 << 9)
#define SDIO_CMDCTRL_PNDWT_SHIFT          (9)
#define SDIO_CMDCTRL_PNDWT(x)             (x << 9)
#define SDIO_CMDCTRL_CCSMEN_MASK          (0x01 << 10)
#define SDIO_CMDCTRL_CCSMEN_SHIFT         (10)
#define SDIO_CMDCTRL_CCSMEN(x)            (x << 10)
#define SDIO_CMDCTRL_IOSUSP_MASK          (0x01 << 11)
#define SDIO_CMDCTRL_IOSUSP_SHIFT         (11)
#define SDIO_CMDCTRL_IOSUSP(x)            (x << 11)
#define SDIO_RSPCMD_RSPCMD_MASK           (0x3f << 0)
#define SDIO_RSPCMD_RSPCMD_SHIFT          (0)
#define SDIO_RSPCMD_RSPCMD(x)             (x << 0)
#define SDIO_RSP1_CARDSTS1_MASK           (0xffffffff << 0)
#define SDIO_RSP1_CARDSTS1_SHIFT          (0)
#define SDIO_RSP1_CARDSTS1(x)             (x << 0)
#define SDIO_RSP2_CARDSTS2_MASK           (0xffffffff << 0)
#define SDIO_RSP2_CARDSTS2_SHIFT          (0)
#define SDIO_RSP2_CARDSTS2(x)             (x << 0)
#define SDIO_RSP3_CARDSTS3_MASK           (0xffffffff << 0)
#define SDIO_RSP3_CARDSTS3_SHIFT          (0)
#define SDIO_RSP3_CARDSTS3(x)             (x << 0)
#define SDIO_RSP4_CARDSTS4_MASK           (0xffffffff << 0)
#define SDIO_RSP4_CARDSTS4_SHIFT          (0)
#define SDIO_RSP4_CARDSTS4(x)             (x << 0)
#define SDIO_DTTMR_TIMEOUT_MASK           (0xffffffff << 0)
#define SDIO_DTTMR_TIMEOUT_SHIFT          (0)
#define SDIO_DTTMR_TIMEOUT(x)             (x << 0)
#define SDIO_DTLEN_DTLEN_MASK             (0x1ffffff << 0)
#define SDIO_DTLEN_DTLEN_SHIFT            (0)
#define SDIO_DTLEN_DTLEN(x)               (x << 0)
#define SDIO_DTCTRL_TFREN_MASK            (0x01 << 0)
#define SDIO_DTCTRL_TFREN_SHIFT           (0)
#define SDIO_DTCTRL_TFREN(x)              (x << 0)
#define SDIO_DTCTRL_TFRDIR_MASK           (0x01 << 1)
#define SDIO_DTCTRL_TFRDIR_SHIFT          (1)
#define SDIO_DTCTRL_TFRDIR(x)             (x << 1)
#define SDIO_DTCTRL_TFRMODE_MASK          (0x01 << 2)
#define SDIO_DTCTRL_TFRMODE_SHIFT         (2)
#define SDIO_DTCTRL_TFRMODE(x)            (x << 2)
#define SDIO_DTCTRL_DMAEN_MASK            (0x01 << 3)
#define SDIO_DTCTRL_DMAEN_SHIFT           (3)
#define SDIO_DTCTRL_DMAEN(x)              (x << 3)
#define SDIO_DTCTRL_BLKSIZE_MASK          (0x0f << 4)
#define SDIO_DTCTRL_BLKSIZE_SHIFT         (4)
#define SDIO_DTCTRL_BLKSIZE(x)            (x << 4)
#define SDIO_DTCTRL_RDWTSTART_MASK        (0x01 << 8)
#define SDIO_DTCTRL_RDWTSTART_SHIFT       (8)
#define SDIO_DTCTRL_RDWTSTART(x)          (x << 8)
#define SDIO_DTCTRL_RDWTSTOP_MASK         (0x01 << 9)
#define SDIO_DTCTRL_RDWTSTOP_SHIFT        (9)
#define SDIO_DTCTRL_RDWTSTOP(x)           (x << 9)
#define SDIO_DTCTRL_RDWTMODE_MASK         (0x01 << 10)
#define SDIO_DTCTRL_RDWTMODE_SHIFT        (10)
#define SDIO_DTCTRL_RDWTMODE(x)           (x << 10)
#define SDIO_DTCTRL_IOEN_MASK             (0x01 << 11)
#define SDIO_DTCTRL_IOEN_SHIFT            (11)
#define SDIO_DTCTRL_IOEN(x)               (x << 11)
#define SDIO_DTCNT_CNT_MASK               (0x1ffffff << 0)
#define SDIO_DTCNT_CNT_SHIFT              (0)
#define SDIO_DTCNT_CNT(x)                 (x << 0)
#define SDIO_STS_CMDFAIL_MASK             (0x01 << 0)
#define SDIO_STS_CMDFAIL_SHIFT            (0)
#define SDIO_STS_CMDFAIL(x)               (x << 0)
#define SDIO_STS_DTFAIL_MASK              (0x01 << 1)
#define SDIO_STS_DTFAIL_SHIFT             (1)
#define SDIO_STS_DTFAIL(x)                (x << 1)
#define SDIO_STS_CMDTIMEOUT_MASK          (0x01 << 2)
#define SDIO_STS_CMDTIMEOUT_SHIFT         (2)
#define SDIO_STS_CMDTIMEOUT(x)            (x << 2)
#define SDIO_STS_DTTIMEOUT_MASK           (0x01 << 3)
#define SDIO_STS_DTTIMEOUT_SHIFT          (3)
#define SDIO_STS_DTTIMEOUT(x)             (x << 3)
#define SDIO_STS_TXERRU_MASK              (0x01 << 4)
#define SDIO_STS_TXERRU_SHIFT             (4)
#define SDIO_STS_TXERRU(x)                (x << 4)
#define SDIO_STS_RXERRO_MASK              (0x01 << 5)
#define SDIO_STS_RXERRO_SHIFT             (5)
#define SDIO_STS_RXERRO(x)                (x << 5)
#define SDIO_STS_CMDRSPCMPL_MASK          (0x01 << 6)
#define SDIO_STS_CMDRSPCMPL_SHIFT         (6)
#define SDIO_STS_CMDRSPCMPL(x)            (x << 6)
#define SDIO_STS_CMDCMPL_MASK             (0x01 << 7)
#define SDIO_STS_CMDCMPL_SHIFT            (7)
#define SDIO_STS_CMDCMPL(x)               (x << 7)
#define SDIO_STS_DTCMPL_MASK              (0x01 << 8)
#define SDIO_STS_DTCMPL_SHIFT             (8)
#define SDIO_STS_DTCMPL(x)                (x << 8)
#define SDIO_STS_SBITERR_MASK             (0x01 << 9)
#define SDIO_STS_SBITERR_SHIFT            (9)
#define SDIO_STS_SBITERR(x)               (x << 9)
#define SDIO_STS_DTBLKCMPL_MASK           (0x01 << 10)
#define SDIO_STS_DTBLKCMPL_SHIFT          (10)
#define SDIO_STS_DTBLKCMPL(x)             (x << 10)
#define SDIO_STS_DOCMD_MASK               (0x01 << 11)
#define SDIO_STS_DOCMD_SHIFT              (11)
#define SDIO_STS_DOCMD(x)                 (x << 11)
#define SDIO_STS_DOTX_MASK                (0x01 << 12)
#define SDIO_STS_DOTX_SHIFT               (12)
#define SDIO_STS_DOTX(x)                  (x << 12)
#define SDIO_STS_DORX_MASK                (0x01 << 13)
#define SDIO_STS_DORX_SHIFT               (13)
#define SDIO_STS_DORX(x)                  (x << 13)
#define SDIO_STS_TXBUFH_MASK              (0x01 << 14)
#define SDIO_STS_TXBUFH_SHIFT             (14)
#define SDIO_STS_TXBUFH(x)                (x << 14)
#define SDIO_STS_RXBUFH_MASK              (0x01 << 15)
#define SDIO_STS_RXBUFH_SHIFT             (15)
#define SDIO_STS_RXBUFH(x)                (x << 15)
#define SDIO_STS_TXBUFF_MASK              (0x01 << 16)
#define SDIO_STS_TXBUFF_SHIFT             (16)
#define SDIO_STS_TXBUFF(x)                (x << 16)
#define SDIO_STS_RXBUFF_MASK              (0x01 << 17)
#define SDIO_STS_RXBUFF_SHIFT             (17)
#define SDIO_STS_RXBUFF(x)                (x << 17)
#define SDIO_STS_TXBUFE_MASK              (0x01 << 18)
#define SDIO_STS_TXBUFE_SHIFT             (18)
#define SDIO_STS_TXBUFE(x)                (x << 18)
#define SDIO_STS_RXBUFE_MASK              (0x01 << 19)
#define SDIO_STS_RXBUFE_SHIFT             (19)
#define SDIO_STS_RXBUFE(x)                (x << 19)
#define SDIO_STS_TXBUF_MASK               (0x01 << 20)
#define SDIO_STS_TXBUF_SHIFT              (20)
#define SDIO_STS_TXBUF(x)                 (x << 20)
#define SDIO_STS_RXBUF_MASK               (0x01 << 21)
#define SDIO_STS_RXBUF_SHIFT              (21)
#define SDIO_STS_RXBUF(x)                 (x << 21)
#define SDIO_STS_IOIF_MASK                (0x01 << 22)
#define SDIO_STS_IOIF_SHIFT               (22)
#define SDIO_STS_IOIF(x)                  (x << 22)
#define SDIO_INTCLR_CMDFAIL_MASK          (0x01 << 0)
#define SDIO_INTCLR_CMDFAIL_SHIFT         (0)
#define SDIO_INTCLR_CMDFAIL(x)            (x << 0)
#define SDIO_INTCLR_DTFAIL_MASK           (0x01 << 1)
#define SDIO_INTCLR_DTFAIL_SHIFT          (1)
#define SDIO_INTCLR_DTFAIL(x)             (x << 1)
#define SDIO_INTCLR_CMDTIMEOUT_MASK       (0x01 << 2)
#define SDIO_INTCLR_CMDTIMEOUT_SHIFT      (2)
#define SDIO_INTCLR_CMDTIMEOUT(x)         (x << 2)
#define SDIO_INTCLR_DTTIMEOUT_MASK        (0x01 << 3)
#define SDIO_INTCLR_DTTIMEOUT_SHIFT       (3)
#define SDIO_INTCLR_DTTIMEOUT(x)          (x << 3)
#define SDIO_INTCLR_TXERRU_MASK           (0x01 << 4)
#define SDIO_INTCLR_TXERRU_SHIFT          (4)
#define SDIO_INTCLR_TXERRU(x)             (x << 4)
#define SDIO_INTCLR_RXERRU_MASK           (0x01 << 5)
#define SDIO_INTCLR_RXERRU_SHIFT          (5)
#define SDIO_INTCLR_RXERRU(x)             (x << 5)
#define SDIO_INTCLR_CMDRSPCMPL_MASK       (0x01 << 6)
#define SDIO_INTCLR_CMDRSPCMPL_SHIFT      (6)
#define SDIO_INTCLR_CMDRSPCMPL(x)         (x << 6)
#define SDIO_INTCLR_CMDCMPL_MASK          (0x01 << 7)
#define SDIO_INTCLR_CMDCMPL_SHIFT         (7)
#define SDIO_INTCLR_CMDCMPL(x)            (x << 7)
#define SDIO_INTCLR_DTCMPL_MASK           (0x01 << 8)
#define SDIO_INTCLR_DTCMPL_SHIFT          (8)
#define SDIO_INTCLR_DTCMPL(x)             (x << 8)
#define SDIO_INTCLR_SBITERR_MASK          (0x01 << 9)
#define SDIO_INTCLR_SBITERR_SHIFT         (9)
#define SDIO_INTCLR_SBITERR(x)            (x << 9)
#define SDIO_INTCLR_DTBLKCMPL_MASK        (0x01 << 10)
#define SDIO_INTCLR_DTBLKCMPL_SHIFT       (10)
#define SDIO_INTCLR_DTBLKCMPL(x)          (x << 10)
#define SDIO_INTCLR_IOIF_MASK             (0x01 << 22)
#define SDIO_INTCLR_IOIF_SHIFT            (22)
#define SDIO_INTCLR_IOIF(x)               (x << 22)
#define SDIO_INTEN_CMDFAILIEN_MASK        (0x01 << 0)
#define SDIO_INTEN_CMDFAILIEN_SHIFT       (0)
#define SDIO_INTEN_CMDFAILIEN(x)          (x << 0)
#define SDIO_INTEN_DTFAILIEN_MASK         (0x01 << 1)
#define SDIO_INTEN_DTFAILIEN_SHIFT        (1)
#define SDIO_INTEN_DTFAILIEN(x)           (x << 1)
#define SDIO_INTEN_CMDTIMEOUTIEN_MASK     (0x01 << 2)
#define SDIO_INTEN_CMDTIMEOUTIEN_SHIFT    (2)
#define SDIO_INTEN_CMDTIMEOUTIEN(x)       (x << 2)
#define SDIO_INTEN_DTTIMEOUTIEN_MASK      (0x01 << 3)
#define SDIO_INTEN_DTTIMEOUTIEN_SHIFT     (3)
#define SDIO_INTEN_DTTIMEOUTIEN(x)        (x << 3)
#define SDIO_INTEN_TXERRUIEN_MASK         (0x01 << 4)
#define SDIO_INTEN_TXERRUIEN_SHIFT        (4)
#define SDIO_INTEN_TXERRUIEN(x)           (x << 4)
#define SDIO_INTEN_RXERRUIEN_MASK         (0x01 << 5)
#define SDIO_INTEN_RXERRUIEN_SHIFT        (5)
#define SDIO_INTEN_RXERRUIEN(x)           (x << 5)
#define SDIO_INTEN_CMDRSPCMPLIEN_MASK     (0x01 << 6)
#define SDIO_INTEN_CMDRSPCMPLIEN_SHIFT    (6)
#define SDIO_INTEN_CMDRSPCMPLIEN(x)       (x << 6)
#define SDIO_INTEN_CMDCMPLIEN_MASK        (0x01 << 7)
#define SDIO_INTEN_CMDCMPLIEN_SHIFT       (7)
#define SDIO_INTEN_CMDCMPLIEN(x)          (x << 7)
#define SDIO_INTEN_DTCMPLIEN_MASK         (0x01 << 8)
#define SDIO_INTEN_DTCMPLIEN_SHIFT        (8)
#define SDIO_INTEN_DTCMPLIEN(x)           (x << 8)
#define SDIO_INTEN_SBITERRIEN_MASK        (0x01 << 9)
#define SDIO_INTEN_SBITERRIEN_SHIFT       (9)
#define SDIO_INTEN_SBITERRIEN(x)          (x << 9)
#define SDIO_INTEN_DTBLKCMPLIEN_MASK      (0x01 << 10)
#define SDIO_INTEN_DTBLKCMPLIEN_SHIFT     (10)
#define SDIO_INTEN_DTBLKCMPLIEN(x)        (x << 10)
#define SDIO_INTEN_DOCMDIEN_MASK          (0x01 << 11)
#define SDIO_INTEN_DOCMDIEN_SHIFT         (11)
#define SDIO_INTEN_DOCMDIEN(x)            (x << 11)
#define SDIO_INTEN_DOTXIEN_MASK           (0x01 << 12)
#define SDIO_INTEN_DOTXIEN_SHIFT          (12)
#define SDIO_INTEN_DOTXIEN(x)             (x << 12)
#define SDIO_INTEN_DORXIEN_MASK           (0x01 << 13)
#define SDIO_INTEN_DORXIEN_SHIFT          (13)
#define SDIO_INTEN_DORXIEN(x)             (x << 13)
#define SDIO_INTEN_TXBUFHIEN_MASK         (0x01 << 14)
#define SDIO_INTEN_TXBUFHIEN_SHIFT        (14)
#define SDIO_INTEN_TXBUFHIEN(x)           (x << 14)
#define SDIO_INTEN_RXBUFHIEN_MASK         (0x01 << 15)
#define SDIO_INTEN_RXBUFHIEN_SHIFT        (15)
#define SDIO_INTEN_RXBUFHIEN(x)           (x << 15)
#define SDIO_INTEN_TXBUFFIEN_MASK         (0x01 << 16)
#define SDIO_INTEN_TXBUFFIEN_SHIFT        (16)
#define SDIO_INTEN_TXBUFFIEN(x)           (x << 16)
#define SDIO_INTEN_RXBUFFIEN_MASK         (0x01 << 17)
#define SDIO_INTEN_RXBUFFIEN_SHIFT        (17)
#define SDIO_INTEN_RXBUFFIEN(x)           (x << 17)
#define SDIO_INTEN_TXBUFEIEN_MASK         (0x01 << 18)
#define SDIO_INTEN_TXBUFEIEN_SHIFT        (18)
#define SDIO_INTEN_TXBUFEIEN(x)           (x << 18)
#define SDIO_INTEN_RXBUFEIEN_MASK         (0x01 << 19)
#define SDIO_INTEN_RXBUFEIEN_SHIFT        (19)
#define SDIO_INTEN_RXBUFEIEN(x)           (x << 19)
#define SDIO_INTEN_TXBUFIEN_MASK          (0x01 << 20)
#define SDIO_INTEN_TXBUFIEN_SHIFT         (20)
#define SDIO_INTEN_TXBUFIEN(x)            (x << 20)
#define SDIO_INTEN_RXBUFIEN_MASK          (0x01 << 21)
#define SDIO_INTEN_RXBUFIEN_SHIFT         (21)
#define SDIO_INTEN_RXBUFIEN(x)            (x << 21)
#define SDIO_INTEN_IOIFIEN_MASK           (0x01 << 22)
#define SDIO_INTEN_IOIFIEN_SHIFT          (22)
#define SDIO_INTEN_IOIFIEN(x)             (x << 22)
#define SDIO_BUFCNT_CNT_MASK              (0xffffff << 0)
#define SDIO_BUFCNT_CNT_SHIFT             (0)
#define SDIO_BUFCNT_CNT(x)                (x << 0)
#define SDIO_BUF_DT_MASK                  (0xffffffff << 0)
#define SDIO_BUF_DT_SHIFT                 (0)
#define SDIO_BUF_DT(x)                    (x << 0)

/* RTC - Real time clock */
#define RTC_CTRLH_OVFIEN_MASK             (0x01 << 0)
#define RTC_CTRLH_OVFIEN_SHIFT            (0)
#define RTC_CTRLH_OVFIEN(x)               (x << 0)
#define RTC_CTRLH_TAIEN_MASK              (0x01 << 1)
#define RTC_CTRLH_TAIEN_SHIFT             (1)
#define RTC_CTRLH_TAIEN(x)                (x << 1)
#define RTC_CTRLH_TSIEN_MASK              (0x01 << 2)
#define RTC_CTRLH_TSIEN_SHIFT             (2)
#define RTC_CTRLH_TSIEN(x)                (x << 2)
#define RTC_CTRLL_TSF_MASK                (0x01 << 0)
#define RTC_CTRLL_TSF_SHIFT               (0)
#define RTC_CTRLL_TSF(x)                  (x << 0)
#define RTC_CTRLL_TAF_MASK                (0x01 << 1)
#define RTC_CTRLL_TAF_SHIFT               (1)
#define RTC_CTRLL_TAF(x)                  (x << 1)
#define RTC_CTRLL_OVFF_MASK               (0x01 << 2)
#define RTC_CTRLL_OVFF_SHIFT              (2)
#define RTC_CTRLL_OVFF(x)                 (x << 2)
#define RTC_CTRLL_UPDF_MASK               (0x01 << 3)
#define RTC_CTRLL_UPDF_SHIFT              (3)
#define RTC_CTRLL_UPDF(x)                 (x << 3)
#define RTC_CTRLL_CFGEN_MASK              (0x01 << 4)
#define RTC_CTRLL_CFGEN_SHIFT             (4)
#define RTC_CTRLL_CFGEN(x)                (x << 4)
#define RTC_CTRLL_CFGF_MASK               (0x01 << 5)
#define RTC_CTRLL_CFGF_SHIFT              (5)
#define RTC_CTRLL_CFGF(x)                 (x << 5)
#define RTC_DIVH_DIV_MASK                 (0x0f << 0)
#define RTC_DIVH_DIV_SHIFT                (0)
#define RTC_DIVH_DIV(x)                   (x << 0)
#define RTC_DIVL_DIV_MASK                 (0xffff << 0)
#define RTC_DIVL_DIV_SHIFT                (0)
#define RTC_DIVL_DIV(x)                   (x << 0)
#define RTC_DIVCNTH_DIVCNT_MASK           (0x0f << 0)
#define RTC_DIVCNTH_DIVCNT_SHIFT          (0)
#define RTC_DIVCNTH_DIVCNT(x)             (x << 0)
#define RTC_DIVCNTL_DIVCNT_MASK           (0xffff << 0)
#define RTC_DIVCNTL_DIVCNT_SHIFT          (0)
#define RTC_DIVCNTL_DIVCNT(x)             (x << 0)
#define RTC_CNTH_CNT_MASK                 (0xffff << 0)
#define RTC_CNTH_CNT_SHIFT                (0)
#define RTC_CNTH_CNT(x)                   (x << 0)
#define RTC_CNTL_CNT_MASK                 (0xffff << 0)
#define RTC_CNTL_CNT_SHIFT                (0)
#define RTC_CNTL_CNT(x)                   (x << 0)
#define RTC_TAH_TA_MASK                   (0xffff << 0)
#define RTC_TAH_TA_SHIFT                  (0)
#define RTC_TAH_TA(x)                     (x << 0)
#define RTC_TAL_TA_MASK                   (0xffff << 0)
#define RTC_TAL_TA_SHIFT                  (0)
#define RTC_TAL_TA(x)                     (x << 0)

