eeucalyptus/at32f403a_minimal/at32f403a.h
/* BPR - Battery powered register */
#define BPR_DT1_DT1_MASK                  (0xffff << 0)
#define BPR_DT1_DT1_SHIFT                 (0)
#define BPR_DT1_DT1(x)                    (x << 0)
#define BPR_DT2_DT2_MASK                  (0xffff << 0)
#define BPR_DT2_DT2_SHIFT                 (0)
#define BPR_DT2_DT2(x)                    (x << 0)
#define BPR_DT3_DT3_MASK                  (0xffff << 0)
#define BPR_DT3_DT3_SHIFT                 (0)
#define BPR_DT3_DT3(x)                    (x << 0)
#define BPR_DT4_DT4_MASK                  (0xffff << 0)
#define BPR_DT4_DT4_SHIFT                 (0)
#define BPR_DT4_DT4(x)                    (x << 0)
#define BPR_DT5_DT5_MASK                  (0xffff << 0)
#define BPR_DT5_DT5_SHIFT                 (0)
#define BPR_DT5_DT5(x)                    (x << 0)
#define BPR_DT6_DT6_MASK                  (0xffff << 0)
#define BPR_DT6_DT6_SHIFT                 (0)
#define BPR_DT6_DT6(x)                    (x << 0)
#define BPR_DT7_DT7_MASK                  (0xffff << 0)
#define BPR_DT7_DT7_SHIFT                 (0)
#define BPR_DT7_DT7(x)                    (x << 0)
#define BPR_DT8_DT8_MASK                  (0xffff << 0)
#define BPR_DT8_DT8_SHIFT                 (0)
#define BPR_DT8_DT8(x)                    (x << 0)
#define BPR_DT9_DT9_MASK                  (0xffff << 0)
#define BPR_DT9_DT9_SHIFT                 (0)
#define BPR_DT9_DT9(x)                    (x << 0)
#define BPR_DT10_DT10_MASK                (0xffff << 0)
#define BPR_DT10_DT10_SHIFT               (0)
#define BPR_DT10_DT10(x)                  (x << 0)
#define BPR_DT11_DT11_MASK                (0xffff << 0)
#define BPR_DT11_DT11_SHIFT               (0)
#define BPR_DT11_DT11(x)                  (x << 0)
#define BPR_DT12_DT12_MASK                (0xffff << 0)
#define BPR_DT12_DT12_SHIFT               (0)
#define BPR_DT12_DT12(x)                  (x << 0)
#define BPR_DT13_DT13_MASK                (0xffff << 0)
#define BPR_DT13_DT13_SHIFT               (0)
#define BPR_DT13_DT13(x)                  (x << 0)
#define BPR_DT14_DT14_MASK                (0xffff << 0)
#define BPR_DT14_DT14_SHIFT               (0)
#define BPR_DT14_DT14(x)                  (x << 0)
#define BPR_DT15_DT15_MASK                (0xffff << 0)
#define BPR_DT15_DT15_SHIFT               (0)
#define BPR_DT15_DT15(x)                  (x << 0)
#define BPR_DT16_DT16_MASK                (0xffff << 0)
#define BPR_DT16_DT16_SHIFT               (0)
#define BPR_DT16_DT16(x)                  (x << 0)
#define BPR_DT17_DT17_MASK                (0xffff << 0)
#define BPR_DT17_DT17_SHIFT               (0)
#define BPR_DT17_DT17(x)                  (x << 0)
#define BPR_DT18_DT18_MASK                (0xffff << 0)
#define BPR_DT18_DT18_SHIFT               (0)
#define BPR_DT18_DT18(x)                  (x << 0)
#define BPR_DT19_DT19_MASK                (0xffff << 0)
#define BPR_DT19_DT19_SHIFT               (0)
#define BPR_DT19_DT19(x)                  (x << 0)
#define BPR_DT20_DT20_MASK                (0xffff << 0)
#define BPR_DT20_DT20_SHIFT               (0)
#define BPR_DT20_DT20(x)                  (x << 0)
#define BPR_DT21_DT21_MASK                (0xffff << 0)
#define BPR_DT21_DT21_SHIFT               (0)
#define BPR_DT21_DT21(x)                  (x << 0)
#define BPR_DT22_DT22_MASK                (0xffff << 0)
#define BPR_DT22_DT22_SHIFT               (0)
#define BPR_DT22_DT22(x)                  (x << 0)
#define BPR_DT23_DT23_MASK                (0xffff << 0)
#define BPR_DT23_DT23_SHIFT               (0)
#define BPR_DT23_DT23(x)                  (x << 0)
#define BPR_DT24_DT24_MASK                (0xffff << 0)
#define BPR_DT24_DT24_SHIFT               (0)
#define BPR_DT24_DT24(x)                  (x << 0)
#define BPR_DT25_DT25_MASK                (0xffff << 0)
#define BPR_DT25_DT25_SHIFT               (0)
#define BPR_DT25_DT25(x)                  (x << 0)
#define BPR_DT26_DT26_MASK                (0xffff << 0)
#define BPR_DT26_DT26_SHIFT               (0)
#define BPR_DT26_DT26(x)                  (x << 0)
#define BPR_DT27_DT27_MASK                (0xffff << 0)
#define BPR_DT27_DT27_SHIFT               (0)
#define BPR_DT27_DT27(x)                  (x << 0)
#define BPR_DT28_DT28_MASK                (0xffff << 0)
#define BPR_DT28_DT28_SHIFT               (0)
#define BPR_DT28_DT28(x)                  (x << 0)
#define BPR_DT29_DT29_MASK                (0xffff << 0)
#define BPR_DT29_DT29_SHIFT               (0)
#define BPR_DT29_DT29(x)                  (x << 0)
#define BPR_DT30_DT30_MASK                (0xffff << 0)
#define BPR_DT30_DT30_SHIFT               (0)
#define BPR_DT30_DT30(x)                  (x << 0)
#define BPR_DT31_DT31_MASK                (0xffff << 0)
#define BPR_DT31_DT31_SHIFT               (0)
#define BPR_DT31_DT31(x)                  (x << 0)
#define BPR_DT32_DT32_MASK                (0xffff << 0)
#define BPR_DT32_DT32_SHIFT               (0)
#define BPR_DT32_DT32(x)                  (x << 0)
#define BPR_DT33_DT33_MASK                (0xffff << 0)
#define BPR_DT33_DT33_SHIFT               (0)
#define BPR_DT33_DT33(x)                  (x << 0)
#define BPR_DT34_DT34_MASK                (0xffff << 0)
#define BPR_DT34_DT34_SHIFT               (0)
#define BPR_DT34_DT34(x)                  (x << 0)
#define BPR_DT35_DT35_MASK                (0xffff << 0)
#define BPR_DT35_DT35_SHIFT               (0)
#define BPR_DT35_DT35(x)                  (x << 0)
#define BPR_DT36_DT36_MASK                (0xffff << 0)
#define BPR_DT36_DT36_SHIFT               (0)
#define BPR_DT36_DT36(x)                  (x << 0)
#define BPR_DT37_DT37_MASK                (0xffff << 0)
#define BPR_DT37_DT37_SHIFT               (0)
#define BPR_DT37_DT37(x)                  (x << 0)
#define BPR_DT38_DT38_MASK                (0xffff << 0)
#define BPR_DT38_DT38_SHIFT               (0)
#define BPR_DT38_DT38(x)                  (x << 0)
#define BPR_DT39_DT39_MASK                (0xffff << 0)
#define BPR_DT39_DT39_SHIFT               (0)
#define BPR_DT39_DT39(x)                  (x << 0)
#define BPR_DT40_DT40_MASK                (0xffff << 0)
#define BPR_DT40_DT40_SHIFT               (0)
#define BPR_DT40_DT40(x)                  (x << 0)
#define BPR_DT41_DT41_MASK                (0xffff << 0)
#define BPR_DT41_DT41_SHIFT               (0)
#define BPR_DT41_DT41(x)                  (x << 0)
#define BPR_DT42_DT42_MASK                (0xffff << 0)
#define BPR_DT42_DT42_SHIFT               (0)
#define BPR_DT42_DT42(x)                  (x << 0)
#define BPR_RTCCAL_CALVAL_MASK            (0x7f << 0)
#define BPR_RTCCAL_CALVAL_SHIFT           (0)
#define BPR_RTCCAL_CALVAL(x)              (x << 0)
#define BPR_RTCCAL_CALOUT_MASK            (0x01 << 7)
#define BPR_RTCCAL_CALOUT_SHIFT           (7)
#define BPR_RTCCAL_CALOUT(x)              (x << 7)
#define BPR_RTCCAL_OUTEN_MASK             (0x01 << 8)
#define BPR_RTCCAL_OUTEN_SHIFT            (8)
#define BPR_RTCCAL_OUTEN(x)               (x << 8)
#define BPR_RTCCAL_OUTSEL_MASK            (0x01 << 9)
#define BPR_RTCCAL_OUTSEL_SHIFT           (9)
#define BPR_RTCCAL_OUTSEL(x)              (x << 9)
#define BPR_RTCCAL_CCOS_MASK              (0x01 << 10)
#define BPR_RTCCAL_CCOS_SHIFT             (10)
#define BPR_RTCCAL_CCOS(x)                (x << 10)
#define BPR_RTCCAL_OUTM_MASK              (0x01 << 11)
#define BPR_RTCCAL_OUTM_SHIFT             (11)
#define BPR_RTCCAL_OUTM(x)                (x << 11)
#define BPR_CTRL_TPEN_MASK                (0x01 << 0)
#define BPR_CTRL_TPEN_SHIFT               (0)
#define BPR_CTRL_TPEN(x)                  (x << 0)
#define BPR_CTRL_TPP_MASK                 (0x01 << 1)
#define BPR_CTRL_TPP_SHIFT                (1)
#define BPR_CTRL_TPP(x)                   (x << 1)
#define BPR_CTRLSTS_TPEFCLR_MASK          (0x01 << 0)
#define BPR_CTRLSTS_TPEFCLR_SHIFT         (0)
#define BPR_CTRLSTS_TPEFCLR(x)            (x << 0)
#define BPR_CTRLSTS_TPIFCLR_MASK          (0x01 << 1)
#define BPR_CTRLSTS_TPIFCLR_SHIFT         (1)
#define BPR_CTRLSTS_TPIFCLR(x)            (x << 1)
#define BPR_CTRLSTS_TPIEN_MASK            (0x01 << 2)
#define BPR_CTRLSTS_TPIEN_SHIFT           (2)
#define BPR_CTRLSTS_TPIEN(x)              (x << 2)
#define BPR_CTRLSTS_TPEF_MASK             (0x01 << 8)
#define BPR_CTRLSTS_TPEF_SHIFT            (8)
#define BPR_CTRLSTS_TPEF(x)               (x << 8)
#define BPR_CTRLSTS_TPIF_MASK             (0x01 << 9)
#define BPR_CTRLSTS_TPIF_SHIFT            (9)
#define BPR_CTRLSTS_TPIF(x)               (x << 9)

/* WDT - Watchdog */
#define WDT_CMD_CMD_MASK                  (0xffff << 0)
#define WDT_CMD_CMD_SHIFT                 (0)
#define WDT_CMD_CMD(x)                    (x << 0)
#define WDT_DIV_DIV_MASK                  (0x07 << 0)
#define WDT_DIV_DIV_SHIFT                 (0)
#define WDT_DIV_DIV(x)                    (x << 0)
#define WDT_RLD_RLD_MASK                  (0xfff << 0)
#define WDT_RLD_RLD_SHIFT                 (0)
#define WDT_RLD_RLD(x)                    (x << 0)
#define WDT_STS_DIVF_MASK                 (0x01 << 0)
#define WDT_STS_DIVF_SHIFT                (0)
#define WDT_STS_DIVF(x)                   (x << 0)
#define WDT_STS_RLDF_MASK                 (0x01 << 1)
#define WDT_STS_RLDF_SHIFT                (1)
#define WDT_STS_RLDF(x)                   (x << 1)

