eeucalyptus/at32f403a_minimal/at32f403a.h
/* WWDT - Window watchdog */
#define WWDT_CTRL_CNT_MASK                (0x7f << 0)
#define WWDT_CTRL_CNT_SHIFT               (0)
#define WWDT_CTRL_CNT(x)                  (x << 0)
#define WWDT_CTRL_WWDTEN_MASK             (0x01 << 7)
#define WWDT_CTRL_WWDTEN_SHIFT            (7)
#define WWDT_CTRL_WWDTEN(x)               (x << 7)
#define WWDT_CFG_WIN_MASK                 (0x7f << 0)
#define WWDT_CFG_WIN_SHIFT                (0)
#define WWDT_CFG_WIN(x)                   (x << 0)
#define WWDT_CFG_DIV_MASK                 (0x03 << 7)
#define WWDT_CFG_DIV_SHIFT                (7)
#define WWDT_CFG_DIV(x)                   (x << 7)
#define WWDT_CFG_RLDIEN_MASK              (0x01 << 9)
#define WWDT_CFG_RLDIEN_SHIFT             (9)
#define WWDT_CFG_RLDIEN(x)                (x << 9)
#define WWDT_STS_RLDF_MASK                (0x01 << 0)
#define WWDT_STS_RLDF_SHIFT               (0)
#define WWDT_STS_RLDF(x)                  (x << 0)

/* TMR1 - Advanced timer */
#define TMR_CTRL1_CLKDIV_MASK             (0x03 << 8)
#define TMR_CTRL1_CLKDIV_SHIFT            (8)
#define TMR_CTRL1_CLKDIV(x)               (x << 8)
#define TMR_CTRL1_PRBEN_MASK              (0x01 << 7)
#define TMR_CTRL1_PRBEN_SHIFT             (7)
#define TMR_CTRL1_PRBEN(x)                (x << 7)
#define TMR_CTRL1_TWCMSEL_MASK            (0x03 << 5)
#define TMR_CTRL1_TWCMSEL_SHIFT           (5)
#define TMR_CTRL1_TWCMSEL(x)              (x << 5)
#define TMR_CTRL1_OWCDIR_MASK             (0x01 << 4)
#define TMR_CTRL1_OWCDIR_SHIFT            (4)
#define TMR_CTRL1_OWCDIR(x)               (x << 4)
#define TMR_CTRL1_OCMEN_MASK              (0x01 << 3)
#define TMR_CTRL1_OCMEN_SHIFT             (3)
#define TMR_CTRL1_OCMEN(x)                (x << 3)
#define TMR_CTRL1_OVFS_MASK               (0x01 << 2)
#define TMR_CTRL1_OVFS_SHIFT              (2)
#define TMR_CTRL1_OVFS(x)                 (x << 2)
#define TMR_CTRL1_OVFEN_MASK              (0x01 << 1)
#define TMR_CTRL1_OVFEN_SHIFT             (1)
#define TMR_CTRL1_OVFEN(x)                (x << 1)
#define TMR_CTRL1_TMREN_MASK              (0x01 << 0)
#define TMR_CTRL1_TMREN_SHIFT             (0)
#define TMR_CTRL1_TMREN(x)                (x << 0)
#define TMR_CTRL2_C4IOS_MASK              (0x01 << 14)
#define TMR_CTRL2_C4IOS_SHIFT             (14)
#define TMR_CTRL2_C4IOS(x)                (x << 14)
#define TMR_CTRL2_C3CIOS_MASK             (0x01 << 13)
#define TMR_CTRL2_C3CIOS_SHIFT            (13)
#define TMR_CTRL2_C3CIOS(x)               (x << 13)
#define TMR_CTRL2_C3IOS_MASK              (0x01 << 12)
#define TMR_CTRL2_C3IOS_SHIFT             (12)
#define TMR_CTRL2_C3IOS(x)                (x << 12)
#define TMR_CTRL2_C2CIOS_MASK             (0x01 << 11)
#define TMR_CTRL2_C2CIOS_SHIFT            (11)
#define TMR_CTRL2_C2CIOS(x)               (x << 11)
#define TMR_CTRL2_C2IOS_MASK              (0x01 << 10)
#define TMR_CTRL2_C2IOS_SHIFT             (10)
#define TMR_CTRL2_C2IOS(x)                (x << 10)
#define TMR_CTRL2_C1CIOS_MASK             (0x01 << 9)
#define TMR_CTRL2_C1CIOS_SHIFT            (9)
#define TMR_CTRL2_C1CIOS(x)               (x << 9)
#define TMR_CTRL2_C1IOS_MASK              (0x01 << 8)
#define TMR_CTRL2_C1IOS_SHIFT             (8)
#define TMR_CTRL2_C1IOS(x)                (x << 8)
#define TMR_CTRL2_C1INSEL_MASK            (0x01 << 7)
#define TMR_CTRL2_C1INSEL_SHIFT           (7)
#define TMR_CTRL2_C1INSEL(x)              (x << 7)
#define TMR_CTRL2_PTOS_MASK               (0x07 << 4)
#define TMR_CTRL2_PTOS_SHIFT              (4)
#define TMR_CTRL2_PTOS(x)                 (x << 4)
#define TMR_CTRL2_DRS_MASK                (0x01 << 3)
#define TMR_CTRL2_DRS_SHIFT               (3)
#define TMR_CTRL2_DRS(x)                  (x << 3)
#define TMR_CTRL2_CCFS_MASK               (0x01 << 2)
#define TMR_CTRL2_CCFS_SHIFT              (2)
#define TMR_CTRL2_CCFS(x)                 (x << 2)
#define TMR_CTRL2_CBCTRL_MASK             (0x01 << 0)
#define TMR_CTRL2_CBCTRL_SHIFT            (0)
#define TMR_CTRL2_CBCTRL(x)               (x << 0)
#define TMR_STCTRL_ESP_MASK               (0x01 << 15)
#define TMR_STCTRL_ESP_SHIFT              (15)
#define TMR_STCTRL_ESP(x)                 (x << 15)
#define TMR_STCTRL_ECMBEN_MASK            (0x01 << 14)
#define TMR_STCTRL_ECMBEN_SHIFT           (14)
#define TMR_STCTRL_ECMBEN(x)              (x << 14)
#define TMR_STCTRL_ESDIV_MASK             (0x03 << 12)
#define TMR_STCTRL_ESDIV_SHIFT            (12)
#define TMR_STCTRL_ESDIV(x)               (x << 12)
#define TMR_STCTRL_ESF_MASK               (0x0f << 8)
#define TMR_STCTRL_ESF_SHIFT              (8)
#define TMR_STCTRL_ESF(x)                 (x << 8)
#define TMR_STCTRL_STS_MASK               (0x01 << 7)
#define TMR_STCTRL_STS_SHIFT              (7)
#define TMR_STCTRL_STS(x)                 (x << 7)
#define TMR_STCTRL_STIS_MASK              (0x07 << 4)
#define TMR_STCTRL_STIS_SHIFT             (4)
#define TMR_STCTRL_STIS(x)                (x << 4)
#define TMR_STCTRL_SMSEL_MASK             (0x07 << 0)
#define TMR_STCTRL_SMSEL_SHIFT            (0)
#define TMR_STCTRL_SMSEL(x)               (x << 0)
#define TMR_IDEN_TDEN_MASK                (0x01 << 14)
#define TMR_IDEN_TDEN_SHIFT               (14)
#define TMR_IDEN_TDEN(x)                  (x << 14)
#define TMR_IDEN_HALLDE_MASK              (0x01 << 13)
#define TMR_IDEN_HALLDE_SHIFT             (13)
#define TMR_IDEN_HALLDE(x)                (x << 13)
#define TMR_IDEN_C4DEN_MASK               (0x01 << 12)
#define TMR_IDEN_C4DEN_SHIFT              (12)
#define TMR_IDEN_C4DEN(x)                 (x << 12)
#define TMR_IDEN_C3DEN_MASK               (0x01 << 11)
#define TMR_IDEN_C3DEN_SHIFT              (11)
#define TMR_IDEN_C3DEN(x)                 (x << 11)
#define TMR_IDEN_C2DEN_MASK               (0x01 << 10)
#define TMR_IDEN_C2DEN_SHIFT              (10)
#define TMR_IDEN_C2DEN(x)                 (x << 10)
#define TMR_IDEN_C1DEN_MASK               (0x01 << 9)
#define TMR_IDEN_C1DEN_SHIFT              (9)
#define TMR_IDEN_C1DEN(x)                 (x << 9)
#define TMR_IDEN_OVFDEN_MASK              (0x01 << 8)
#define TMR_IDEN_OVFDEN_SHIFT             (8)
#define TMR_IDEN_OVFDEN(x)                (x << 8)
#define TMR_IDEN_BRKIE_MASK               (0x01 << 7)
#define TMR_IDEN_BRKIE_SHIFT              (7)
#define TMR_IDEN_BRKIE(x)                 (x << 7)
#define TMR_IDEN_TIEN_MASK                (0x01 << 6)
#define TMR_IDEN_TIEN_SHIFT               (6)
#define TMR_IDEN_TIEN(x)                  (x << 6)
#define TMR_IDEN_HALLIEN_MASK             (0x01 << 5)
#define TMR_IDEN_HALLIEN_SHIFT            (5)
#define TMR_IDEN_HALLIEN(x)               (x << 5)
#define TMR_IDEN_C4IEN_MASK               (0x01 << 4)
#define TMR_IDEN_C4IEN_SHIFT              (4)
#define TMR_IDEN_C4IEN(x)                 (x << 4)
#define TMR_IDEN_C3IEN_MASK               (0x01 << 3)
#define TMR_IDEN_C3IEN_SHIFT              (3)
#define TMR_IDEN_C3IEN(x)                 (x << 3)
#define TMR_IDEN_C2IEN_MASK               (0x01 << 2)
#define TMR_IDEN_C2IEN_SHIFT              (2)
#define TMR_IDEN_C2IEN(x)                 (x << 2)
#define TMR_IDEN_C1IEN_MASK               (0x01 << 1)
#define TMR_IDEN_C1IEN_SHIFT              (1)
#define TMR_IDEN_C1IEN(x)                 (x << 1)
#define TMR_IDEN_OVFIEN_MASK              (0x01 << 0)
#define TMR_IDEN_OVFIEN_SHIFT             (0)
#define TMR_IDEN_OVFIEN(x)                (x << 0)
#define TMR_ISTS_C4RF_MASK                (0x01 << 12)
#define TMR_ISTS_C4RF_SHIFT               (12)
#define TMR_ISTS_C4RF(x)                  (x << 12)
#define TMR_ISTS_C3RF_MASK                (0x01 << 11)
#define TMR_ISTS_C3RF_SHIFT               (11)
#define TMR_ISTS_C3RF(x)                  (x << 11)
#define TMR_ISTS_C2RF_MASK                (0x01 << 10)
#define TMR_ISTS_C2RF_SHIFT               (10)
#define TMR_ISTS_C2RF(x)                  (x << 10)
#define TMR_ISTS_C1RF_MASK                (0x01 << 9)
#define TMR_ISTS_C1RF_SHIFT               (9)
#define TMR_ISTS_C1RF(x)                  (x << 9)
#define TMR_ISTS_BRKIF_MASK               (0x01 << 7)
#define TMR_ISTS_BRKIF_SHIFT              (7)
#define TMR_ISTS_BRKIF(x)                 (x << 7)
#define TMR_ISTS_TRGIF_MASK               (0x01 << 6)
#define TMR_ISTS_TRGIF_SHIFT              (6)
#define TMR_ISTS_TRGIF(x)                 (x << 6)
#define TMR_ISTS_HALLIF_MASK              (0x01 << 5)
#define TMR_ISTS_HALLIF_SHIFT             (5)
#define TMR_ISTS_HALLIF(x)                (x << 5)
#define TMR_ISTS_C4IF_MASK                (0x01 << 4)
#define TMR_ISTS_C4IF_SHIFT               (4)
#define TMR_ISTS_C4IF(x)                  (x << 4)
#define TMR_ISTS_C3IF_MASK                (0x01 << 3)
#define TMR_ISTS_C3IF_SHIFT               (3)
#define TMR_ISTS_C3IF(x)                  (x << 3)
#define TMR_ISTS_C2IF_MASK                (0x01 << 2)
#define TMR_ISTS_C2IF_SHIFT               (2)
#define TMR_ISTS_C2IF(x)                  (x << 2)
#define TMR_ISTS_C1IF_MASK                (0x01 << 1)
#define TMR_ISTS_C1IF_SHIFT               (1)
#define TMR_ISTS_C1IF(x)                  (x << 1)
#define TMR_ISTS_OVFIF_MASK               (0x01 << 0)
#define TMR_ISTS_OVFIF_SHIFT              (0)
#define TMR_ISTS_OVFIF(x)                 (x << 0)
#define TMR_SWEVT_BRKSWTR_MASK            (0x01 << 7)
#define TMR_SWEVT_BRKSWTR_SHIFT           (7)
#define TMR_SWEVT_BRKSWTR(x)              (x << 7)
#define TMR_SWEVT_TRGSWTR_MASK            (0x01 << 6)
#define TMR_SWEVT_TRGSWTR_SHIFT           (6)
#define TMR_SWEVT_TRGSWTR(x)              (x << 6)
#define TMR_SWEVT_HALLSWTR_MASK           (0x01 << 5)
#define TMR_SWEVT_HALLSWTR_SHIFT          (5)
#define TMR_SWEVT_HALLSWTR(x)             (x << 5)
#define TMR_SWEVT_C4SWTR_MASK             (0x01 << 4)
#define TMR_SWEVT_C4SWTR_SHIFT            (4)
#define TMR_SWEVT_C4SWTR(x)               (x << 4)
#define TMR_SWEVT_C3SWTR_MASK             (0x01 << 3)
#define TMR_SWEVT_C3SWTR_SHIFT            (3)
#define TMR_SWEVT_C3SWTR(x)               (x << 3)
#define TMR_SWEVT_C2SWTR_MASK             (0x01 << 2)
#define TMR_SWEVT_C2SWTR_SHIFT            (2)
#define TMR_SWEVT_C2SWTR(x)               (x << 2)
#define TMR_SWEVT_C1SWTR_MASK             (0x01 << 1)
#define TMR_SWEVT_C1SWTR_SHIFT            (1)
#define TMR_SWEVT_C1SWTR(x)               (x << 1)
#define TMR_SWEVT_OVFSWTR_MASK            (0x01 << 0)
#define TMR_SWEVT_OVFSWTR_SHIFT           (0)
#define TMR_SWEVT_OVFSWTR(x)              (x << 0)
#define TMR_CM1_OUTPUT_C2OSEN_MASK        (0x01 << 15)
#define TMR_CM1_OUTPUT_C2OSEN_SHIFT       (15)
#define TMR_CM1_OUTPUT_C2OSEN(x)          (x << 15)
#define TMR_CM1_OUTPUT_C2OCTRL_MASK       (0x07 << 12)
#define TMR_CM1_OUTPUT_C2OCTRL_SHIFT      (12)
#define TMR_CM1_OUTPUT_C2OCTRL(x)         (x << 12)
#define TMR_CM1_OUTPUT_C2OBEN_MASK        (0x01 << 11)
#define TMR_CM1_OUTPUT_C2OBEN_SHIFT       (11)
#define TMR_CM1_OUTPUT_C2OBEN(x)          (x << 11)
#define TMR_CM1_OUTPUT_C2OIEN_MASK        (0x01 << 10)
#define TMR_CM1_OUTPUT_C2OIEN_SHIFT       (10)
#define TMR_CM1_OUTPUT_C2OIEN(x)          (x << 10)
#define TMR_CM1_OUTPUT_C2C_MASK           (0x03 << 8)
#define TMR_CM1_OUTPUT_C2C_SHIFT          (8)
#define TMR_CM1_OUTPUT_C2C(x)             (x << 8)
#define TMR_CM1_OUTPUT_C1OSEN_MASK        (0x01 << 7)
#define TMR_CM1_OUTPUT_C1OSEN_SHIFT       (7)
#define TMR_CM1_OUTPUT_C1OSEN(x)          (x << 7)
#define TMR_CM1_OUTPUT_C1OCTRL_MASK       (0x07 << 4)
#define TMR_CM1_OUTPUT_C1OCTRL_SHIFT      (4)
#define TMR_CM1_OUTPUT_C1OCTRL(x)         (x << 4)
#define TMR_CM1_OUTPUT_C1OBEN_MASK        (0x01 << 3)
#define TMR_CM1_OUTPUT_C1OBEN_SHIFT       (3)
#define TMR_CM1_OUTPUT_C1OBEN(x)          (x << 3)
#define TMR_CM1_OUTPUT_C1OIEN_MASK        (0x01 << 2)
#define TMR_CM1_OUTPUT_C1OIEN_SHIFT       (2)
#define TMR_CM1_OUTPUT_C1OIEN(x)          (x << 2)
#define TMR_CM1_OUTPUT_C1C_MASK           (0x03 << 0)
#define TMR_CM1_OUTPUT_C1C_SHIFT          (0)
#define TMR_CM1_OUTPUT_C1C(x)             (x << 0)
#define TMR_CM1_INPUT_C2DF_MASK           (0x0f << 12)
#define TMR_CM1_INPUT_C2DF_SHIFT          (12)
#define TMR_CM1_INPUT_C2DF(x)             (x << 12)
#define TMR_CM1_INPUT_C2IDIV_MASK         (0x03 << 10)
#define TMR_CM1_INPUT_C2IDIV_SHIFT        (10)
#define TMR_CM1_INPUT_C2IDIV(x)           (x << 10)
#define TMR_CM1_INPUT_C2C_MASK            (0x03 << 8)
#define TMR_CM1_INPUT_C2C_SHIFT           (8)
#define TMR_CM1_INPUT_C2C(x)              (x << 8)
#define TMR_CM1_INPUT_C1DF_MASK           (0x0f << 4)
#define TMR_CM1_INPUT_C1DF_SHIFT          (4)
#define TMR_CM1_INPUT_C1DF(x)             (x << 4)
#define TMR_CM1_INPUT_C1IDIV_MASK         (0x03 << 2)
#define TMR_CM1_INPUT_C1IDIV_SHIFT        (2)
#define TMR_CM1_INPUT_C1IDIV(x)           (x << 2)
#define TMR_CM1_INPUT_C1C_MASK            (0x03 << 0)
#define TMR_CM1_INPUT_C1C_SHIFT           (0)
#define TMR_CM1_INPUT_C1C(x)              (x << 0)
#define TMR_CM2_OUTPUT_C4OSEN_MASK        (0x01 << 15)
#define TMR_CM2_OUTPUT_C4OSEN_SHIFT       (15)
#define TMR_CM2_OUTPUT_C4OSEN(x)          (x << 15)
#define TMR_CM2_OUTPUT_C4OCTRL_MASK       (0x07 << 12)
#define TMR_CM2_OUTPUT_C4OCTRL_SHIFT      (12)
#define TMR_CM2_OUTPUT_C4OCTRL(x)         (x << 12)
#define TMR_CM2_OUTPUT_C4OBEN_MASK        (0x01 << 11)
#define TMR_CM2_OUTPUT_C4OBEN_SHIFT       (11)
#define TMR_CM2_OUTPUT_C4OBEN(x)          (x << 11)
#define TMR_CM2_OUTPUT_C4OIEN_MASK        (0x01 << 10)
#define TMR_CM2_OUTPUT_C4OIEN_SHIFT       (10)
#define TMR_CM2_OUTPUT_C4OIEN(x)          (x << 10)
#define TMR_CM2_OUTPUT_C4C_MASK           (0x03 << 8)
#define TMR_CM2_OUTPUT_C4C_SHIFT          (8)
#define TMR_CM2_OUTPUT_C4C(x)             (x << 8)
#define TMR_CM2_OUTPUT_C3OSEN_MASK        (0x01 << 7)
#define TMR_CM2_OUTPUT_C3OSEN_SHIFT       (7)
#define TMR_CM2_OUTPUT_C3OSEN(x)          (x << 7)
#define TMR_CM2_OUTPUT_C3OCTRL_MASK       (0x07 << 4)
#define TMR_CM2_OUTPUT_C3OCTRL_SHIFT      (4)
#define TMR_CM2_OUTPUT_C3OCTRL(x)         (x << 4)
#define TMR_CM2_OUTPUT_C3OBEN_MASK        (0x01 << 3)
#define TMR_CM2_OUTPUT_C3OBEN_SHIFT       (3)
#define TMR_CM2_OUTPUT_C3OBEN(x)          (x << 3)
#define TMR_CM2_OUTPUT_C3OIEN_MASK        (0x01 << 2)
#define TMR_CM2_OUTPUT_C3OIEN_SHIFT       (2)
#define TMR_CM2_OUTPUT_C3OIEN(x)          (x << 2)
#define TMR_CM2_OUTPUT_C3C_MASK           (0x03 << 0)
#define TMR_CM2_OUTPUT_C3C_SHIFT          (0)
#define TMR_CM2_OUTPUT_C3C(x)             (x << 0)
#define TMR_CM2_INPUT_C4DF_MASK           (0x0f << 12)
#define TMR_CM2_INPUT_C4DF_SHIFT          (12)
#define TMR_CM2_INPUT_C4DF(x)             (x << 12)
#define TMR_CM2_INPUT_C4IDIV_MASK         (0x03 << 10)
#define TMR_CM2_INPUT_C4IDIV_SHIFT        (10)
#define TMR_CM2_INPUT_C4IDIV(x)           (x << 10)
#define TMR_CM2_INPUT_C4C_MASK            (0x03 << 8)
#define TMR_CM2_INPUT_C4C_SHIFT           (8)
#define TMR_CM2_INPUT_C4C(x)              (x << 8)
#define TMR_CM2_INPUT_C3DF_MASK           (0x0f << 4)
#define TMR_CM2_INPUT_C3DF_SHIFT          (4)
#define TMR_CM2_INPUT_C3DF(x)             (x << 4)
#define TMR_CM2_INPUT_C3IDIV_MASK         (0x03 << 2)
#define TMR_CM2_INPUT_C3IDIV_SHIFT        (2)
#define TMR_CM2_INPUT_C3IDIV(x)           (x << 2)
#define TMR_CM2_INPUT_C3C_MASK            (0x03 << 0)
#define TMR_CM2_INPUT_C3C_SHIFT           (0)
#define TMR_CM2_INPUT_C3C(x)              (x << 0)
#define TMR_CCTRL_C4P_MASK                (0x01 << 13)
#define TMR_CCTRL_C4P_SHIFT               (13)
#define TMR_CCTRL_C4P(x)                  (x << 13)
#define TMR_CCTRL_C4EN_MASK               (0x01 << 12)
#define TMR_CCTRL_C4EN_SHIFT              (12)
#define TMR_CCTRL_C4EN(x)                 (x << 12)
#define TMR_CCTRL_C3CP_MASK               (0x01 << 11)
#define TMR_CCTRL_C3CP_SHIFT              (11)
#define TMR_CCTRL_C3CP(x)                 (x << 11)
#define TMR_CCTRL_C3CEN_MASK              (0x01 << 10)
#define TMR_CCTRL_C3CEN_SHIFT             (10)
#define TMR_CCTRL_C3CEN(x)                (x << 10)
#define TMR_CCTRL_C3P_MASK                (0x01 << 9)
#define TMR_CCTRL_C3P_SHIFT               (9)
#define TMR_CCTRL_C3P(x)                  (x << 9)
#define TMR_CCTRL_C3EN_MASK               (0x01 << 8)
#define TMR_CCTRL_C3EN_SHIFT              (8)
#define TMR_CCTRL_C3EN(x)                 (x << 8)
#define TMR_CCTRL_C2CP_MASK               (0x01 << 7)
#define TMR_CCTRL_C2CP_SHIFT              (7)
#define TMR_CCTRL_C2CP(x)                 (x << 7)
#define TMR_CCTRL_C2CEN_MASK              (0x01 << 6)
#define TMR_CCTRL_C2CEN_SHIFT             (6)
#define TMR_CCTRL_C2CEN(x)                (x << 6)
#define TMR_CCTRL_C2P_MASK                (0x01 << 5)
#define TMR_CCTRL_C2P_SHIFT               (5)
#define TMR_CCTRL_C2P(x)                  (x << 5)
#define TMR_CCTRL_C2EN_MASK               (0x01 << 4)
#define TMR_CCTRL_C2EN_SHIFT              (4)
#define TMR_CCTRL_C2EN(x)                 (x << 4)
#define TMR_CCTRL_C1CP_MASK               (0x01 << 3)
#define TMR_CCTRL_C1CP_SHIFT              (3)
#define TMR_CCTRL_C1CP(x)                 (x << 3)
#define TMR_CCTRL_C1CEN_MASK              (0x01 << 2)
#define TMR_CCTRL_C1CEN_SHIFT             (2)
#define TMR_CCTRL_C1CEN(x)                (x << 2)
#define TMR_CCTRL_C1P_MASK                (0x01 << 1)
#define TMR_CCTRL_C1P_SHIFT               (1)
#define TMR_CCTRL_C1P(x)                  (x << 1)
#define TMR_CCTRL_C1EN_MASK               (0x01 << 0)
#define TMR_CCTRL_C1EN_SHIFT              (0)
#define TMR_CCTRL_C1EN(x)                 (x << 0)
#define TMR_CVAL_CVAL_MASK                (0xffff << 0)
#define TMR_CVAL_CVAL_SHIFT               (0)
#define TMR_CVAL_CVAL(x)                  (x << 0)
#define TMR_DIV_DIV_MASK                  (0xffff << 0)
#define TMR_DIV_DIV_SHIFT                 (0)
#define TMR_DIV_DIV(x)                    (x << 0)
#define TMR_PR_PR_MASK                    (0xffff << 0)
#define TMR_PR_PR_SHIFT                   (0)
#define TMR_PR_PR(x)                      (x << 0)
#define TMR_RPR_RPR_MASK                  (0xff << 0)
#define TMR_RPR_RPR_SHIFT                 (0)
#define TMR_RPR_RPR(x)                    (x << 0)
#define TMR_C1DT_C1DT_MASK                (0xffff << 0)
#define TMR_C1DT_C1DT_SHIFT               (0)
#define TMR_C1DT_C1DT(x)                  (x << 0)
#define TMR_C2DT_C2DT_MASK                (0xffff << 0)
#define TMR_C2DT_C2DT_SHIFT               (0)
#define TMR_C2DT_C2DT(x)                  (x << 0)
#define TMR_C3DT_C3DT_MASK                (0xffff << 0)
#define TMR_C3DT_C3DT_SHIFT               (0)
#define TMR_C3DT_C3DT(x)                  (x << 0)
#define TMR_C4DT_C4DT_MASK                (0xffff << 0)
#define TMR_C4DT_C4DT_SHIFT               (0)
#define TMR_C4DT_C4DT(x)                  (x << 0)
#define TMR_BRK_OEN_MASK                  (0x01 << 15)
#define TMR_BRK_OEN_SHIFT                 (15)
#define TMR_BRK_OEN(x)                    (x << 15)
#define TMR_BRK_AOEN_MASK                 (0x01 << 14)
#define TMR_BRK_AOEN_SHIFT                (14)
#define TMR_BRK_AOEN(x)                   (x << 14)
#define TMR_BRK_BRKV_MASK                 (0x01 << 13)
#define TMR_BRK_BRKV_SHIFT                (13)
#define TMR_BRK_BRKV(x)                   (x << 13)
#define TMR_BRK_BRKEN_MASK                (0x01 << 12)
#define TMR_BRK_BRKEN_SHIFT               (12)
#define TMR_BRK_BRKEN(x)                  (x << 12)
#define TMR_BRK_FCSOEN_MASK               (0x01 << 11)
#define TMR_BRK_FCSOEN_SHIFT              (11)
#define TMR_BRK_FCSOEN(x)                 (x << 11)
#define TMR_BRK_FCSODIS_MASK              (0x01 << 10)
#define TMR_BRK_FCSODIS_SHIFT             (10)
#define TMR_BRK_FCSODIS(x)                (x << 10)
#define TMR_BRK_WPC_MASK                  (0x03 << 8)
#define TMR_BRK_WPC_SHIFT                 (8)
#define TMR_BRK_WPC(x)                    (x << 8)
#define TMR_BRK_DTC_MASK                  (0xff << 0)
#define TMR_BRK_DTC_SHIFT                 (0)
#define TMR_BRK_DTC(x)                    (x << 0)
#define TMR_DMACTRL_DTB_MASK              (0x1f << 8)
#define TMR_DMACTRL_DTB_SHIFT             (8)
#define TMR_DMACTRL_DTB(x)                (x << 8)
#define TMR_DMACTRL_ADDR_MASK             (0x1f << 0)
#define TMR_DMACTRL_ADDR_SHIFT            (0)
#define TMR_DMACTRL_ADDR(x)               (x << 0)
#define TMR_DMADT_DMADT_MASK              (0xffff << 0)
#define TMR_DMADT_DMADT_SHIFT             (0)
#define TMR_DMADT_DMADT(x)                (x << 0)

