eeucalyptus/at32f403a_minimal/at32f403a.h
/* I2C1 - Inter integrated circuit */
#define I2C_CTRL1_RESET_MASK              (0x01 << 15)
#define I2C_CTRL1_RESET_SHIFT             (15)
#define I2C_CTRL1_RESET(x)                (x << 15)
#define I2C_CTRL1_SMBALERT_MASK           (0x01 << 13)
#define I2C_CTRL1_SMBALERT_SHIFT          (13)
#define I2C_CTRL1_SMBALERT(x)             (x << 13)
#define I2C_CTRL1_PECTEN_MASK             (0x01 << 12)
#define I2C_CTRL1_PECTEN_SHIFT            (12)
#define I2C_CTRL1_PECTEN(x)               (x << 12)
#define I2C_CTRL1_MACKCTRL_MASK           (0x01 << 11)
#define I2C_CTRL1_MACKCTRL_SHIFT          (11)
#define I2C_CTRL1_MACKCTRL(x)             (x << 11)
#define I2C_CTRL1_ACKEN_MASK              (0x01 << 10)
#define I2C_CTRL1_ACKEN_SHIFT             (10)
#define I2C_CTRL1_ACKEN(x)                (x << 10)
#define I2C_CTRL1_GENSTOP_MASK            (0x01 << 9)
#define I2C_CTRL1_GENSTOP_SHIFT           (9)
#define I2C_CTRL1_GENSTOP(x)              (x << 9)
#define I2C_CTRL1_GENSTART_MASK           (0x01 << 8)
#define I2C_CTRL1_GENSTART_SHIFT          (8)
#define I2C_CTRL1_GENSTART(x)             (x << 8)
#define I2C_CTRL1_STRETCH_MASK            (0x01 << 7)
#define I2C_CTRL1_STRETCH_SHIFT           (7)
#define I2C_CTRL1_STRETCH(x)              (x << 7)
#define I2C_CTRL1_GCAEN_MASK              (0x01 << 6)
#define I2C_CTRL1_GCAEN_SHIFT             (6)
#define I2C_CTRL1_GCAEN(x)                (x << 6)
#define I2C_CTRL1_PECEN_MASK              (0x01 << 5)
#define I2C_CTRL1_PECEN_SHIFT             (5)
#define I2C_CTRL1_PECEN(x)                (x << 5)
#define I2C_CTRL1_ARPEN_MASK              (0x01 << 4)
#define I2C_CTRL1_ARPEN_SHIFT             (4)
#define I2C_CTRL1_ARPEN(x)                (x << 4)
#define I2C_CTRL1_SMBMODE_MASK            (0x01 << 3)
#define I2C_CTRL1_SMBMODE_SHIFT           (3)
#define I2C_CTRL1_SMBMODE(x)              (x << 3)
#define I2C_CTRL1_PERMODE_MASK            (0x01 << 1)
#define I2C_CTRL1_PERMODE_SHIFT           (1)
#define I2C_CTRL1_PERMODE(x)              (x << 1)
#define I2C_CTRL1_I2CEN_MASK              (0x01 << 0)
#define I2C_CTRL1_I2CEN_SHIFT             (0)
#define I2C_CTRL1_I2CEN(x)                (x << 0)
#define I2C_CTRL2_DMAEND_MASK             (0x01 << 12)
#define I2C_CTRL2_DMAEND_SHIFT            (12)
#define I2C_CTRL2_DMAEND(x)               (x << 12)
#define I2C_CTRL2_DMAEN_MASK              (0x01 << 11)
#define I2C_CTRL2_DMAEN_SHIFT             (11)
#define I2C_CTRL2_DMAEN(x)                (x << 11)
#define I2C_CTRL2_DATAIEN_MASK            (0x01 << 10)
#define I2C_CTRL2_DATAIEN_SHIFT           (10)
#define I2C_CTRL2_DATAIEN(x)              (x << 10)
#define I2C_CTRL2_EVTIEN_MASK             (0x01 << 9)
#define I2C_CTRL2_EVTIEN_SHIFT            (9)
#define I2C_CTRL2_EVTIEN(x)               (x << 9)
#define I2C_CTRL2_ERRIEN_MASK             (0x01 << 8)
#define I2C_CTRL2_ERRIEN_SHIFT            (8)
#define I2C_CTRL2_ERRIEN(x)               (x << 8)
#define I2C_CTRL2_CLKFREQ_MASK            (0xff << 0)
#define I2C_CTRL2_CLKFREQ_SHIFT           (0)
#define I2C_CTRL2_CLKFREQ(x)              (x << 0)
#define I2C_OADDR1_ADDR1MODE_MASK         (0x01 << 15)
#define I2C_OADDR1_ADDR1MODE_SHIFT        (15)
#define I2C_OADDR1_ADDR1MODE(x)           (x << 15)
#define I2C_OADDR1_ADDR1_MASK             (0x3ff << 0)
#define I2C_OADDR1_ADDR1_SHIFT            (0)
#define I2C_OADDR1_ADDR1(x)               (x << 0)
#define I2C_OADDR2_ADDR2_MASK             (0x7f << 1)
#define I2C_OADDR2_ADDR2_SHIFT            (1)
#define I2C_OADDR2_ADDR2(x)               (x << 1)
#define I2C_OADDR2_ADDR2EN_MASK           (0x01 << 0)
#define I2C_OADDR2_ADDR2EN_SHIFT          (0)
#define I2C_OADDR2_ADDR2EN(x)             (x << 0)
#define I2C_DT_DT_MASK                    (0xff << 0)
#define I2C_DT_DT_SHIFT                   (0)
#define I2C_DT_DT(x)                      (x << 0)
#define I2C_STS1_ALERTF_MASK              (0x01 << 15)
#define I2C_STS1_ALERTF_SHIFT             (15)
#define I2C_STS1_ALERTF(x)                (x << 15)
#define I2C_STS1_TMOUT_MASK               (0x01 << 14)
#define I2C_STS1_TMOUT_SHIFT              (14)
#define I2C_STS1_TMOUT(x)                 (x << 14)
#define I2C_STS1_PECERR_MASK              (0x01 << 12)
#define I2C_STS1_PECERR_SHIFT             (12)
#define I2C_STS1_PECERR(x)                (x << 12)
#define I2C_STS1_OUF_MASK                 (0x01 << 11)
#define I2C_STS1_OUF_SHIFT                (11)
#define I2C_STS1_OUF(x)                   (x << 11)
#define I2C_STS1_ACKFAIL_MASK             (0x01 << 10)
#define I2C_STS1_ACKFAIL_SHIFT            (10)
#define I2C_STS1_ACKFAIL(x)               (x << 10)
#define I2C_STS1_ARLOST_MASK              (0x01 << 9)
#define I2C_STS1_ARLOST_SHIFT             (9)
#define I2C_STS1_ARLOST(x)                (x << 9)
#define I2C_STS1_BUSERR_MASK              (0x01 << 8)
#define I2C_STS1_BUSERR_SHIFT             (8)
#define I2C_STS1_BUSERR(x)                (x << 8)
#define I2C_STS1_TDBE_MASK                (0x01 << 7)
#define I2C_STS1_TDBE_SHIFT               (7)
#define I2C_STS1_TDBE(x)                  (x << 7)
#define I2C_STS1_RDBF_MASK                (0x01 << 6)
#define I2C_STS1_RDBF_SHIFT               (6)
#define I2C_STS1_RDBF(x)                  (x << 6)
#define I2C_STS1_STOPF_MASK               (0x01 << 4)
#define I2C_STS1_STOPF_SHIFT              (4)
#define I2C_STS1_STOPF(x)                 (x << 4)
#define I2C_STS1_ADDRHF_MASK              (0x01 << 3)
#define I2C_STS1_ADDRHF_SHIFT             (3)
#define I2C_STS1_ADDRHF(x)                (x << 3)
#define I2C_STS1_TDC_MASK                 (0x01 << 2)
#define I2C_STS1_TDC_SHIFT                (2)
#define I2C_STS1_TDC(x)                   (x << 2)
#define I2C_STS1_ADDR7F_MASK              (0x01 << 1)
#define I2C_STS1_ADDR7F_SHIFT             (1)
#define I2C_STS1_ADDR7F(x)                (x << 1)
#define I2C_STS1_STARTF_MASK              (0x01 << 0)
#define I2C_STS1_STARTF_SHIFT             (0)
#define I2C_STS1_STARTF(x)                (x << 0)
#define I2C_STS2_PECVAL_MASK              (0xff << 8)
#define I2C_STS2_PECVAL_SHIFT             (8)
#define I2C_STS2_PECVAL(x)                (x << 8)
#define I2C_STS2_ADDR2F_MASK              (0x01 << 7)
#define I2C_STS2_ADDR2F_SHIFT             (7)
#define I2C_STS2_ADDR2F(x)                (x << 7)
#define I2C_STS2_HOSTADDRF_MASK           (0x01 << 6)
#define I2C_STS2_HOSTADDRF_SHIFT          (6)
#define I2C_STS2_HOSTADDRF(x)             (x << 6)
#define I2C_STS2_DEVADDRF_MASK            (0x01 << 5)
#define I2C_STS2_DEVADDRF_SHIFT           (5)
#define I2C_STS2_DEVADDRF(x)              (x << 5)
#define I2C_STS2_GCADDRF_MASK             (0x01 << 4)
#define I2C_STS2_GCADDRF_SHIFT            (4)
#define I2C_STS2_GCADDRF(x)               (x << 4)
#define I2C_STS2_DIRF_MASK                (0x01 << 2)
#define I2C_STS2_DIRF_SHIFT               (2)
#define I2C_STS2_DIRF(x)                  (x << 2)
#define I2C_STS2_BUSYF_MASK               (0x01 << 1)
#define I2C_STS2_BUSYF_SHIFT              (1)
#define I2C_STS2_BUSYF(x)                 (x << 1)
#define I2C_STS2_TRMODE_MASK              (0x01 << 0)
#define I2C_STS2_TRMODE_SHIFT             (0)
#define I2C_STS2_TRMODE(x)                (x << 0)
#define I2C_CLKCTRL_SPEEDMODE_MASK        (0x01 << 15)
#define I2C_CLKCTRL_SPEEDMODE_SHIFT       (15)
#define I2C_CLKCTRL_SPEEDMODE(x)          (x << 15)
#define I2C_CLKCTRL_DUTYMODE_MASK         (0x01 << 14)
#define I2C_CLKCTRL_DUTYMODE_SHIFT        (14)
#define I2C_CLKCTRL_DUTYMODE(x)           (x << 14)
#define I2C_CLKCTRL_SPEED_MASK            (0xfff << 0)
#define I2C_CLKCTRL_SPEED_SHIFT           (0)
#define I2C_CLKCTRL_SPEED(x)              (x << 0)
#define I2C_TMRISE_RISETIME_MASK          (0x3f << 0)
#define I2C_TMRISE_RISETIME_SHIFT         (0)
#define I2C_TMRISE_RISETIME(x)            (x << 0)

