eeucalyptus/at32f403a_minimal/at32f403a.h
/* SPI1 - Serial peripheral interface */
#define SPI_CTRL1_SLBEN_MASK              (0x01 << 15)
#define SPI_CTRL1_SLBEN_SHIFT             (15)
#define SPI_CTRL1_SLBEN(x)                (x << 15)
#define SPI_CTRL1_SLBTD_MASK              (0x01 << 14)
#define SPI_CTRL1_SLBTD_SHIFT             (14)
#define SPI_CTRL1_SLBTD(x)                (x << 14)
#define SPI_CTRL1_CCEN_MASK               (0x01 << 13)
#define SPI_CTRL1_CCEN_SHIFT              (13)
#define SPI_CTRL1_CCEN(x)                 (x << 13)
#define SPI_CTRL1_NTC_MASK                (0x01 << 12)
#define SPI_CTRL1_NTC_SHIFT               (12)
#define SPI_CTRL1_NTC(x)                  (x << 12)
#define SPI_CTRL1_FBN_MASK                (0x01 << 11)
#define SPI_CTRL1_FBN_SHIFT               (11)
#define SPI_CTRL1_FBN(x)                  (x << 11)
#define SPI_CTRL1_ORA_MASK                (0x01 << 10)
#define SPI_CTRL1_ORA_SHIFT               (10)
#define SPI_CTRL1_ORA(x)                  (x << 10)
#define SPI_CTRL1_SWCSEN_MASK             (0x01 << 9)
#define SPI_CTRL1_SWCSEN_SHIFT            (9)
#define SPI_CTRL1_SWCSEN(x)               (x << 9)
#define SPI_CTRL1_SWCSIL_MASK             (0x01 << 8)
#define SPI_CTRL1_SWCSIL_SHIFT            (8)
#define SPI_CTRL1_SWCSIL(x)               (x << 8)
#define SPI_CTRL1_LTF_MASK                (0x01 << 7)
#define SPI_CTRL1_LTF_SHIFT               (7)
#define SPI_CTRL1_LTF(x)                  (x << 7)
#define SPI_CTRL1_SPIEN_MASK              (0x01 << 6)
#define SPI_CTRL1_SPIEN_SHIFT             (6)
#define SPI_CTRL1_SPIEN(x)                (x << 6)
#define SPI_CTRL1_MDIV2_0_MASK            (0x07 << 3)
#define SPI_CTRL1_MDIV2_0_SHIFT           (3)
#define SPI_CTRL1_MDIV2_0(x)              (x << 3)
#define SPI_CTRL1_MSTEN_MASK              (0x01 << 2)
#define SPI_CTRL1_MSTEN_SHIFT             (2)
#define SPI_CTRL1_MSTEN(x)                (x << 2)
#define SPI_CTRL1_CLKPOL_MASK             (0x01 << 1)
#define SPI_CTRL1_CLKPOL_SHIFT            (1)
#define SPI_CTRL1_CLKPOL(x)               (x << 1)
#define SPI_CTRL1_CLKPHA_MASK             (0x01 << 0)
#define SPI_CTRL1_CLKPHA_SHIFT            (0)
#define SPI_CTRL1_CLKPHA(x)               (x << 0)
#define SPI_CTRL2_MDIV3_MASK              (0x01 << 8)
#define SPI_CTRL2_MDIV3_SHIFT             (8)
#define SPI_CTRL2_MDIV3(x)                (x << 8)
#define SPI_CTRL2_TDBEIE_MASK             (0x01 << 7)
#define SPI_CTRL2_TDBEIE_SHIFT            (7)
#define SPI_CTRL2_TDBEIE(x)               (x << 7)
#define SPI_CTRL2_RDBFIE_MASK             (0x01 << 6)
#define SPI_CTRL2_RDBFIE_SHIFT            (6)
#define SPI_CTRL2_RDBFIE(x)               (x << 6)
#define SPI_CTRL2_ERRIE_MASK              (0x01 << 5)
#define SPI_CTRL2_ERRIE_SHIFT             (5)
#define SPI_CTRL2_ERRIE(x)                (x << 5)
#define SPI_CTRL2_HWCSOE_MASK             (0x01 << 2)
#define SPI_CTRL2_HWCSOE_SHIFT            (2)
#define SPI_CTRL2_HWCSOE(x)               (x << 2)
#define SPI_CTRL2_DMATEN_MASK             (0x01 << 1)
#define SPI_CTRL2_DMATEN_SHIFT            (1)
#define SPI_CTRL2_DMATEN(x)               (x << 1)
#define SPI_CTRL2_DMAREN_MASK             (0x01 << 0)
#define SPI_CTRL2_DMAREN_SHIFT            (0)
#define SPI_CTRL2_DMAREN(x)               (x << 0)
#define SPI_STS_BF_MASK                   (0x01 << 7)
#define SPI_STS_BF_SHIFT                  (7)
#define SPI_STS_BF(x)                     (x << 7)
#define SPI_STS_ROERR_MASK                (0x01 << 6)
#define SPI_STS_ROERR_SHIFT               (6)
#define SPI_STS_ROERR(x)                  (x << 6)
#define SPI_STS_MMERR_MASK                (0x01 << 5)
#define SPI_STS_MMERR_SHIFT               (5)
#define SPI_STS_MMERR(x)                  (x << 5)
#define SPI_STS_CCERR_MASK                (0x01 << 4)
#define SPI_STS_CCERR_SHIFT               (4)
#define SPI_STS_CCERR(x)                  (x << 4)
#define SPI_STS_TUERR_MASK                (0x01 << 3)
#define SPI_STS_TUERR_SHIFT               (3)
#define SPI_STS_TUERR(x)                  (x << 3)
#define SPI_STS_ACS_MASK                  (0x01 << 2)
#define SPI_STS_ACS_SHIFT                 (2)
#define SPI_STS_ACS(x)                    (x << 2)
#define SPI_STS_TDBE_MASK                 (0x01 << 1)
#define SPI_STS_TDBE_SHIFT                (1)
#define SPI_STS_TDBE(x)                   (x << 1)
#define SPI_STS_RDBF_MASK                 (0x01 << 0)
#define SPI_STS_RDBF_SHIFT                (0)
#define SPI_STS_RDBF(x)                   (x << 0)
#define SPI_DT_DT_MASK                    (0xffff << 0)
#define SPI_DT_DT_SHIFT                   (0)
#define SPI_DT_DT(x)                      (x << 0)
#define SPI_CPOLY_CPOLY_MASK              (0xffff << 0)
#define SPI_CPOLY_CPOLY_SHIFT             (0)
#define SPI_CPOLY_CPOLY(x)                (x << 0)
#define SPI_RCRC_RCRC_MASK                (0xffff << 0)
#define SPI_RCRC_RCRC_SHIFT               (0)
#define SPI_RCRC_RCRC(x)                  (x << 0)
#define SPI_TCRC_TCRC_MASK                (0xffff << 0)
#define SPI_TCRC_TCRC_SHIFT               (0)
#define SPI_TCRC_TCRC(x)                  (x << 0)
#define SPI_I2SCTRL_I2SMSEL_MASK          (0x01 << 11)
#define SPI_I2SCTRL_I2SMSEL_SHIFT         (11)
#define SPI_I2SCTRL_I2SMSEL(x)            (x << 11)
#define SPI_I2SCTRL_I2SEN_MASK            (0x01 << 10)
#define SPI_I2SCTRL_I2SEN_SHIFT           (10)
#define SPI_I2SCTRL_I2SEN(x)              (x << 10)
#define SPI_I2SCTRL_OPERSEL_MASK          (0x03 << 8)
#define SPI_I2SCTRL_OPERSEL_SHIFT         (8)
#define SPI_I2SCTRL_OPERSEL(x)            (x << 8)
#define SPI_I2SCTRL_PCMFSSEL_MASK         (0x01 << 7)
#define SPI_I2SCTRL_PCMFSSEL_SHIFT        (7)
#define SPI_I2SCTRL_PCMFSSEL(x)           (x << 7)
#define SPI_I2SCTRL_STDSEL_MASK           (0x03 << 4)
#define SPI_I2SCTRL_STDSEL_SHIFT          (4)
#define SPI_I2SCTRL_STDSEL(x)             (x << 4)
#define SPI_I2SCTRL_I2SCLKPOL_MASK        (0x01 << 3)
#define SPI_I2SCTRL_I2SCLKPOL_SHIFT       (3)
#define SPI_I2SCTRL_I2SCLKPOL(x)          (x << 3)
#define SPI_I2SCTRL_I2SDBN_MASK           (0x03 << 1)
#define SPI_I2SCTRL_I2SDBN_SHIFT          (1)
#define SPI_I2SCTRL_I2SDBN(x)             (x << 1)
#define SPI_I2SCTRL_I2SCBN_MASK           (0x01 << 0)
#define SPI_I2SCTRL_I2SCBN_SHIFT          (0)
#define SPI_I2SCTRL_I2SCBN(x)             (x << 0)
#define SPI_I2SCLK_I2SDIV9_8_MASK         (0x03 << 10)
#define SPI_I2SCLK_I2SDIV9_8_SHIFT        (10)
#define SPI_I2SCLK_I2SDIV9_8(x)           (x << 10)
#define SPI_I2SCLK_I2SMCLKOE_MASK         (0x01 << 9)
#define SPI_I2SCLK_I2SMCLKOE_SHIFT        (9)
#define SPI_I2SCLK_I2SMCLKOE(x)           (x << 9)
#define SPI_I2SCLK_I2SODD_MASK            (0x01 << 8)
#define SPI_I2SCLK_I2SODD_SHIFT           (8)
#define SPI_I2SCLK_I2SODD(x)              (x << 8)
#define SPI_I2SCLK_I2SDIV7_0_MASK         (0xff << 0)
#define SPI_I2SCLK_I2SDIV7_0_SHIFT        (0)
#define SPI_I2SCLK_I2SDIV7_0(x)           (x << 0)

/* USART1 - Universal synchronous asynchronous receiver transmitter */
#define USART_STS_CTSCF_MASK              (0x01 << 9)
#define USART_STS_CTSCF_SHIFT             (9)
#define USART_STS_CTSCF(x)                (x << 9)
#define USART_STS_BFF_MASK                (0x01 << 8)
#define USART_STS_BFF_SHIFT               (8)
#define USART_STS_BFF(x)                  (x << 8)
#define USART_STS_TDBE_MASK               (0x01 << 7)
#define USART_STS_TDBE_SHIFT              (7)
#define USART_STS_TDBE(x)                 (x << 7)
#define USART_STS_TDC_MASK                (0x01 << 6)
#define USART_STS_TDC_SHIFT               (6)
#define USART_STS_TDC(x)                  (x << 6)
#define USART_STS_RDBF_MASK               (0x01 << 5)
#define USART_STS_RDBF_SHIFT              (5)
#define USART_STS_RDBF(x)                 (x << 5)
#define USART_STS_IDLEF_MASK              (0x01 << 4)
#define USART_STS_IDLEF_SHIFT             (4)
#define USART_STS_IDLEF(x)                (x << 4)
#define USART_STS_ROERR_MASK              (0x01 << 3)
#define USART_STS_ROERR_SHIFT             (3)
#define USART_STS_ROERR(x)                (x << 3)
#define USART_STS_NERR_MASK               (0x01 << 2)
#define USART_STS_NERR_SHIFT              (2)
#define USART_STS_NERR(x)                 (x << 2)
#define USART_STS_FERR_MASK               (0x01 << 1)
#define USART_STS_FERR_SHIFT              (1)
#define USART_STS_FERR(x)                 (x << 1)
#define USART_STS_PERR_MASK               (0x01 << 0)
#define USART_STS_PERR_SHIFT              (0)
#define USART_STS_PERR(x)                 (x << 0)
#define USART_DT_DT_MASK                  (0x1ff << 0)
#define USART_DT_DT_SHIFT                 (0)
#define USART_DT_DT(x)                    (x << 0)
#define USART_BAUDR_DIV_MASK              (0xffff << 0)
#define USART_BAUDR_DIV_SHIFT             (0)
#define USART_BAUDR_DIV(x)                (x << 0)
#define USART_CTRL1_UEN_MASK              (0x01 << 13)
#define USART_CTRL1_UEN_SHIFT             (13)
#define USART_CTRL1_UEN(x)                (x << 13)
#define USART_CTRL1_DBN_MASK              (0x01 << 12)
#define USART_CTRL1_DBN_SHIFT             (12)
#define USART_CTRL1_DBN(x)                (x << 12)
#define USART_CTRL1_WUM_MASK              (0x01 << 11)
#define USART_CTRL1_WUM_SHIFT             (11)
#define USART_CTRL1_WUM(x)                (x << 11)
#define USART_CTRL1_PEN_MASK              (0x01 << 10)
#define USART_CTRL1_PEN_SHIFT             (10)
#define USART_CTRL1_PEN(x)                (x << 10)
#define USART_CTRL1_PSEL_MASK             (0x01 << 9)
#define USART_CTRL1_PSEL_SHIFT            (9)
#define USART_CTRL1_PSEL(x)               (x << 9)
#define USART_CTRL1_PERRIEN_MASK          (0x01 << 8)
#define USART_CTRL1_PERRIEN_SHIFT         (8)
#define USART_CTRL1_PERRIEN(x)            (x << 8)
#define USART_CTRL1_TDBEIEN_MASK          (0x01 << 7)
#define USART_CTRL1_TDBEIEN_SHIFT         (7)
#define USART_CTRL1_TDBEIEN(x)            (x << 7)
#define USART_CTRL1_TDCIEN_MASK           (0x01 << 6)
#define USART_CTRL1_TDCIEN_SHIFT          (6)
#define USART_CTRL1_TDCIEN(x)             (x << 6)
#define USART_CTRL1_RDBFIEN_MASK          (0x01 << 5)
#define USART_CTRL1_RDBFIEN_SHIFT         (5)
#define USART_CTRL1_RDBFIEN(x)            (x << 5)
#define USART_CTRL1_IDLEIEN_MASK          (0x01 << 4)
#define USART_CTRL1_IDLEIEN_SHIFT         (4)
#define USART_CTRL1_IDLEIEN(x)            (x << 4)
#define USART_CTRL1_TEN_MASK              (0x01 << 3)
#define USART_CTRL1_TEN_SHIFT             (3)
#define USART_CTRL1_TEN(x)                (x << 3)
#define USART_CTRL1_REN_MASK              (0x01 << 2)
#define USART_CTRL1_REN_SHIFT             (2)
#define USART_CTRL1_REN(x)                (x << 2)
#define USART_CTRL1_RM_MASK               (0x01 << 1)
#define USART_CTRL1_RM_SHIFT              (1)
#define USART_CTRL1_RM(x)                 (x << 1)
#define USART_CTRL1_SBF_MASK              (0x01 << 0)
#define USART_CTRL1_SBF_SHIFT             (0)
#define USART_CTRL1_SBF(x)                (x << 0)
#define USART_CTRL2_LINEN_MASK            (0x01 << 14)
#define USART_CTRL2_LINEN_SHIFT           (14)
#define USART_CTRL2_LINEN(x)              (x << 14)
#define USART_CTRL2_STOPBN_MASK           (0x03 << 12)
#define USART_CTRL2_STOPBN_SHIFT          (12)
#define USART_CTRL2_STOPBN(x)             (x << 12)
#define USART_CTRL2_CLKEN_MASK            (0x01 << 11)
#define USART_CTRL2_CLKEN_SHIFT           (11)
#define USART_CTRL2_CLKEN(x)              (x << 11)
#define USART_CTRL2_CLKPOL_MASK           (0x01 << 10)
#define USART_CTRL2_CLKPOL_SHIFT          (10)
#define USART_CTRL2_CLKPOL(x)             (x << 10)
#define USART_CTRL2_CLKPHA_MASK           (0x01 << 9)
#define USART_CTRL2_CLKPHA_SHIFT          (9)
#define USART_CTRL2_CLKPHA(x)             (x << 9)
#define USART_CTRL2_LBCP_MASK             (0x01 << 8)
#define USART_CTRL2_LBCP_SHIFT            (8)
#define USART_CTRL2_LBCP(x)               (x << 8)
#define USART_CTRL2_BFIEN_MASK            (0x01 << 6)
#define USART_CTRL2_BFIEN_SHIFT           (6)
#define USART_CTRL2_BFIEN(x)              (x << 6)
#define USART_CTRL2_BFBN_MASK             (0x01 << 5)
#define USART_CTRL2_BFBN_SHIFT            (5)
#define USART_CTRL2_BFBN(x)               (x << 5)
#define USART_CTRL2_ID_MASK               (0x0f << 0)
#define USART_CTRL2_ID_SHIFT              (0)
#define USART_CTRL2_ID(x)                 (x << 0)
#define USART_CTRL3_CTSCFIEN_MASK         (0x01 << 10)
#define USART_CTRL3_CTSCFIEN_SHIFT        (10)
#define USART_CTRL3_CTSCFIEN(x)           (x << 10)
#define USART_CTRL3_CTSEN_MASK            (0x01 << 9)
#define USART_CTRL3_CTSEN_SHIFT           (9)
#define USART_CTRL3_CTSEN(x)              (x << 9)
#define USART_CTRL3_RTSEN_MASK            (0x01 << 8)
#define USART_CTRL3_RTSEN_SHIFT           (8)
#define USART_CTRL3_RTSEN(x)              (x << 8)
#define USART_CTRL3_DMATEN_MASK           (0x01 << 7)
#define USART_CTRL3_DMATEN_SHIFT          (7)
#define USART_CTRL3_DMATEN(x)             (x << 7)
#define USART_CTRL3_DMAREN_MASK           (0x01 << 6)
#define USART_CTRL3_DMAREN_SHIFT          (6)
#define USART_CTRL3_DMAREN(x)             (x << 6)
#define USART_CTRL3_SCMEN_MASK            (0x01 << 5)
#define USART_CTRL3_SCMEN_SHIFT           (5)
#define USART_CTRL3_SCMEN(x)              (x << 5)
#define USART_CTRL3_SCNACKEN_MASK         (0x01 << 4)
#define USART_CTRL3_SCNACKEN_SHIFT        (4)
#define USART_CTRL3_SCNACKEN(x)           (x << 4)
#define USART_CTRL3_SLBEN_MASK            (0x01 << 3)
#define USART_CTRL3_SLBEN_SHIFT           (3)
#define USART_CTRL3_SLBEN(x)              (x << 3)
#define USART_CTRL3_IRDALP_MASK           (0x01 << 2)
#define USART_CTRL3_IRDALP_SHIFT          (2)
#define USART_CTRL3_IRDALP(x)             (x << 2)
#define USART_CTRL3_IRDAEN_MASK           (0x01 << 1)
#define USART_CTRL3_IRDAEN_SHIFT          (1)
#define USART_CTRL3_IRDAEN(x)             (x << 1)
#define USART_CTRL3_ERRIEN_MASK           (0x01 << 0)
#define USART_CTRL3_ERRIEN_SHIFT          (0)
#define USART_CTRL3_ERRIEN(x)             (x << 0)
#define USART_GDIV_SCGT_MASK              (0xff << 8)
#define USART_GDIV_SCGT_SHIFT             (8)
#define USART_GDIV_SCGT(x)                (x << 8)
#define USART_GDIV_ISDIV_MASK             (0xff << 0)
#define USART_GDIV_ISDIV_SHIFT            (0)
#define USART_GDIV_ISDIV(x)               (x << 0)

