eeucalyptus/at32f403a_minimal/at32f403a.h
/* ADC1 - Analog to digital converter */
#define ADC_STS_OCCS_MASK                 (0x01 << 4)
#define ADC_STS_OCCS_SHIFT                (4)
#define ADC_STS_OCCS(x)                   (x << 4)
#define ADC_STS_PCCS_MASK                 (0x01 << 3)
#define ADC_STS_PCCS_SHIFT                (3)
#define ADC_STS_PCCS(x)                   (x << 3)
#define ADC_STS_PCCE_MASK                 (0x01 << 2)
#define ADC_STS_PCCE_SHIFT                (2)
#define ADC_STS_PCCE(x)                   (x << 2)
#define ADC_STS_CCE_MASK                  (0x01 << 1)
#define ADC_STS_CCE_SHIFT                 (1)
#define ADC_STS_CCE(x)                    (x << 1)
#define ADC_STS_VMOR_MASK                 (0x01 << 0)
#define ADC_STS_VMOR_SHIFT                (0)
#define ADC_STS_VMOR(x)                   (x << 0)
#define ADC_CTRL1_OCVMEN_MASK             (0x01 << 23)
#define ADC_CTRL1_OCVMEN_SHIFT            (23)
#define ADC_CTRL1_OCVMEN(x)               (x << 23)
#define ADC_CTRL1_PCVMEN_MASK             (0x01 << 22)
#define ADC_CTRL1_PCVMEN_SHIFT            (22)
#define ADC_CTRL1_PCVMEN(x)               (x << 22)
#define ADC_CTRL1_MSSEL_MASK              (0x0f << 16)
#define ADC_CTRL1_MSSEL_SHIFT             (16)
#define ADC_CTRL1_MSSEL(x)                (x << 16)
#define ADC_CTRL1_OCPCNT_MASK             (0x07 << 13)
#define ADC_CTRL1_OCPCNT_SHIFT            (13)
#define ADC_CTRL1_OCPCNT(x)               (x << 13)
#define ADC_CTRL1_PCPEN_MASK              (0x01 << 12)
#define ADC_CTRL1_PCPEN_SHIFT             (12)
#define ADC_CTRL1_PCPEN(x)                (x << 12)
#define ADC_CTRL1_OCPEN_MASK              (0x01 << 11)
#define ADC_CTRL1_OCPEN_SHIFT             (11)
#define ADC_CTRL1_OCPEN(x)                (x << 11)
#define ADC_CTRL1_PCAUTOEN_MASK           (0x01 << 10)
#define ADC_CTRL1_PCAUTOEN_SHIFT          (10)
#define ADC_CTRL1_PCAUTOEN(x)             (x << 10)
#define ADC_CTRL1_VMSGEN_MASK             (0x01 << 9)
#define ADC_CTRL1_VMSGEN_SHIFT            (9)
#define ADC_CTRL1_VMSGEN(x)               (x << 9)
#define ADC_CTRL1_SQEN_MASK               (0x01 << 8)
#define ADC_CTRL1_SQEN_SHIFT              (8)
#define ADC_CTRL1_SQEN(x)                 (x << 8)
#define ADC_CTRL1_PCCEIEN_MASK            (0x01 << 7)
#define ADC_CTRL1_PCCEIEN_SHIFT           (7)
#define ADC_CTRL1_PCCEIEN(x)              (x << 7)
#define ADC_CTRL1_VMORIEN_MASK            (0x01 << 6)
#define ADC_CTRL1_VMORIEN_SHIFT           (6)
#define ADC_CTRL1_VMORIEN(x)              (x << 6)
#define ADC_CTRL1_CCEIEN_MASK             (0x01 << 5)
#define ADC_CTRL1_CCEIEN_SHIFT            (5)
#define ADC_CTRL1_CCEIEN(x)               (x << 5)
#define ADC_CTRL1_VMCSEL_MASK             (0x1f << 0)
#define ADC_CTRL1_VMCSEL_SHIFT            (0)
#define ADC_CTRL1_VMCSEL(x)               (x << 0)
#define ADC_CTRL2_OCTESEL_H_MASK          (0x01 << 25)
#define ADC_CTRL2_OCTESEL_H_SHIFT         (25)
#define ADC_CTRL2_OCTESEL_H(x)            (x << 25)
#define ADC_CTRL2_PCTESEL_H_MASK          (0x01 << 24)
#define ADC_CTRL2_PCTESEL_H_SHIFT         (24)
#define ADC_CTRL2_PCTESEL_H(x)            (x << 24)
#define ADC_CTRL2_ITSRVEN_MASK            (0x01 << 23)
#define ADC_CTRL2_ITSRVEN_SHIFT           (23)
#define ADC_CTRL2_ITSRVEN(x)              (x << 23)
#define ADC_CTRL2_OCSWTRG_MASK            (0x01 << 22)
#define ADC_CTRL2_OCSWTRG_SHIFT           (22)
#define ADC_CTRL2_OCSWTRG(x)              (x << 22)
#define ADC_CTRL2_PCSWTRG_MASK            (0x01 << 21)
#define ADC_CTRL2_PCSWTRG_SHIFT           (21)
#define ADC_CTRL2_PCSWTRG(x)              (x << 21)
#define ADC_CTRL2_OCTEN_MASK              (0x01 << 20)
#define ADC_CTRL2_OCTEN_SHIFT             (20)
#define ADC_CTRL2_OCTEN(x)                (x << 20)
#define ADC_CTRL2_OCTESEL_L_MASK          (0x07 << 17)
#define ADC_CTRL2_OCTESEL_L_SHIFT         (17)
#define ADC_CTRL2_OCTESEL_L(x)            (x << 17)
#define ADC_CTRL2_PCTEN_MASK              (0x01 << 15)
#define ADC_CTRL2_PCTEN_SHIFT             (15)
#define ADC_CTRL2_PCTEN(x)                (x << 15)
#define ADC_CTRL2_PCTESEL_L_MASK          (0x07 << 12)
#define ADC_CTRL2_PCTESEL_L_SHIFT         (12)
#define ADC_CTRL2_PCTESEL_L(x)            (x << 12)
#define ADC_CTRL2_DTALIGN_MASK            (0x01 << 11)
#define ADC_CTRL2_DTALIGN_SHIFT           (11)
#define ADC_CTRL2_DTALIGN(x)              (x << 11)
#define ADC_CTRL2_OCDMAEN_MASK            (0x01 << 8)
#define ADC_CTRL2_OCDMAEN_SHIFT           (8)
#define ADC_CTRL2_OCDMAEN(x)              (x << 8)
#define ADC_CTRL2_ADCALINIT_MASK          (0x01 << 3)
#define ADC_CTRL2_ADCALINIT_SHIFT         (3)
#define ADC_CTRL2_ADCALINIT(x)            (x << 3)
#define ADC_CTRL2_ADCAL_MASK              (0x01 << 2)
#define ADC_CTRL2_ADCAL_SHIFT             (2)
#define ADC_CTRL2_ADCAL(x)                (x << 2)
#define ADC_CTRL2_RPEN_MASK               (0x01 << 1)
#define ADC_CTRL2_RPEN_SHIFT              (1)
#define ADC_CTRL2_RPEN(x)                 (x << 1)
#define ADC_CTRL2_ADCEN_MASK              (0x01 << 0)
#define ADC_CTRL2_ADCEN_SHIFT             (0)
#define ADC_CTRL2_ADCEN(x)                (x << 0)
#define ADC_SPT1_CSPT17_MASK              (0x07 << 21)
#define ADC_SPT1_CSPT17_SHIFT             (21)
#define ADC_SPT1_CSPT17(x)                (x << 21)
#define ADC_SPT1_CSPT16_MASK              (0x07 << 18)
#define ADC_SPT1_CSPT16_SHIFT             (18)
#define ADC_SPT1_CSPT16(x)                (x << 18)
#define ADC_SPT1_CSPT15_MASK              (0x07 << 15)
#define ADC_SPT1_CSPT15_SHIFT             (15)
#define ADC_SPT1_CSPT15(x)                (x << 15)
#define ADC_SPT1_CSPT14_MASK              (0x07 << 12)
#define ADC_SPT1_CSPT14_SHIFT             (12)
#define ADC_SPT1_CSPT14(x)                (x << 12)
#define ADC_SPT1_CSPT13_MASK              (0x07 << 9)
#define ADC_SPT1_CSPT13_SHIFT             (9)
#define ADC_SPT1_CSPT13(x)                (x << 9)
#define ADC_SPT1_CSPT12_MASK              (0x07 << 6)
#define ADC_SPT1_CSPT12_SHIFT             (6)
#define ADC_SPT1_CSPT12(x)                (x << 6)
#define ADC_SPT1_CSPT11_MASK              (0x07 << 3)
#define ADC_SPT1_CSPT11_SHIFT             (3)
#define ADC_SPT1_CSPT11(x)                (x << 3)
#define ADC_SPT1_CSPT10_MASK              (0x07 << 0)
#define ADC_SPT1_CSPT10_SHIFT             (0)
#define ADC_SPT1_CSPT10(x)                (x << 0)
#define ADC_SPT2_CSPT9_MASK               (0x07 << 27)
#define ADC_SPT2_CSPT9_SHIFT              (27)
#define ADC_SPT2_CSPT9(x)                 (x << 27)
#define ADC_SPT2_CSPT8_MASK               (0x07 << 24)
#define ADC_SPT2_CSPT8_SHIFT              (24)
#define ADC_SPT2_CSPT8(x)                 (x << 24)
#define ADC_SPT2_CSPT7_MASK               (0x07 << 21)
#define ADC_SPT2_CSPT7_SHIFT              (21)
#define ADC_SPT2_CSPT7(x)                 (x << 21)
#define ADC_SPT2_CSPT6_MASK               (0x07 << 18)
#define ADC_SPT2_CSPT6_SHIFT              (18)
#define ADC_SPT2_CSPT6(x)                 (x << 18)
#define ADC_SPT2_CSPT5_MASK               (0x07 << 15)
#define ADC_SPT2_CSPT5_SHIFT              (15)
#define ADC_SPT2_CSPT5(x)                 (x << 15)
#define ADC_SPT2_CSPT4_MASK               (0x07 << 12)
#define ADC_SPT2_CSPT4_SHIFT              (12)
#define ADC_SPT2_CSPT4(x)                 (x << 12)
#define ADC_SPT2_CSPT3_MASK               (0x07 << 9)
#define ADC_SPT2_CSPT3_SHIFT              (9)
#define ADC_SPT2_CSPT3(x)                 (x << 9)
#define ADC_SPT2_CSPT2_MASK               (0x07 << 6)
#define ADC_SPT2_CSPT2_SHIFT              (6)
#define ADC_SPT2_CSPT2(x)                 (x << 6)
#define ADC_SPT2_CSPT1_MASK               (0x07 << 3)
#define ADC_SPT2_CSPT1_SHIFT              (3)
#define ADC_SPT2_CSPT1(x)                 (x << 3)
#define ADC_SPT2_CSPT0_MASK               (0x07 << 0)
#define ADC_SPT2_CSPT0_SHIFT              (0)
#define ADC_SPT2_CSPT0(x)                 (x << 0)
#define ADC_PCDTO1_PCDTO1_MASK            (0xfff << 0)
#define ADC_PCDTO1_PCDTO1_SHIFT           (0)
#define ADC_PCDTO1_PCDTO1(x)              (x << 0)
#define ADC_PCDTO2_PCDTO2_MASK            (0xfff << 0)
#define ADC_PCDTO2_PCDTO2_SHIFT           (0)
#define ADC_PCDTO2_PCDTO2(x)              (x << 0)
#define ADC_PCDTO3_PCDTO3_MASK            (0xfff << 0)
#define ADC_PCDTO3_PCDTO3_SHIFT           (0)
#define ADC_PCDTO3_PCDTO3(x)              (x << 0)
#define ADC_PCDTO4_PCDTO4_MASK            (0xfff << 0)
#define ADC_PCDTO4_PCDTO4_SHIFT           (0)
#define ADC_PCDTO4_PCDTO4(x)              (x << 0)
#define ADC_VMHB_VMHB_MASK                (0xfff << 0)
#define ADC_VMHB_VMHB_SHIFT               (0)
#define ADC_VMHB_VMHB(x)                  (x << 0)
#define ADC_VMLB_VMLB_MASK                (0xfff << 0)
#define ADC_VMLB_VMLB_SHIFT               (0)
#define ADC_VMLB_VMLB(x)                  (x << 0)
#define ADC_OSQ1_OCLEN_MASK               (0x0f << 20)
#define ADC_OSQ1_OCLEN_SHIFT              (20)
#define ADC_OSQ1_OCLEN(x)                 (x << 20)
#define ADC_OSQ1_OSN16_MASK               (0x1f << 15)
#define ADC_OSQ1_OSN16_SHIFT              (15)
#define ADC_OSQ1_OSN16(x)                 (x << 15)
#define ADC_OSQ1_OSN15_MASK               (0x1f << 10)
#define ADC_OSQ1_OSN15_SHIFT              (10)
#define ADC_OSQ1_OSN15(x)                 (x << 10)
#define ADC_OSQ1_OSN14_MASK               (0x1f << 5)
#define ADC_OSQ1_OSN14_SHIFT              (5)
#define ADC_OSQ1_OSN14(x)                 (x << 5)
#define ADC_OSQ1_OSN13_MASK               (0x1f << 0)
#define ADC_OSQ1_OSN13_SHIFT              (0)
#define ADC_OSQ1_OSN13(x)                 (x << 0)
#define ADC_OSQ2_OSN12_MASK               (0x1f << 25)
#define ADC_OSQ2_OSN12_SHIFT              (25)
#define ADC_OSQ2_OSN12(x)                 (x << 25)
#define ADC_OSQ2_OSN11_MASK               (0x1f << 20)
#define ADC_OSQ2_OSN11_SHIFT              (20)
#define ADC_OSQ2_OSN11(x)                 (x << 20)
#define ADC_OSQ2_OSN10_MASK               (0x1f << 15)
#define ADC_OSQ2_OSN10_SHIFT              (15)
#define ADC_OSQ2_OSN10(x)                 (x << 15)
#define ADC_OSQ2_OSN9_MASK                (0x1f << 10)
#define ADC_OSQ2_OSN9_SHIFT               (10)
#define ADC_OSQ2_OSN9(x)                  (x << 10)
#define ADC_OSQ2_OSN8_MASK                (0x1f << 5)
#define ADC_OSQ2_OSN8_SHIFT               (5)
#define ADC_OSQ2_OSN8(x)                  (x << 5)
#define ADC_OSQ2_OSN7_MASK                (0x1f << 0)
#define ADC_OSQ2_OSN7_SHIFT               (0)
#define ADC_OSQ2_OSN7(x)                  (x << 0)
#define ADC_OSQ3_OSN6_MASK                (0x1f << 25)
#define ADC_OSQ3_OSN6_SHIFT               (25)
#define ADC_OSQ3_OSN6(x)                  (x << 25)
#define ADC_OSQ3_OSN5_MASK                (0x1f << 20)
#define ADC_OSQ3_OSN5_SHIFT               (20)
#define ADC_OSQ3_OSN5(x)                  (x << 20)
#define ADC_OSQ3_OSN4_MASK                (0x1f << 15)
#define ADC_OSQ3_OSN4_SHIFT               (15)
#define ADC_OSQ3_OSN4(x)                  (x << 15)
#define ADC_OSQ3_OSN3_MASK                (0x1f << 10)
#define ADC_OSQ3_OSN3_SHIFT               (10)
#define ADC_OSQ3_OSN3(x)                  (x << 10)
#define ADC_OSQ3_OSN2_MASK                (0x1f << 5)
#define ADC_OSQ3_OSN2_SHIFT               (5)
#define ADC_OSQ3_OSN2(x)                  (x << 5)
#define ADC_OSQ3_OSN1_MASK                (0x1f << 0)
#define ADC_OSQ3_OSN1_SHIFT               (0)
#define ADC_OSQ3_OSN1(x)                  (x << 0)
#define ADC_PSQ_PCLEN_MASK                (0x03 << 20)
#define ADC_PSQ_PCLEN_SHIFT               (20)
#define ADC_PSQ_PCLEN(x)                  (x << 20)
#define ADC_PSQ_PSN4_MASK                 (0x1f << 15)
#define ADC_PSQ_PSN4_SHIFT                (15)
#define ADC_PSQ_PSN4(x)                   (x << 15)
#define ADC_PSQ_PSN3_MASK                 (0x1f << 10)
#define ADC_PSQ_PSN3_SHIFT                (10)
#define ADC_PSQ_PSN3(x)                   (x << 10)
#define ADC_PSQ_PSN2_MASK                 (0x1f << 5)
#define ADC_PSQ_PSN2_SHIFT                (5)
#define ADC_PSQ_PSN2(x)                   (x << 5)
#define ADC_PSQ_PSN1_MASK                 (0x1f << 0)
#define ADC_PSQ_PSN1_SHIFT                (0)
#define ADC_PSQ_PSN1(x)                   (x << 0)
#define ADC_PDT1_PDT1_MASK                (0xffff << 0)
#define ADC_PDT1_PDT1_SHIFT               (0)
#define ADC_PDT1_PDT1(x)                  (x << 0)
#define ADC_PDT2_PDT2_MASK                (0xffff << 0)
#define ADC_PDT2_PDT2_SHIFT               (0)
#define ADC_PDT2_PDT2(x)                  (x << 0)
#define ADC_PDT3_PDT3_MASK                (0xffff << 0)
#define ADC_PDT3_PDT3_SHIFT               (0)
#define ADC_PDT3_PDT3(x)                  (x << 0)
#define ADC_PDT4_PDT4_MASK                (0xffff << 0)
#define ADC_PDT4_PDT4_SHIFT               (0)
#define ADC_PDT4_PDT4(x)                  (x << 0)
#define ADC_ODT_ADC2ODT_MASK              (0xffff << 16)
#define ADC_ODT_ADC2ODT_SHIFT             (16)
#define ADC_ODT_ADC2ODT(x)                (x << 16)
#define ADC_ODT_ODT_MASK                  (0xffff << 0)
#define ADC_ODT_ODT_SHIFT                 (0)
#define ADC_ODT_ODT(x)                    (x << 0)

