eeucalyptus/at32f403a_minimal/at32f403a.h
/* CAN1 - Can controller area network */
#define CAN_MCTRL_PTD_MASK                (0x01 << 16)
#define CAN_MCTRL_PTD_SHIFT               (16)
#define CAN_MCTRL_PTD(x)                  (x << 16)
#define CAN_MCTRL_SPRST_MASK              (0x01 << 15)
#define CAN_MCTRL_SPRST_SHIFT             (15)
#define CAN_MCTRL_SPRST(x)                (x << 15)
#define CAN_MCTRL_TTCEN_MASK              (0x01 << 7)
#define CAN_MCTRL_TTCEN_SHIFT             (7)
#define CAN_MCTRL_TTCEN(x)                (x << 7)
#define CAN_MCTRL_AEBOEN_MASK             (0x01 << 6)
#define CAN_MCTRL_AEBOEN_SHIFT            (6)
#define CAN_MCTRL_AEBOEN(x)               (x << 6)
#define CAN_MCTRL_AEDEN_MASK              (0x01 << 5)
#define CAN_MCTRL_AEDEN_SHIFT             (5)
#define CAN_MCTRL_AEDEN(x)                (x << 5)
#define CAN_MCTRL_PRSFEN_MASK             (0x01 << 4)
#define CAN_MCTRL_PRSFEN_SHIFT            (4)
#define CAN_MCTRL_PRSFEN(x)               (x << 4)
#define CAN_MCTRL_MDRSEL_MASK             (0x01 << 3)
#define CAN_MCTRL_MDRSEL_SHIFT            (3)
#define CAN_MCTRL_MDRSEL(x)               (x << 3)
#define CAN_MCTRL_MMSSR_MASK              (0x01 << 2)
#define CAN_MCTRL_MMSSR_SHIFT             (2)
#define CAN_MCTRL_MMSSR(x)                (x << 2)
#define CAN_MCTRL_DZEN_MASK               (0x01 << 1)
#define CAN_MCTRL_DZEN_SHIFT              (1)
#define CAN_MCTRL_DZEN(x)                 (x << 1)
#define CAN_MCTRL_FZEN_MASK               (0x01 << 0)
#define CAN_MCTRL_FZEN_SHIFT              (0)
#define CAN_MCTRL_FZEN(x)                 (x << 0)
#define CAN_MSTS_REALRX_MASK              (0x01 << 11)
#define CAN_MSTS_REALRX_SHIFT             (11)
#define CAN_MSTS_REALRX(x)                (x << 11)
#define CAN_MSTS_LSAMPRX_MASK             (0x01 << 10)
#define CAN_MSTS_LSAMPRX_SHIFT            (10)
#define CAN_MSTS_LSAMPRX(x)               (x << 10)
#define CAN_MSTS_CURS_MASK                (0x01 << 9)
#define CAN_MSTS_CURS_SHIFT               (9)
#define CAN_MSTS_CURS(x)                  (x << 9)
#define CAN_MSTS_CUSS_MASK                (0x01 << 8)
#define CAN_MSTS_CUSS_SHIFT               (8)
#define CAN_MSTS_CUSS(x)                  (x << 8)
#define CAN_MSTS_EDZIF_MASK               (0x01 << 4)
#define CAN_MSTS_EDZIF_SHIFT              (4)
#define CAN_MSTS_EDZIF(x)                 (x << 4)
#define CAN_MSTS_QDZIF_MASK               (0x01 << 3)
#define CAN_MSTS_QDZIF_SHIFT              (3)
#define CAN_MSTS_QDZIF(x)                 (x << 3)
#define CAN_MSTS_EOIF_MASK                (0x01 << 2)
#define CAN_MSTS_EOIF_SHIFT               (2)
#define CAN_MSTS_EOIF(x)                  (x << 2)
#define CAN_MSTS_DZC_MASK                 (0x01 << 1)
#define CAN_MSTS_DZC_SHIFT                (1)
#define CAN_MSTS_DZC(x)                   (x << 1)
#define CAN_MSTS_FZC_MASK                 (0x01 << 0)
#define CAN_MSTS_FZC_SHIFT                (0)
#define CAN_MSTS_FZC(x)                   (x << 0)
#define CAN_TSTS_TM2LPF_MASK              (0x01 << 31)
#define CAN_TSTS_TM2LPF_SHIFT             (31)
#define CAN_TSTS_TM2LPF(x)                (x << 31)
#define CAN_TSTS_TM1LPF_MASK              (0x01 << 30)
#define CAN_TSTS_TM1LPF_SHIFT             (30)
#define CAN_TSTS_TM1LPF(x)                (x << 30)
#define CAN_TSTS_TM0LPF_MASK              (0x01 << 29)
#define CAN_TSTS_TM0LPF_SHIFT             (29)
#define CAN_TSTS_TM0LPF(x)                (x << 29)
#define CAN_TSTS_TM2EF_MASK               (0x01 << 28)
#define CAN_TSTS_TM2EF_SHIFT              (28)
#define CAN_TSTS_TM2EF(x)                 (x << 28)
#define CAN_TSTS_TM1EF_MASK               (0x01 << 27)
#define CAN_TSTS_TM1EF_SHIFT              (27)
#define CAN_TSTS_TM1EF(x)                 (x << 27)
#define CAN_TSTS_TM0EF_MASK               (0x01 << 26)
#define CAN_TSTS_TM0EF_SHIFT              (26)
#define CAN_TSTS_TM0EF(x)                 (x << 26)
#define CAN_TSTS_TMNR_MASK                (0x03 << 24)
#define CAN_TSTS_TMNR_SHIFT               (24)
#define CAN_TSTS_TMNR(x)                  (x << 24)
#define CAN_TSTS_TM2CT_MASK               (0x01 << 23)
#define CAN_TSTS_TM2CT_SHIFT              (23)
#define CAN_TSTS_TM2CT(x)                 (x << 23)
#define CAN_TSTS_TM2TEF_MASK              (0x01 << 19)
#define CAN_TSTS_TM2TEF_SHIFT             (19)
#define CAN_TSTS_TM2TEF(x)                (x << 19)
#define CAN_TSTS_TM2ALF_MASK              (0x01 << 18)
#define CAN_TSTS_TM2ALF_SHIFT             (18)
#define CAN_TSTS_TM2ALF(x)                (x << 18)
#define CAN_TSTS_TM2TSF_MASK              (0x01 << 17)
#define CAN_TSTS_TM2TSF_SHIFT             (17)
#define CAN_TSTS_TM2TSF(x)                (x << 17)
#define CAN_TSTS_TM2TCF_MASK              (0x01 << 16)
#define CAN_TSTS_TM2TCF_SHIFT             (16)
#define CAN_TSTS_TM2TCF(x)                (x << 16)
#define CAN_TSTS_TM1CT_MASK               (0x01 << 15)
#define CAN_TSTS_TM1CT_SHIFT              (15)
#define CAN_TSTS_TM1CT(x)                 (x << 15)
#define CAN_TSTS_TM1TEF_MASK              (0x01 << 11)
#define CAN_TSTS_TM1TEF_SHIFT             (11)
#define CAN_TSTS_TM1TEF(x)                (x << 11)
#define CAN_TSTS_TM1ALF_MASK              (0x01 << 10)
#define CAN_TSTS_TM1ALF_SHIFT             (10)
#define CAN_TSTS_TM1ALF(x)                (x << 10)
#define CAN_TSTS_TM1TSF_MASK              (0x01 << 9)
#define CAN_TSTS_TM1TSF_SHIFT             (9)
#define CAN_TSTS_TM1TSF(x)                (x << 9)
#define CAN_TSTS_TM1TCF_MASK              (0x01 << 8)
#define CAN_TSTS_TM1TCF_SHIFT             (8)
#define CAN_TSTS_TM1TCF(x)                (x << 8)
#define CAN_TSTS_TM0CT_MASK               (0x01 << 7)
#define CAN_TSTS_TM0CT_SHIFT              (7)
#define CAN_TSTS_TM0CT(x)                 (x << 7)
#define CAN_TSTS_TM0TEF_MASK              (0x01 << 3)
#define CAN_TSTS_TM0TEF_SHIFT             (3)
#define CAN_TSTS_TM0TEF(x)                (x << 3)
#define CAN_TSTS_TM0ALF_MASK              (0x01 << 2)
#define CAN_TSTS_TM0ALF_SHIFT             (2)
#define CAN_TSTS_TM0ALF(x)                (x << 2)
#define CAN_TSTS_TM0TSF_MASK              (0x01 << 1)
#define CAN_TSTS_TM0TSF_SHIFT             (1)
#define CAN_TSTS_TM0TSF(x)                (x << 1)
#define CAN_TSTS_TM0TCF_MASK              (0x01 << 0)
#define CAN_TSTS_TM0TCF_SHIFT             (0)
#define CAN_TSTS_TM0TCF(x)                (x << 0)
#define CAN_RF0_RF0R_MASK                 (0x01 << 5)
#define CAN_RF0_RF0R_SHIFT                (5)
#define CAN_RF0_RF0R(x)                   (x << 5)
#define CAN_RF0_RF0OF_MASK                (0x01 << 4)
#define CAN_RF0_RF0OF_SHIFT               (4)
#define CAN_RF0_RF0OF(x)                  (x << 4)
#define CAN_RF0_RF0FF_MASK                (0x01 << 3)
#define CAN_RF0_RF0FF_SHIFT               (3)
#define CAN_RF0_RF0FF(x)                  (x << 3)
#define CAN_RF0_RF0MN_MASK                (0x03 << 0)
#define CAN_RF0_RF0MN_SHIFT               (0)
#define CAN_RF0_RF0MN(x)                  (x << 0)
#define CAN_RF1_RF1R_MASK                 (0x01 << 5)
#define CAN_RF1_RF1R_SHIFT                (5)
#define CAN_RF1_RF1R(x)                   (x << 5)
#define CAN_RF1_RF1OF_MASK                (0x01 << 4)
#define CAN_RF1_RF1OF_SHIFT               (4)
#define CAN_RF1_RF1OF(x)                  (x << 4)
#define CAN_RF1_RF1FF_MASK                (0x01 << 3)
#define CAN_RF1_RF1FF_SHIFT               (3)
#define CAN_RF1_RF1FF(x)                  (x << 3)
#define CAN_RF1_RF1MN_MASK                (0x03 << 0)
#define CAN_RF1_RF1MN_SHIFT               (0)
#define CAN_RF1_RF1MN(x)                  (x << 0)
#define CAN_INTEN_EDZIEN_MASK             (0x01 << 17)
#define CAN_INTEN_EDZIEN_SHIFT            (17)
#define CAN_INTEN_EDZIEN(x)               (x << 17)
#define CAN_INTEN_QDZIEN_MASK             (0x01 << 16)
#define CAN_INTEN_QDZIEN_SHIFT            (16)
#define CAN_INTEN_QDZIEN(x)               (x << 16)
#define CAN_INTEN_EOIEN_MASK              (0x01 << 15)
#define CAN_INTEN_EOIEN_SHIFT             (15)
#define CAN_INTEN_EOIEN(x)                (x << 15)
#define CAN_INTEN_ETRIEN_MASK             (0x01 << 11)
#define CAN_INTEN_ETRIEN_SHIFT            (11)
#define CAN_INTEN_ETRIEN(x)               (x << 11)
#define CAN_INTEN_BOIEN_MASK              (0x01 << 10)
#define CAN_INTEN_BOIEN_SHIFT             (10)
#define CAN_INTEN_BOIEN(x)                (x << 10)
#define CAN_INTEN_EPIEN_MASK              (0x01 << 9)
#define CAN_INTEN_EPIEN_SHIFT             (9)
#define CAN_INTEN_EPIEN(x)                (x << 9)
#define CAN_INTEN_EAIEN_MASK              (0x01 << 8)
#define CAN_INTEN_EAIEN_SHIFT             (8)
#define CAN_INTEN_EAIEN(x)                (x << 8)
#define CAN_INTEN_RF1OIEN_MASK            (0x01 << 6)
#define CAN_INTEN_RF1OIEN_SHIFT           (6)
#define CAN_INTEN_RF1OIEN(x)              (x << 6)
#define CAN_INTEN_RF1FIEN_MASK            (0x01 << 5)
#define CAN_INTEN_RF1FIEN_SHIFT           (5)
#define CAN_INTEN_RF1FIEN(x)              (x << 5)
#define CAN_INTEN_RF1MIEN_MASK            (0x01 << 4)
#define CAN_INTEN_RF1MIEN_SHIFT           (4)
#define CAN_INTEN_RF1MIEN(x)              (x << 4)
#define CAN_INTEN_RF0OIEN_MASK            (0x01 << 3)
#define CAN_INTEN_RF0OIEN_SHIFT           (3)
#define CAN_INTEN_RF0OIEN(x)              (x << 3)
#define CAN_INTEN_RF0FIEN_MASK            (0x01 << 2)
#define CAN_INTEN_RF0FIEN_SHIFT           (2)
#define CAN_INTEN_RF0FIEN(x)              (x << 2)
#define CAN_INTEN_RF0MIEN_MASK            (0x01 << 1)
#define CAN_INTEN_RF0MIEN_SHIFT           (1)
#define CAN_INTEN_RF0MIEN(x)              (x << 1)
#define CAN_INTEN_TCIEN_MASK              (0x01 << 0)
#define CAN_INTEN_TCIEN_SHIFT             (0)
#define CAN_INTEN_TCIEN(x)                (x << 0)
#define CAN_ESTS_REC_MASK                 (0xff << 24)
#define CAN_ESTS_REC_SHIFT                (24)
#define CAN_ESTS_REC(x)                   (x << 24)
#define CAN_ESTS_TEC_MASK                 (0xff << 16)
#define CAN_ESTS_TEC_SHIFT                (16)
#define CAN_ESTS_TEC(x)                   (x << 16)
#define CAN_ESTS_ETR_MASK                 (0x07 << 4)
#define CAN_ESTS_ETR_SHIFT                (4)
#define CAN_ESTS_ETR(x)                   (x << 4)
#define CAN_ESTS_BOF_MASK                 (0x01 << 2)
#define CAN_ESTS_BOF_SHIFT                (2)
#define CAN_ESTS_BOF(x)                   (x << 2)
#define CAN_ESTS_EPF_MASK                 (0x01 << 1)
#define CAN_ESTS_EPF_SHIFT                (1)
#define CAN_ESTS_EPF(x)                   (x << 1)
#define CAN_ESTS_EAF_MASK                 (0x01 << 0)
#define CAN_ESTS_EAF_SHIFT                (0)
#define CAN_ESTS_EAF(x)                   (x << 0)
#define CAN_BTMG_LOEN_MASK                (0x01 << 31)
#define CAN_BTMG_LOEN_SHIFT               (31)
#define CAN_BTMG_LOEN(x)                  (x << 31)
#define CAN_BTMG_LBEN_MASK                (0x01 << 30)
#define CAN_BTMG_LBEN_SHIFT               (30)
#define CAN_BTMG_LBEN(x)                  (x << 30)
#define CAN_BTMG_RSAW_MASK                (0x03 << 24)
#define CAN_BTMG_RSAW_SHIFT               (24)
#define CAN_BTMG_RSAW(x)                  (x << 24)
#define CAN_BTMG_BTS2_MASK                (0x07 << 20)
#define CAN_BTMG_BTS2_SHIFT               (20)
#define CAN_BTMG_BTS2(x)                  (x << 20)
#define CAN_BTMG_BTS1_MASK                (0x0f << 16)
#define CAN_BTMG_BTS1_SHIFT               (16)
#define CAN_BTMG_BTS1(x)                  (x << 16)
#define CAN_BTMG_BRDIV_MASK               (0xfff << 0)
#define CAN_BTMG_BRDIV_SHIFT              (0)
#define CAN_BTMG_BRDIV(x)                 (x << 0)
#define CAN_TMI0_TMSID_MASK               (0x7ff << 21)
#define CAN_TMI0_TMSID_SHIFT              (21)
#define CAN_TMI0_TMSID(x)                 (x << 21)
#define CAN_TMI0_TMEID_MASK               (0x3ffff << 3)
#define CAN_TMI0_TMEID_SHIFT              (3)
#define CAN_TMI0_TMEID(x)                 (x << 3)
#define CAN_TMI0_TMIDSEL_MASK             (0x01 << 2)
#define CAN_TMI0_TMIDSEL_SHIFT            (2)
#define CAN_TMI0_TMIDSEL(x)               (x << 2)
#define CAN_TMI0_TMFRSEL_MASK             (0x01 << 1)
#define CAN_TMI0_TMFRSEL_SHIFT            (1)
#define CAN_TMI0_TMFRSEL(x)               (x << 1)
#define CAN_TMI0_TMSR_MASK                (0x01 << 0)
#define CAN_TMI0_TMSR_SHIFT               (0)
#define CAN_TMI0_TMSR(x)                  (x << 0)
#define CAN_TMC0_TMTS_MASK                (0xffff << 16)
#define CAN_TMC0_TMTS_SHIFT               (16)
#define CAN_TMC0_TMTS(x)                  (x << 16)
#define CAN_TMC0_TMTSTEN_MASK             (0x01 << 8)
#define CAN_TMC0_TMTSTEN_SHIFT            (8)
#define CAN_TMC0_TMTSTEN(x)               (x << 8)
#define CAN_TMC0_TMDTBL_MASK              (0x0f << 0)
#define CAN_TMC0_TMDTBL_SHIFT             (0)
#define CAN_TMC0_TMDTBL(x)                (x << 0)
#define CAN_TMDTL0_TMDT3_MASK             (0xff << 24)
#define CAN_TMDTL0_TMDT3_SHIFT            (24)
#define CAN_TMDTL0_TMDT3(x)               (x << 24)
#define CAN_TMDTL0_TMDT2_MASK             (0xff << 16)
#define CAN_TMDTL0_TMDT2_SHIFT            (16)
#define CAN_TMDTL0_TMDT2(x)               (x << 16)
#define CAN_TMDTL0_TMDT1_MASK             (0xff << 8)
#define CAN_TMDTL0_TMDT1_SHIFT            (8)
#define CAN_TMDTL0_TMDT1(x)               (x << 8)
#define CAN_TMDTL0_TMDT0_MASK             (0xff << 0)
#define CAN_TMDTL0_TMDT0_SHIFT            (0)
#define CAN_TMDTL0_TMDT0(x)               (x << 0)
#define CAN_TMDTH0_TMDT7_MASK             (0xff << 24)
#define CAN_TMDTH0_TMDT7_SHIFT            (24)
#define CAN_TMDTH0_TMDT7(x)               (x << 24)
#define CAN_TMDTH0_TMDT6_MASK             (0xff << 16)
#define CAN_TMDTH0_TMDT6_SHIFT            (16)
#define CAN_TMDTH0_TMDT6(x)               (x << 16)
#define CAN_TMDTH0_TMDT5_MASK             (0xff << 8)
#define CAN_TMDTH0_TMDT5_SHIFT            (8)
#define CAN_TMDTH0_TMDT5(x)               (x << 8)
#define CAN_TMDTH0_TMDT4_MASK             (0xff << 0)
#define CAN_TMDTH0_TMDT4_SHIFT            (0)
#define CAN_TMDTH0_TMDT4(x)               (x << 0)
#define CAN_TMI1_TMSID_MASK               (0x7ff << 21)
#define CAN_TMI1_TMSID_SHIFT              (21)
#define CAN_TMI1_TMSID(x)                 (x << 21)
#define CAN_TMI1_TMEID_MASK               (0x3ffff << 3)
#define CAN_TMI1_TMEID_SHIFT              (3)
#define CAN_TMI1_TMEID(x)                 (x << 3)
#define CAN_TMI1_TMIDSEL_MASK             (0x01 << 2)
#define CAN_TMI1_TMIDSEL_SHIFT            (2)
#define CAN_TMI1_TMIDSEL(x)               (x << 2)
#define CAN_TMI1_TMFRSEL_MASK             (0x01 << 1)
#define CAN_TMI1_TMFRSEL_SHIFT            (1)
#define CAN_TMI1_TMFRSEL(x)               (x << 1)
#define CAN_TMI1_TMSR_MASK                (0x01 << 0)
#define CAN_TMI1_TMSR_SHIFT               (0)
#define CAN_TMI1_TMSR(x)                  (x << 0)
#define CAN_TMC1_TMTS_MASK                (0xffff << 16)
#define CAN_TMC1_TMTS_SHIFT               (16)
#define CAN_TMC1_TMTS(x)                  (x << 16)
#define CAN_TMC1_TMTSTEN_MASK             (0x01 << 8)
#define CAN_TMC1_TMTSTEN_SHIFT            (8)
#define CAN_TMC1_TMTSTEN(x)               (x << 8)
#define CAN_TMC1_TMDTBL_MASK              (0x0f << 0)
#define CAN_TMC1_TMDTBL_SHIFT             (0)
#define CAN_TMC1_TMDTBL(x)                (x << 0)
#define CAN_TMDTL1_TMDT3_MASK             (0xff << 24)
#define CAN_TMDTL1_TMDT3_SHIFT            (24)
#define CAN_TMDTL1_TMDT3(x)               (x << 24)
#define CAN_TMDTL1_TMDT2_MASK             (0xff << 16)
#define CAN_TMDTL1_TMDT2_SHIFT            (16)
#define CAN_TMDTL1_TMDT2(x)               (x << 16)
#define CAN_TMDTL1_TMDT1_MASK             (0xff << 8)
#define CAN_TMDTL1_TMDT1_SHIFT            (8)
#define CAN_TMDTL1_TMDT1(x)               (x << 8)
#define CAN_TMDTL1_TMDT0_MASK             (0xff << 0)
#define CAN_TMDTL1_TMDT0_SHIFT            (0)
#define CAN_TMDTL1_TMDT0(x)               (x << 0)
#define CAN_TMDTH1_TMDT7_MASK             (0xff << 24)
#define CAN_TMDTH1_TMDT7_SHIFT            (24)
#define CAN_TMDTH1_TMDT7(x)               (x << 24)
#define CAN_TMDTH1_TMDT6_MASK             (0xff << 16)
#define CAN_TMDTH1_TMDT6_SHIFT            (16)
#define CAN_TMDTH1_TMDT6(x)               (x << 16)
#define CAN_TMDTH1_TMDT5_MASK             (0xff << 8)
#define CAN_TMDTH1_TMDT5_SHIFT            (8)
#define CAN_TMDTH1_TMDT5(x)               (x << 8)
#define CAN_TMDTH1_TMDT4_MASK             (0xff << 0)
#define CAN_TMDTH1_TMDT4_SHIFT            (0)
#define CAN_TMDTH1_TMDT4(x)               (x << 0)
#define CAN_TMI2_TMSID_MASK               (0x7ff << 21)
#define CAN_TMI2_TMSID_SHIFT              (21)
#define CAN_TMI2_TMSID(x)                 (x << 21)
#define CAN_TMI2_TMEID_MASK               (0x3ffff << 3)
#define CAN_TMI2_TMEID_SHIFT              (3)
#define CAN_TMI2_TMEID(x)                 (x << 3)
#define CAN_TMI2_TMIDSEL_MASK             (0x01 << 2)
#define CAN_TMI2_TMIDSEL_SHIFT            (2)
#define CAN_TMI2_TMIDSEL(x)               (x << 2)
#define CAN_TMI2_TMFRSEL_MASK             (0x01 << 1)
#define CAN_TMI2_TMFRSEL_SHIFT            (1)
#define CAN_TMI2_TMFRSEL(x)               (x << 1)
#define CAN_TMI2_TMSR_MASK                (0x01 << 0)
#define CAN_TMI2_TMSR_SHIFT               (0)
#define CAN_TMI2_TMSR(x)                  (x << 0)
#define CAN_TMC2_TMTS_MASK                (0xffff << 16)
#define CAN_TMC2_TMTS_SHIFT               (16)
#define CAN_TMC2_TMTS(x)                  (x << 16)
#define CAN_TMC2_TMTSTEN_MASK             (0x01 << 8)
#define CAN_TMC2_TMTSTEN_SHIFT            (8)
#define CAN_TMC2_TMTSTEN(x)               (x << 8)
#define CAN_TMC2_TMDTBL_MASK              (0x0f << 0)
#define CAN_TMC2_TMDTBL_SHIFT             (0)
#define CAN_TMC2_TMDTBL(x)                (x << 0)
#define CAN_TMDTL2_TMDT3_MASK             (0xff << 24)
#define CAN_TMDTL2_TMDT3_SHIFT            (24)
#define CAN_TMDTL2_TMDT3(x)               (x << 24)
#define CAN_TMDTL2_TMDT2_MASK             (0xff << 16)
#define CAN_TMDTL2_TMDT2_SHIFT            (16)
#define CAN_TMDTL2_TMDT2(x)               (x << 16)
#define CAN_TMDTL2_TMDT1_MASK             (0xff << 8)
#define CAN_TMDTL2_TMDT1_SHIFT            (8)
#define CAN_TMDTL2_TMDT1(x)               (x << 8)
#define CAN_TMDTL2_TMDT0_MASK             (0xff << 0)
#define CAN_TMDTL2_TMDT0_SHIFT            (0)
#define CAN_TMDTL2_TMDT0(x)               (x << 0)
#define CAN_TMDTH2_TMDT7_MASK             (0xff << 24)
#define CAN_TMDTH2_TMDT7_SHIFT            (24)
#define CAN_TMDTH2_TMDT7(x)               (x << 24)
#define CAN_TMDTH2_TMDT6_MASK             (0xff << 16)
#define CAN_TMDTH2_TMDT6_SHIFT            (16)
#define CAN_TMDTH2_TMDT6(x)               (x << 16)
#define CAN_TMDTH2_TMDT5_MASK             (0xff << 8)
#define CAN_TMDTH2_TMDT5_SHIFT            (8)
#define CAN_TMDTH2_TMDT5(x)               (x << 8)
#define CAN_TMDTH2_TMDT4_MASK             (0xff << 0)
#define CAN_TMDTH2_TMDT4_SHIFT            (0)
#define CAN_TMDTH2_TMDT4(x)               (x << 0)
#define CAN_RFI0_RFSID_MASK               (0x7ff << 21)
#define CAN_RFI0_RFSID_SHIFT              (21)
#define CAN_RFI0_RFSID(x)                 (x << 21)
#define CAN_RFI0_RFEID_MASK               (0x3ffff << 3)
#define CAN_RFI0_RFEID_SHIFT              (3)
#define CAN_RFI0_RFEID(x)                 (x << 3)
#define CAN_RFI0_RFIDI_MASK               (0x01 << 2)
#define CAN_RFI0_RFIDI_SHIFT              (2)
#define CAN_RFI0_RFIDI(x)                 (x << 2)
#define CAN_RFI0_RFFRI_MASK               (0x01 << 1)
#define CAN_RFI0_RFFRI_SHIFT              (1)
#define CAN_RFI0_RFFRI(x)                 (x << 1)
#define CAN_RFC0_RFTS_MASK                (0xffff << 16)
#define CAN_RFC0_RFTS_SHIFT               (16)
#define CAN_RFC0_RFTS(x)                  (x << 16)
#define CAN_RFC0_RFFMN_MASK               (0xff << 8)
#define CAN_RFC0_RFFMN_SHIFT              (8)
#define CAN_RFC0_RFFMN(x)                 (x << 8)
#define CAN_RFC0_RFDTL_MASK               (0x0f << 0)
#define CAN_RFC0_RFDTL_SHIFT              (0)
#define CAN_RFC0_RFDTL(x)                 (x << 0)
#define CAN_RFDTL0_RFDT3_MASK             (0xff << 24)
#define CAN_RFDTL0_RFDT3_SHIFT            (24)
#define CAN_RFDTL0_RFDT3(x)               (x << 24)
#define CAN_RFDTL0_RFDT2_MASK             (0xff << 16)
#define CAN_RFDTL0_RFDT2_SHIFT            (16)
#define CAN_RFDTL0_RFDT2(x)               (x << 16)
#define CAN_RFDTL0_RFDT1_MASK             (0xff << 8)
#define CAN_RFDTL0_RFDT1_SHIFT            (8)
#define CAN_RFDTL0_RFDT1(x)               (x << 8)
#define CAN_RFDTL0_RFDT0_MASK             (0xff << 0)
#define CAN_RFDTL0_RFDT0_SHIFT            (0)
#define CAN_RFDTL0_RFDT0(x)               (x << 0)
#define CAN_RFDTH0_RFDT7_MASK             (0xff << 24)
#define CAN_RFDTH0_RFDT7_SHIFT            (24)
#define CAN_RFDTH0_RFDT7(x)               (x << 24)
#define CAN_RFDTH0_RFDT6_MASK             (0xff << 16)
#define CAN_RFDTH0_RFDT6_SHIFT            (16)
#define CAN_RFDTH0_RFDT6(x)               (x << 16)
#define CAN_RFDTH0_RFDT5_MASK             (0xff << 8)
#define CAN_RFDTH0_RFDT5_SHIFT            (8)
#define CAN_RFDTH0_RFDT5(x)               (x << 8)
#define CAN_RFDTH0_RFDT4_MASK             (0xff << 0)
#define CAN_RFDTH0_RFDT4_SHIFT            (0)
#define CAN_RFDTH0_RFDT4(x)               (x << 0)
#define CAN_RFI1_RFSID_MASK               (0x7ff << 21)
#define CAN_RFI1_RFSID_SHIFT              (21)
#define CAN_RFI1_RFSID(x)                 (x << 21)
#define CAN_RFI1_RFEID_MASK               (0x3ffff << 3)
#define CAN_RFI1_RFEID_SHIFT              (3)
#define CAN_RFI1_RFEID(x)                 (x << 3)
#define CAN_RFI1_RFIDI_MASK               (0x01 << 2)
#define CAN_RFI1_RFIDI_SHIFT              (2)
#define CAN_RFI1_RFIDI(x)                 (x << 2)
#define CAN_RFI1_RFFRI_MASK               (0x01 << 1)
#define CAN_RFI1_RFFRI_SHIFT              (1)
#define CAN_RFI1_RFFRI(x)                 (x << 1)
#define CAN_RFC1_RFTS_MASK                (0xffff << 16)
#define CAN_RFC1_RFTS_SHIFT               (16)
#define CAN_RFC1_RFTS(x)                  (x << 16)
#define CAN_RFC1_RFFMN_MASK               (0xff << 8)
#define CAN_RFC1_RFFMN_SHIFT              (8)
#define CAN_RFC1_RFFMN(x)                 (x << 8)
#define CAN_RFC1_RFDTL_MASK               (0x0f << 0)
#define CAN_RFC1_RFDTL_SHIFT              (0)
#define CAN_RFC1_RFDTL(x)                 (x << 0)
#define CAN_RFDTL1_RFDT3_MASK             (0xff << 24)
#define CAN_RFDTL1_RFDT3_SHIFT            (24)
#define CAN_RFDTL1_RFDT3(x)               (x << 24)
#define CAN_RFDTL1_RFDT2_MASK             (0xff << 16)
#define CAN_RFDTL1_RFDT2_SHIFT            (16)
#define CAN_RFDTL1_RFDT2(x)               (x << 16)
#define CAN_RFDTL1_RFDT1_MASK             (0xff << 8)
#define CAN_RFDTL1_RFDT1_SHIFT            (8)
#define CAN_RFDTL1_RFDT1(x)               (x << 8)
#define CAN_RFDTL1_RFDT0_MASK             (0xff << 0)
#define CAN_RFDTL1_RFDT0_SHIFT            (0)
#define CAN_RFDTL1_RFDT0(x)               (x << 0)
#define CAN_RFDTH1_RFDT7_MASK             (0xff << 24)
#define CAN_RFDTH1_RFDT7_SHIFT            (24)
#define CAN_RFDTH1_RFDT7(x)               (x << 24)
#define CAN_RFDTH1_RFDT6_MASK             (0xff << 16)
#define CAN_RFDTH1_RFDT6_SHIFT            (16)
#define CAN_RFDTH1_RFDT6(x)               (x << 16)
#define CAN_RFDTH1_RFDT5_MASK             (0xff << 8)
#define CAN_RFDTH1_RFDT5_SHIFT            (8)
#define CAN_RFDTH1_RFDT5(x)               (x << 8)
#define CAN_RFDTH1_RFDT4_MASK             (0xff << 0)
#define CAN_RFDTH1_RFDT4_SHIFT            (0)
#define CAN_RFDTH1_RFDT4(x)               (x << 0)
#define CAN_FCTRL_FCS_MASK                (0x01 << 0)
#define CAN_FCTRL_FCS_SHIFT               (0)
#define CAN_FCTRL_FCS(x)                  (x << 0)
#define CAN_FMCFG_FMSEL0_MASK             (0x01 << 0)
#define CAN_FMCFG_FMSEL0_SHIFT            (0)
#define CAN_FMCFG_FMSEL0(x)               (x << 0)
#define CAN_FMCFG_FMSEL1_MASK             (0x01 << 1)
#define CAN_FMCFG_FMSEL1_SHIFT            (1)
#define CAN_FMCFG_FMSEL1(x)               (x << 1)
#define CAN_FMCFG_FMSEL2_MASK             (0x01 << 2)
#define CAN_FMCFG_FMSEL2_SHIFT            (2)
#define CAN_FMCFG_FMSEL2(x)               (x << 2)
