eeucalyptus/at32f403a_minimal/at32f403a.h
#define CAN_F4FB1_FFDB4(x)                (x << 4)
#define CAN_F4FB1_FFDB5_MASK              (0x01 << 5)
#define CAN_F4FB1_FFDB5_SHIFT             (5)
#define CAN_F4FB1_FFDB5(x)                (x << 5)
#define CAN_F4FB1_FFDB6_MASK              (0x01 << 6)
#define CAN_F4FB1_FFDB6_SHIFT             (6)
#define CAN_F4FB1_FFDB6(x)                (x << 6)
#define CAN_F4FB1_FFDB7_MASK              (0x01 << 7)
#define CAN_F4FB1_FFDB7_SHIFT             (7)
#define CAN_F4FB1_FFDB7(x)                (x << 7)
#define CAN_F4FB1_FFDB8_MASK              (0x01 << 8)
#define CAN_F4FB1_FFDB8_SHIFT             (8)
#define CAN_F4FB1_FFDB8(x)                (x << 8)
#define CAN_F4FB1_FFDB9_MASK              (0x01 << 9)
#define CAN_F4FB1_FFDB9_SHIFT             (9)
#define CAN_F4FB1_FFDB9(x)                (x << 9)
#define CAN_F4FB1_FFDB10_MASK             (0x01 << 10)
#define CAN_F4FB1_FFDB10_SHIFT            (10)
#define CAN_F4FB1_FFDB10(x)               (x << 10)
#define CAN_F4FB1_FFDB11_MASK             (0x01 << 11)
#define CAN_F4FB1_FFDB11_SHIFT            (11)
#define CAN_F4FB1_FFDB11(x)               (x << 11)
#define CAN_F4FB1_FFDB12_MASK             (0x01 << 12)
#define CAN_F4FB1_FFDB12_SHIFT            (12)
#define CAN_F4FB1_FFDB12(x)               (x << 12)
#define CAN_F4FB1_FFDB13_MASK             (0x01 << 13)
#define CAN_F4FB1_FFDB13_SHIFT            (13)
#define CAN_F4FB1_FFDB13(x)               (x << 13)
#define CAN_F4FB1_FFDB14_MASK             (0x01 << 14)
#define CAN_F4FB1_FFDB14_SHIFT            (14)
#define CAN_F4FB1_FFDB14(x)               (x << 14)
#define CAN_F4FB1_FFDB15_MASK             (0x01 << 15)
#define CAN_F4FB1_FFDB15_SHIFT            (15)
#define CAN_F4FB1_FFDB15(x)               (x << 15)
#define CAN_F4FB1_FFDB16_MASK             (0x01 << 16)
#define CAN_F4FB1_FFDB16_SHIFT            (16)
#define CAN_F4FB1_FFDB16(x)               (x << 16)
#define CAN_F4FB1_FFDB17_MASK             (0x01 << 17)
#define CAN_F4FB1_FFDB17_SHIFT            (17)
#define CAN_F4FB1_FFDB17(x)               (x << 17)
#define CAN_F4FB1_FFDB18_MASK             (0x01 << 18)
#define CAN_F4FB1_FFDB18_SHIFT            (18)
#define CAN_F4FB1_FFDB18(x)               (x << 18)
#define CAN_F4FB1_FFDB19_MASK             (0x01 << 19)
#define CAN_F4FB1_FFDB19_SHIFT            (19)
#define CAN_F4FB1_FFDB19(x)               (x << 19)
#define CAN_F4FB1_FFDB20_MASK             (0x01 << 20)
#define CAN_F4FB1_FFDB20_SHIFT            (20)
#define CAN_F4FB1_FFDB20(x)               (x << 20)
#define CAN_F4FB1_FFDB21_MASK             (0x01 << 21)
#define CAN_F4FB1_FFDB21_SHIFT            (21)
#define CAN_F4FB1_FFDB21(x)               (x << 21)
#define CAN_F4FB1_FFDB22_MASK             (0x01 << 22)
#define CAN_F4FB1_FFDB22_SHIFT            (22)
#define CAN_F4FB1_FFDB22(x)               (x << 22)
#define CAN_F4FB1_FFDB23_MASK             (0x01 << 23)
#define CAN_F4FB1_FFDB23_SHIFT            (23)
#define CAN_F4FB1_FFDB23(x)               (x << 23)
#define CAN_F4FB1_FFDB24_MASK             (0x01 << 24)
#define CAN_F4FB1_FFDB24_SHIFT            (24)
#define CAN_F4FB1_FFDB24(x)               (x << 24)
#define CAN_F4FB1_FFDB25_MASK             (0x01 << 25)
#define CAN_F4FB1_FFDB25_SHIFT            (25)
#define CAN_F4FB1_FFDB25(x)               (x << 25)
#define CAN_F4FB1_FFDB26_MASK             (0x01 << 26)
#define CAN_F4FB1_FFDB26_SHIFT            (26)
#define CAN_F4FB1_FFDB26(x)               (x << 26)
#define CAN_F4FB1_FFDB27_MASK             (0x01 << 27)
#define CAN_F4FB1_FFDB27_SHIFT            (27)
#define CAN_F4FB1_FFDB27(x)               (x << 27)
#define CAN_F4FB1_FFDB28_MASK             (0x01 << 28)
#define CAN_F4FB1_FFDB28_SHIFT            (28)
#define CAN_F4FB1_FFDB28(x)               (x << 28)
#define CAN_F4FB1_FFDB29_MASK             (0x01 << 29)
#define CAN_F4FB1_FFDB29_SHIFT            (29)
#define CAN_F4FB1_FFDB29(x)               (x << 29)
#define CAN_F4FB1_FFDB30_MASK             (0x01 << 30)
#define CAN_F4FB1_FFDB30_SHIFT            (30)
#define CAN_F4FB1_FFDB30(x)               (x << 30)
#define CAN_F4FB1_FFDB31_MASK             (0x01 << 31)
#define CAN_F4FB1_FFDB31_SHIFT            (31)
#define CAN_F4FB1_FFDB31(x)               (x << 31)
#define CAN_F4FB2_FFDB0_MASK              (0x01 << 0)
#define CAN_F4FB2_FFDB0_SHIFT             (0)
#define CAN_F4FB2_FFDB0(x)                (x << 0)
#define CAN_F4FB2_FFDB1_MASK              (0x01 << 1)
#define CAN_F4FB2_FFDB1_SHIFT             (1)
#define CAN_F4FB2_FFDB1(x)                (x << 1)
#define CAN_F4FB2_FFDB2_MASK              (0x01 << 2)
#define CAN_F4FB2_FFDB2_SHIFT             (2)
#define CAN_F4FB2_FFDB2(x)                (x << 2)
#define CAN_F4FB2_FFDB3_MASK              (0x01 << 3)
#define CAN_F4FB2_FFDB3_SHIFT             (3)
#define CAN_F4FB2_FFDB3(x)                (x << 3)
#define CAN_F4FB2_FFDB4_MASK              (0x01 << 4)
#define CAN_F4FB2_FFDB4_SHIFT             (4)
#define CAN_F4FB2_FFDB4(x)                (x << 4)
#define CAN_F4FB2_FFDB5_MASK              (0x01 << 5)
#define CAN_F4FB2_FFDB5_SHIFT             (5)
#define CAN_F4FB2_FFDB5(x)                (x << 5)
#define CAN_F4FB2_FFDB6_MASK              (0x01 << 6)
#define CAN_F4FB2_FFDB6_SHIFT             (6)
#define CAN_F4FB2_FFDB6(x)                (x << 6)
#define CAN_F4FB2_FFDB7_MASK              (0x01 << 7)
#define CAN_F4FB2_FFDB7_SHIFT             (7)
#define CAN_F4FB2_FFDB7(x)                (x << 7)
#define CAN_F4FB2_FFDB8_MASK              (0x01 << 8)
#define CAN_F4FB2_FFDB8_SHIFT             (8)
#define CAN_F4FB2_FFDB8(x)                (x << 8)
#define CAN_F4FB2_FFDB9_MASK              (0x01 << 9)
#define CAN_F4FB2_FFDB9_SHIFT             (9)
#define CAN_F4FB2_FFDB9(x)                (x << 9)
#define CAN_F4FB2_FFDB10_MASK             (0x01 << 10)
#define CAN_F4FB2_FFDB10_SHIFT            (10)
#define CAN_F4FB2_FFDB10(x)               (x << 10)
#define CAN_F4FB2_FFDB11_MASK             (0x01 << 11)
#define CAN_F4FB2_FFDB11_SHIFT            (11)
#define CAN_F4FB2_FFDB11(x)               (x << 11)
#define CAN_F4FB2_FFDB12_MASK             (0x01 << 12)
#define CAN_F4FB2_FFDB12_SHIFT            (12)
#define CAN_F4FB2_FFDB12(x)               (x << 12)
#define CAN_F4FB2_FFDB13_MASK             (0x01 << 13)
#define CAN_F4FB2_FFDB13_SHIFT            (13)
#define CAN_F4FB2_FFDB13(x)               (x << 13)
#define CAN_F4FB2_FFDB14_MASK             (0x01 << 14)
#define CAN_F4FB2_FFDB14_SHIFT            (14)
#define CAN_F4FB2_FFDB14(x)               (x << 14)
#define CAN_F4FB2_FFDB15_MASK             (0x01 << 15)
#define CAN_F4FB2_FFDB15_SHIFT            (15)
#define CAN_F4FB2_FFDB15(x)               (x << 15)
#define CAN_F4FB2_FFDB16_MASK             (0x01 << 16)
#define CAN_F4FB2_FFDB16_SHIFT            (16)
#define CAN_F4FB2_FFDB16(x)               (x << 16)
#define CAN_F4FB2_FFDB17_MASK             (0x01 << 17)
#define CAN_F4FB2_FFDB17_SHIFT            (17)
#define CAN_F4FB2_FFDB17(x)               (x << 17)
#define CAN_F4FB2_FFDB18_MASK             (0x01 << 18)
#define CAN_F4FB2_FFDB18_SHIFT            (18)
#define CAN_F4FB2_FFDB18(x)               (x << 18)
#define CAN_F4FB2_FFDB19_MASK             (0x01 << 19)
#define CAN_F4FB2_FFDB19_SHIFT            (19)
#define CAN_F4FB2_FFDB19(x)               (x << 19)
#define CAN_F4FB2_FFDB20_MASK             (0x01 << 20)
#define CAN_F4FB2_FFDB20_SHIFT            (20)
#define CAN_F4FB2_FFDB20(x)               (x << 20)
#define CAN_F4FB2_FFDB21_MASK             (0x01 << 21)
#define CAN_F4FB2_FFDB21_SHIFT            (21)
#define CAN_F4FB2_FFDB21(x)               (x << 21)
#define CAN_F4FB2_FFDB22_MASK             (0x01 << 22)
#define CAN_F4FB2_FFDB22_SHIFT            (22)
#define CAN_F4FB2_FFDB22(x)               (x << 22)
#define CAN_F4FB2_FFDB23_MASK             (0x01 << 23)
#define CAN_F4FB2_FFDB23_SHIFT            (23)
#define CAN_F4FB2_FFDB23(x)               (x << 23)
#define CAN_F4FB2_FFDB24_MASK             (0x01 << 24)
#define CAN_F4FB2_FFDB24_SHIFT            (24)
#define CAN_F4FB2_FFDB24(x)               (x << 24)
#define CAN_F4FB2_FFDB25_MASK             (0x01 << 25)
#define CAN_F4FB2_FFDB25_SHIFT            (25)
#define CAN_F4FB2_FFDB25(x)               (x << 25)
#define CAN_F4FB2_FFDB26_MASK             (0x01 << 26)
#define CAN_F4FB2_FFDB26_SHIFT            (26)
#define CAN_F4FB2_FFDB26(x)               (x << 26)
#define CAN_F4FB2_FFDB27_MASK             (0x01 << 27)
#define CAN_F4FB2_FFDB27_SHIFT            (27)
#define CAN_F4FB2_FFDB27(x)               (x << 27)
#define CAN_F4FB2_FFDB28_MASK             (0x01 << 28)
#define CAN_F4FB2_FFDB28_SHIFT            (28)
#define CAN_F4FB2_FFDB28(x)               (x << 28)
#define CAN_F4FB2_FFDB29_MASK             (0x01 << 29)
#define CAN_F4FB2_FFDB29_SHIFT            (29)
#define CAN_F4FB2_FFDB29(x)               (x << 29)
#define CAN_F4FB2_FFDB30_MASK             (0x01 << 30)
#define CAN_F4FB2_FFDB30_SHIFT            (30)
#define CAN_F4FB2_FFDB30(x)               (x << 30)
#define CAN_F4FB2_FFDB31_MASK             (0x01 << 31)
#define CAN_F4FB2_FFDB31_SHIFT            (31)
#define CAN_F4FB2_FFDB31(x)               (x << 31)
#define CAN_F5FB1_FFDB0_MASK              (0x01 << 0)
#define CAN_F5FB1_FFDB0_SHIFT             (0)
#define CAN_F5FB1_FFDB0(x)                (x << 0)
#define CAN_F5FB1_FFDB1_MASK              (0x01 << 1)
#define CAN_F5FB1_FFDB1_SHIFT             (1)
#define CAN_F5FB1_FFDB1(x)                (x << 1)
#define CAN_F5FB1_FFDB2_MASK              (0x01 << 2)
#define CAN_F5FB1_FFDB2_SHIFT             (2)
#define CAN_F5FB1_FFDB2(x)                (x << 2)
#define CAN_F5FB1_FFDB3_MASK              (0x01 << 3)
#define CAN_F5FB1_FFDB3_SHIFT             (3)
#define CAN_F5FB1_FFDB3(x)                (x << 3)
#define CAN_F5FB1_FFDB4_MASK              (0x01 << 4)
#define CAN_F5FB1_FFDB4_SHIFT             (4)
#define CAN_F5FB1_FFDB4(x)                (x << 4)
#define CAN_F5FB1_FFDB5_MASK              (0x01 << 5)
#define CAN_F5FB1_FFDB5_SHIFT             (5)
#define CAN_F5FB1_FFDB5(x)                (x << 5)
#define CAN_F5FB1_FFDB6_MASK              (0x01 << 6)
#define CAN_F5FB1_FFDB6_SHIFT             (6)
#define CAN_F5FB1_FFDB6(x)                (x << 6)
#define CAN_F5FB1_FFDB7_MASK              (0x01 << 7)
#define CAN_F5FB1_FFDB7_SHIFT             (7)
#define CAN_F5FB1_FFDB7(x)                (x << 7)
#define CAN_F5FB1_FFDB8_MASK              (0x01 << 8)
#define CAN_F5FB1_FFDB8_SHIFT             (8)
#define CAN_F5FB1_FFDB8(x)                (x << 8)
#define CAN_F5FB1_FFDB9_MASK              (0x01 << 9)
#define CAN_F5FB1_FFDB9_SHIFT             (9)
#define CAN_F5FB1_FFDB9(x)                (x << 9)
#define CAN_F5FB1_FFDB10_MASK             (0x01 << 10)
#define CAN_F5FB1_FFDB10_SHIFT            (10)
#define CAN_F5FB1_FFDB10(x)               (x << 10)
#define CAN_F5FB1_FFDB11_MASK             (0x01 << 11)
#define CAN_F5FB1_FFDB11_SHIFT            (11)
#define CAN_F5FB1_FFDB11(x)               (x << 11)
#define CAN_F5FB1_FFDB12_MASK             (0x01 << 12)
#define CAN_F5FB1_FFDB12_SHIFT            (12)
#define CAN_F5FB1_FFDB12(x)               (x << 12)
#define CAN_F5FB1_FFDB13_MASK             (0x01 << 13)
#define CAN_F5FB1_FFDB13_SHIFT            (13)
#define CAN_F5FB1_FFDB13(x)               (x << 13)
#define CAN_F5FB1_FFDB14_MASK             (0x01 << 14)
#define CAN_F5FB1_FFDB14_SHIFT            (14)
#define CAN_F5FB1_FFDB14(x)               (x << 14)
#define CAN_F5FB1_FFDB15_MASK             (0x01 << 15)
#define CAN_F5FB1_FFDB15_SHIFT            (15)
#define CAN_F5FB1_FFDB15(x)               (x << 15)
#define CAN_F5FB1_FFDB16_MASK             (0x01 << 16)
#define CAN_F5FB1_FFDB16_SHIFT            (16)
#define CAN_F5FB1_FFDB16(x)               (x << 16)
#define CAN_F5FB1_FFDB17_MASK             (0x01 << 17)
#define CAN_F5FB1_FFDB17_SHIFT            (17)
#define CAN_F5FB1_FFDB17(x)               (x << 17)
#define CAN_F5FB1_FFDB18_MASK             (0x01 << 18)
#define CAN_F5FB1_FFDB18_SHIFT            (18)
#define CAN_F5FB1_FFDB18(x)               (x << 18)
#define CAN_F5FB1_FFDB19_MASK             (0x01 << 19)
#define CAN_F5FB1_FFDB19_SHIFT            (19)
#define CAN_F5FB1_FFDB19(x)               (x << 19)
#define CAN_F5FB1_FFDB20_MASK             (0x01 << 20)
#define CAN_F5FB1_FFDB20_SHIFT            (20)
#define CAN_F5FB1_FFDB20(x)               (x << 20)
#define CAN_F5FB1_FFDB21_MASK             (0x01 << 21)
#define CAN_F5FB1_FFDB21_SHIFT            (21)
#define CAN_F5FB1_FFDB21(x)               (x << 21)
#define CAN_F5FB1_FFDB22_MASK             (0x01 << 22)
#define CAN_F5FB1_FFDB22_SHIFT            (22)
#define CAN_F5FB1_FFDB22(x)               (x << 22)
#define CAN_F5FB1_FFDB23_MASK             (0x01 << 23)
#define CAN_F5FB1_FFDB23_SHIFT            (23)
#define CAN_F5FB1_FFDB23(x)               (x << 23)
#define CAN_F5FB1_FFDB24_MASK             (0x01 << 24)
#define CAN_F5FB1_FFDB24_SHIFT            (24)
#define CAN_F5FB1_FFDB24(x)               (x << 24)
#define CAN_F5FB1_FFDB25_MASK             (0x01 << 25)
#define CAN_F5FB1_FFDB25_SHIFT            (25)
#define CAN_F5FB1_FFDB25(x)               (x << 25)
#define CAN_F5FB1_FFDB26_MASK             (0x01 << 26)
#define CAN_F5FB1_FFDB26_SHIFT            (26)
#define CAN_F5FB1_FFDB26(x)               (x << 26)
#define CAN_F5FB1_FFDB27_MASK             (0x01 << 27)
#define CAN_F5FB1_FFDB27_SHIFT            (27)
#define CAN_F5FB1_FFDB27(x)               (x << 27)
#define CAN_F5FB1_FFDB28_MASK             (0x01 << 28)
#define CAN_F5FB1_FFDB28_SHIFT            (28)
#define CAN_F5FB1_FFDB28(x)               (x << 28)
#define CAN_F5FB1_FFDB29_MASK             (0x01 << 29)
#define CAN_F5FB1_FFDB29_SHIFT            (29)
#define CAN_F5FB1_FFDB29(x)               (x << 29)
#define CAN_F5FB1_FFDB30_MASK             (0x01 << 30)
#define CAN_F5FB1_FFDB30_SHIFT            (30)
#define CAN_F5FB1_FFDB30(x)               (x << 30)
#define CAN_F5FB1_FFDB31_MASK             (0x01 << 31)
#define CAN_F5FB1_FFDB31_SHIFT            (31)
#define CAN_F5FB1_FFDB31(x)               (x << 31)
#define CAN_F5FB2_FFDB0_MASK              (0x01 << 0)
#define CAN_F5FB2_FFDB0_SHIFT             (0)
#define CAN_F5FB2_FFDB0(x)                (x << 0)
#define CAN_F5FB2_FFDB1_MASK              (0x01 << 1)
#define CAN_F5FB2_FFDB1_SHIFT             (1)
#define CAN_F5FB2_FFDB1(x)                (x << 1)
#define CAN_F5FB2_FFDB2_MASK              (0x01 << 2)
#define CAN_F5FB2_FFDB2_SHIFT             (2)
#define CAN_F5FB2_FFDB2(x)                (x << 2)
#define CAN_F5FB2_FFDB3_MASK              (0x01 << 3)
#define CAN_F5FB2_FFDB3_SHIFT             (3)
#define CAN_F5FB2_FFDB3(x)                (x << 3)
#define CAN_F5FB2_FFDB4_MASK              (0x01 << 4)
#define CAN_F5FB2_FFDB4_SHIFT             (4)
#define CAN_F5FB2_FFDB4(x)                (x << 4)
#define CAN_F5FB2_FFDB5_MASK              (0x01 << 5)
#define CAN_F5FB2_FFDB5_SHIFT             (5)
#define CAN_F5FB2_FFDB5(x)                (x << 5)
#define CAN_F5FB2_FFDB6_MASK              (0x01 << 6)
#define CAN_F5FB2_FFDB6_SHIFT             (6)
#define CAN_F5FB2_FFDB6(x)                (x << 6)
#define CAN_F5FB2_FFDB7_MASK              (0x01 << 7)
#define CAN_F5FB2_FFDB7_SHIFT             (7)
#define CAN_F5FB2_FFDB7(x)                (x << 7)
#define CAN_F5FB2_FFDB8_MASK              (0x01 << 8)
#define CAN_F5FB2_FFDB8_SHIFT             (8)
#define CAN_F5FB2_FFDB8(x)                (x << 8)
#define CAN_F5FB2_FFDB9_MASK              (0x01 << 9)
#define CAN_F5FB2_FFDB9_SHIFT             (9)
#define CAN_F5FB2_FFDB9(x)                (x << 9)
#define CAN_F5FB2_FFDB10_MASK             (0x01 << 10)
#define CAN_F5FB2_FFDB10_SHIFT            (10)
#define CAN_F5FB2_FFDB10(x)               (x << 10)
#define CAN_F5FB2_FFDB11_MASK             (0x01 << 11)
#define CAN_F5FB2_FFDB11_SHIFT            (11)
#define CAN_F5FB2_FFDB11(x)               (x << 11)
#define CAN_F5FB2_FFDB12_MASK             (0x01 << 12)
#define CAN_F5FB2_FFDB12_SHIFT            (12)
#define CAN_F5FB2_FFDB12(x)               (x << 12)
#define CAN_F5FB2_FFDB13_MASK             (0x01 << 13)
#define CAN_F5FB2_FFDB13_SHIFT            (13)
#define CAN_F5FB2_FFDB13(x)               (x << 13)
#define CAN_F5FB2_FFDB14_MASK             (0x01 << 14)
#define CAN_F5FB2_FFDB14_SHIFT            (14)
#define CAN_F5FB2_FFDB14(x)               (x << 14)
#define CAN_F5FB2_FFDB15_MASK             (0x01 << 15)
#define CAN_F5FB2_FFDB15_SHIFT            (15)
#define CAN_F5FB2_FFDB15(x)               (x << 15)
#define CAN_F5FB2_FFDB16_MASK             (0x01 << 16)
#define CAN_F5FB2_FFDB16_SHIFT            (16)
#define CAN_F5FB2_FFDB16(x)               (x << 16)
#define CAN_F5FB2_FFDB17_MASK             (0x01 << 17)
#define CAN_F5FB2_FFDB17_SHIFT            (17)
#define CAN_F5FB2_FFDB17(x)               (x << 17)
#define CAN_F5FB2_FFDB18_MASK             (0x01 << 18)
#define CAN_F5FB2_FFDB18_SHIFT            (18)
#define CAN_F5FB2_FFDB18(x)               (x << 18)
#define CAN_F5FB2_FFDB19_MASK             (0x01 << 19)
#define CAN_F5FB2_FFDB19_SHIFT            (19)
#define CAN_F5FB2_FFDB19(x)               (x << 19)
#define CAN_F5FB2_FFDB20_MASK             (0x01 << 20)
#define CAN_F5FB2_FFDB20_SHIFT            (20)
#define CAN_F5FB2_FFDB20(x)               (x << 20)
#define CAN_F5FB2_FFDB21_MASK             (0x01 << 21)
#define CAN_F5FB2_FFDB21_SHIFT            (21)
#define CAN_F5FB2_FFDB21(x)               (x << 21)
#define CAN_F5FB2_FFDB22_MASK             (0x01 << 22)
#define CAN_F5FB2_FFDB22_SHIFT            (22)
#define CAN_F5FB2_FFDB22(x)               (x << 22)
#define CAN_F5FB2_FFDB23_MASK             (0x01 << 23)
#define CAN_F5FB2_FFDB23_SHIFT            (23)
#define CAN_F5FB2_FFDB23(x)               (x << 23)
#define CAN_F5FB2_FFDB24_MASK             (0x01 << 24)
#define CAN_F5FB2_FFDB24_SHIFT            (24)
#define CAN_F5FB2_FFDB24(x)               (x << 24)
#define CAN_F5FB2_FFDB25_MASK             (0x01 << 25)
#define CAN_F5FB2_FFDB25_SHIFT            (25)
#define CAN_F5FB2_FFDB25(x)               (x << 25)
#define CAN_F5FB2_FFDB26_MASK             (0x01 << 26)
#define CAN_F5FB2_FFDB26_SHIFT            (26)
#define CAN_F5FB2_FFDB26(x)               (x << 26)
#define CAN_F5FB2_FFDB27_MASK             (0x01 << 27)
#define CAN_F5FB2_FFDB27_SHIFT            (27)
#define CAN_F5FB2_FFDB27(x)               (x << 27)
#define CAN_F5FB2_FFDB28_MASK             (0x01 << 28)
#define CAN_F5FB2_FFDB28_SHIFT            (28)
#define CAN_F5FB2_FFDB28(x)               (x << 28)
#define CAN_F5FB2_FFDB29_MASK             (0x01 << 29)
#define CAN_F5FB2_FFDB29_SHIFT            (29)
#define CAN_F5FB2_FFDB29(x)               (x << 29)
#define CAN_F5FB2_FFDB30_MASK             (0x01 << 30)
#define CAN_F5FB2_FFDB30_SHIFT            (30)
#define CAN_F5FB2_FFDB30(x)               (x << 30)
#define CAN_F5FB2_FFDB31_MASK             (0x01 << 31)
#define CAN_F5FB2_FFDB31_SHIFT            (31)
#define CAN_F5FB2_FFDB31(x)               (x << 31)
#define CAN_F6FB1_FFDB0_MASK              (0x01 << 0)
#define CAN_F6FB1_FFDB0_SHIFT             (0)
#define CAN_F6FB1_FFDB0(x)                (x << 0)
#define CAN_F6FB1_FFDB1_MASK              (0x01 << 1)
#define CAN_F6FB1_FFDB1_SHIFT             (1)
#define CAN_F6FB1_FFDB1(x)                (x << 1)
#define CAN_F6FB1_FFDB2_MASK              (0x01 << 2)
#define CAN_F6FB1_FFDB2_SHIFT             (2)
#define CAN_F6FB1_FFDB2(x)                (x << 2)
#define CAN_F6FB1_FFDB3_MASK              (0x01 << 3)
#define CAN_F6FB1_FFDB3_SHIFT             (3)
#define CAN_F6FB1_FFDB3(x)                (x << 3)
#define CAN_F6FB1_FFDB4_MASK              (0x01 << 4)
#define CAN_F6FB1_FFDB4_SHIFT             (4)
#define CAN_F6FB1_FFDB4(x)                (x << 4)
#define CAN_F6FB1_FFDB5_MASK              (0x01 << 5)
#define CAN_F6FB1_FFDB5_SHIFT             (5)
#define CAN_F6FB1_FFDB5(x)                (x << 5)
#define CAN_F6FB1_FFDB6_MASK              (0x01 << 6)
#define CAN_F6FB1_FFDB6_SHIFT             (6)
#define CAN_F6FB1_FFDB6(x)                (x << 6)
#define CAN_F6FB1_FFDB7_MASK              (0x01 << 7)
#define CAN_F6FB1_FFDB7_SHIFT             (7)
#define CAN_F6FB1_FFDB7(x)                (x << 7)
#define CAN_F6FB1_FFDB8_MASK              (0x01 << 8)
#define CAN_F6FB1_FFDB8_SHIFT             (8)
#define CAN_F6FB1_FFDB8(x)                (x << 8)
#define CAN_F6FB1_FFDB9_MASK              (0x01 << 9)
#define CAN_F6FB1_FFDB9_SHIFT             (9)
#define CAN_F6FB1_FFDB9(x)                (x << 9)
#define CAN_F6FB1_FFDB10_MASK             (0x01 << 10)
#define CAN_F6FB1_FFDB10_SHIFT            (10)
#define CAN_F6FB1_FFDB10(x)               (x << 10)
#define CAN_F6FB1_FFDB11_MASK             (0x01 << 11)
#define CAN_F6FB1_FFDB11_SHIFT            (11)
#define CAN_F6FB1_FFDB11(x)               (x << 11)
#define CAN_F6FB1_FFDB12_MASK             (0x01 << 12)
#define CAN_F6FB1_FFDB12_SHIFT            (12)
#define CAN_F6FB1_FFDB12(x)               (x << 12)
#define CAN_F6FB1_FFDB13_MASK             (0x01 << 13)
#define CAN_F6FB1_FFDB13_SHIFT            (13)
#define CAN_F6FB1_FFDB13(x)               (x << 13)
#define CAN_F6FB1_FFDB14_MASK             (0x01 << 14)
#define CAN_F6FB1_FFDB14_SHIFT            (14)
#define CAN_F6FB1_FFDB14(x)               (x << 14)
#define CAN_F6FB1_FFDB15_MASK             (0x01 << 15)
#define CAN_F6FB1_FFDB15_SHIFT            (15)
#define CAN_F6FB1_FFDB15(x)               (x << 15)
#define CAN_F6FB1_FFDB16_MASK             (0x01 << 16)
#define CAN_F6FB1_FFDB16_SHIFT            (16)
#define CAN_F6FB1_FFDB16(x)               (x << 16)
#define CAN_F6FB1_FFDB17_MASK             (0x01 << 17)
#define CAN_F6FB1_FFDB17_SHIFT            (17)
#define CAN_F6FB1_FFDB17(x)               (x << 17)
#define CAN_F6FB1_FFDB18_MASK             (0x01 << 18)
#define CAN_F6FB1_FFDB18_SHIFT            (18)
#define CAN_F6FB1_FFDB18(x)               (x << 18)
#define CAN_F6FB1_FFDB19_MASK             (0x01 << 19)
#define CAN_F6FB1_FFDB19_SHIFT            (19)
#define CAN_F6FB1_FFDB19(x)               (x << 19)
#define CAN_F6FB1_FFDB20_MASK             (0x01 << 20)
#define CAN_F6FB1_FFDB20_SHIFT            (20)
#define CAN_F6FB1_FFDB20(x)               (x << 20)
#define CAN_F6FB1_FFDB21_MASK             (0x01 << 21)
#define CAN_F6FB1_FFDB21_SHIFT            (21)
#define CAN_F6FB1_FFDB21(x)               (x << 21)
#define CAN_F6FB1_FFDB22_MASK             (0x01 << 22)
#define CAN_F6FB1_FFDB22_SHIFT            (22)
#define CAN_F6FB1_FFDB22(x)               (x << 22)
#define CAN_F6FB1_FFDB23_MASK             (0x01 << 23)
#define CAN_F6FB1_FFDB23_SHIFT            (23)
#define CAN_F6FB1_FFDB23(x)               (x << 23)
#define CAN_F6FB1_FFDB24_MASK             (0x01 << 24)
#define CAN_F6FB1_FFDB24_SHIFT            (24)
#define CAN_F6FB1_FFDB24(x)               (x << 24)
#define CAN_F6FB1_FFDB25_MASK             (0x01 << 25)
#define CAN_F6FB1_FFDB25_SHIFT            (25)
#define CAN_F6FB1_FFDB25(x)               (x << 25)
#define CAN_F6FB1_FFDB26_MASK             (0x01 << 26)
#define CAN_F6FB1_FFDB26_SHIFT            (26)
#define CAN_F6FB1_FFDB26(x)               (x << 26)
#define CAN_F6FB1_FFDB27_MASK             (0x01 << 27)
#define CAN_F6FB1_FFDB27_SHIFT            (27)
#define CAN_F6FB1_FFDB27(x)               (x << 27)
#define CAN_F6FB1_FFDB28_MASK             (0x01 << 28)
#define CAN_F6FB1_FFDB28_SHIFT            (28)
#define CAN_F6FB1_FFDB28(x)               (x << 28)
#define CAN_F6FB1_FFDB29_MASK             (0x01 << 29)
#define CAN_F6FB1_FFDB29_SHIFT            (29)
#define CAN_F6FB1_FFDB29(x)               (x << 29)
#define CAN_F6FB1_FFDB30_MASK             (0x01 << 30)
#define CAN_F6FB1_FFDB30_SHIFT            (30)
#define CAN_F6FB1_FFDB30(x)               (x << 30)
#define CAN_F6FB1_FFDB31_MASK             (0x01 << 31)
#define CAN_F6FB1_FFDB31_SHIFT            (31)
#define CAN_F6FB1_FFDB31(x)               (x << 31)
#define CAN_F6FB2_FFDB0_MASK              (0x01 << 0)
#define CAN_F6FB2_FFDB0_SHIFT             (0)
#define CAN_F6FB2_FFDB0(x)                (x << 0)
#define CAN_F6FB2_FFDB1_MASK              (0x01 << 1)
