eeucalyptus/at32f403a_minimal/at32f403a.h
#define CAN_F13FB2_FFDB23_SHIFT           (23)
#define CAN_F13FB2_FFDB23(x)              (x << 23)
#define CAN_F13FB2_FFDB24_MASK            (0x01 << 24)
#define CAN_F13FB2_FFDB24_SHIFT           (24)
#define CAN_F13FB2_FFDB24(x)              (x << 24)
#define CAN_F13FB2_FFDB25_MASK            (0x01 << 25)
#define CAN_F13FB2_FFDB25_SHIFT           (25)
#define CAN_F13FB2_FFDB25(x)              (x << 25)
#define CAN_F13FB2_FFDB26_MASK            (0x01 << 26)
#define CAN_F13FB2_FFDB26_SHIFT           (26)
#define CAN_F13FB2_FFDB26(x)              (x << 26)
#define CAN_F13FB2_FFDB27_MASK            (0x01 << 27)
#define CAN_F13FB2_FFDB27_SHIFT           (27)
#define CAN_F13FB2_FFDB27(x)              (x << 27)
#define CAN_F13FB2_FFDB28_MASK            (0x01 << 28)
#define CAN_F13FB2_FFDB28_SHIFT           (28)
#define CAN_F13FB2_FFDB28(x)              (x << 28)
#define CAN_F13FB2_FFDB29_MASK            (0x01 << 29)
#define CAN_F13FB2_FFDB29_SHIFT           (29)
#define CAN_F13FB2_FFDB29(x)              (x << 29)
#define CAN_F13FB2_FFDB30_MASK            (0x01 << 30)
#define CAN_F13FB2_FFDB30_SHIFT           (30)
#define CAN_F13FB2_FFDB30(x)              (x << 30)
#define CAN_F13FB2_FFDB31_MASK            (0x01 << 31)
#define CAN_F13FB2_FFDB31_SHIFT           (31)
#define CAN_F13FB2_FFDB31(x)              (x << 31)

/* DAC - Digital to analog converter */
#define DAC_CTRL_D1EN_MASK                (0x01 << 0)
#define DAC_CTRL_D1EN_SHIFT               (0)
#define DAC_CTRL_D1EN(x)                  (x << 0)
#define DAC_CTRL_D1OBDIS_MASK             (0x01 << 1)
#define DAC_CTRL_D1OBDIS_SHIFT            (1)
#define DAC_CTRL_D1OBDIS(x)               (x << 1)
#define DAC_CTRL_D1TRGEN_MASK             (0x01 << 2)
#define DAC_CTRL_D1TRGEN_SHIFT            (2)
#define DAC_CTRL_D1TRGEN(x)               (x << 2)
#define DAC_CTRL_D1TRGSEL_MASK            (0x07 << 3)
#define DAC_CTRL_D1TRGSEL_SHIFT           (3)
#define DAC_CTRL_D1TRGSEL(x)              (x << 3)
#define DAC_CTRL_D1NM_MASK                (0x03 << 6)
#define DAC_CTRL_D1NM_SHIFT               (6)
#define DAC_CTRL_D1NM(x)                  (x << 6)
#define DAC_CTRL_D1NBSEL_MASK             (0x0f << 8)
#define DAC_CTRL_D1NBSEL_SHIFT            (8)
#define DAC_CTRL_D1NBSEL(x)               (x << 8)
#define DAC_CTRL_D1DMAEN_MASK             (0x01 << 12)
#define DAC_CTRL_D1DMAEN_SHIFT            (12)
#define DAC_CTRL_D1DMAEN(x)               (x << 12)
#define DAC_CTRL_D2EN_MASK                (0x01 << 16)
#define DAC_CTRL_D2EN_SHIFT               (16)
#define DAC_CTRL_D2EN(x)                  (x << 16)
#define DAC_CTRL_D2OBDIS_MASK             (0x01 << 17)
#define DAC_CTRL_D2OBDIS_SHIFT            (17)
#define DAC_CTRL_D2OBDIS(x)               (x << 17)
#define DAC_CTRL_D2TRGEN_MASK             (0x01 << 18)
#define DAC_CTRL_D2TRGEN_SHIFT            (18)
#define DAC_CTRL_D2TRGEN(x)               (x << 18)
#define DAC_CTRL_D2TRGSEL_MASK            (0x07 << 19)
#define DAC_CTRL_D2TRGSEL_SHIFT           (19)
#define DAC_CTRL_D2TRGSEL(x)              (x << 19)
#define DAC_CTRL_D2NM_MASK                (0x03 << 22)
#define DAC_CTRL_D2NM_SHIFT               (22)
#define DAC_CTRL_D2NM(x)                  (x << 22)
#define DAC_CTRL_D2NBSEL_MASK             (0x0f << 24)
#define DAC_CTRL_D2NBSEL_SHIFT            (24)
#define DAC_CTRL_D2NBSEL(x)               (x << 24)
#define DAC_CTRL_D2DMAEN_MASK             (0x01 << 28)
#define DAC_CTRL_D2DMAEN_SHIFT            (28)
#define DAC_CTRL_D2DMAEN(x)               (x << 28)
#define DAC_SWTRG_D1SWTRG_MASK            (0x01 << 0)
#define DAC_SWTRG_D1SWTRG_SHIFT           (0)
#define DAC_SWTRG_D1SWTRG(x)              (x << 0)
#define DAC_SWTRG_D2SWTRG_MASK            (0x01 << 1)
#define DAC_SWTRG_D2SWTRG_SHIFT           (1)
#define DAC_SWTRG_D2SWTRG(x)              (x << 1)
#define DAC_D1DTH12R_D1DT12R_MASK         (0xfff << 0)
#define DAC_D1DTH12R_D1DT12R_SHIFT        (0)
#define DAC_D1DTH12R_D1DT12R(x)           (x << 0)
#define DAC_D1DTH12L_D1DT12L_MASK         (0xfff << 4)
#define DAC_D1DTH12L_D1DT12L_SHIFT        (4)
#define DAC_D1DTH12L_D1DT12L(x)           (x << 4)
#define DAC_D1DTH8R_D1DT8R_MASK           (0xff << 0)
#define DAC_D1DTH8R_D1DT8R_SHIFT          (0)
#define DAC_D1DTH8R_D1DT8R(x)             (x << 0)
#define DAC_D2DTH12R_D2DT12R_MASK         (0xfff << 0)
#define DAC_D2DTH12R_D2DT12R_SHIFT        (0)
#define DAC_D2DTH12R_D2DT12R(x)           (x << 0)
#define DAC_D2DTH12L_D2DT12L_MASK         (0xfff << 4)
#define DAC_D2DTH12L_D2DT12L_SHIFT        (4)
#define DAC_D2DTH12L_D2DT12L(x)           (x << 4)
#define DAC_D2DTH8R_D2DT8R_MASK           (0xff << 0)
#define DAC_D2DTH8R_D2DT8R_SHIFT          (0)
#define DAC_D2DTH8R_D2DT8R(x)             (x << 0)
#define DAC_DDTH12R_DD1DT12R_MASK         (0xfff << 0)
#define DAC_DDTH12R_DD1DT12R_SHIFT        (0)
#define DAC_DDTH12R_DD1DT12R(x)           (x << 0)
#define DAC_DDTH12R_DD2DT12R_MASK         (0xfff << 16)
#define DAC_DDTH12R_DD2DT12R_SHIFT        (16)
#define DAC_DDTH12R_DD2DT12R(x)           (x << 16)
#define DAC_DDTH12L_DD1DT12L_MASK         (0xfff << 4)
#define DAC_DDTH12L_DD1DT12L_SHIFT        (4)
#define DAC_DDTH12L_DD1DT12L(x)           (x << 4)
#define DAC_DDTH12L_DD2DT12L_MASK         (0xfff << 20)
#define DAC_DDTH12L_DD2DT12L_SHIFT        (20)
#define DAC_DDTH12L_DD2DT12L(x)           (x << 20)
#define DAC_DDTH8R_DD1DT8R_MASK           (0xff << 0)
#define DAC_DDTH8R_DD1DT8R_SHIFT          (0)
#define DAC_DDTH8R_DD1DT8R(x)             (x << 0)
#define DAC_DDTH8R_DD2DT8R_MASK           (0xff << 8)
#define DAC_DDTH8R_DD2DT8R_SHIFT          (8)
#define DAC_DDTH8R_DD2DT8R(x)             (x << 8)
#define DAC_D1ODT_D1ODT_MASK              (0xfff << 0)
#define DAC_D1ODT_D1ODT_SHIFT             (0)
#define DAC_D1ODT_D1ODT(x)                (x << 0)
#define DAC_D2ODT_D2ODT_MASK              (0xfff << 0)
#define DAC_D2ODT_D2ODT_SHIFT             (0)
#define DAC_D2ODT_D2ODT(x)                (x << 0)

/* DEBUG - Debug support */
#define DEBUG_IDCODE_PID_MASK             (0xffffffff << 0)
#define DEBUG_IDCODE_PID_SHIFT            (0)
#define DEBUG_IDCODE_PID(x)               (x << 0)
#define DEBUG_CTRL_SLEEP_DEBUG_MASK       (0x01 << 0)
#define DEBUG_CTRL_SLEEP_DEBUG_SHIFT      (0)
#define DEBUG_CTRL_SLEEP_DEBUG(x)         (x << 0)
#define DEBUG_CTRL_DEEPSLEEP_DEBUG_MASK   (0x01 << 1)
#define DEBUG_CTRL_DEEPSLEEP_DEBUG_SHIFT  (1)
#define DEBUG_CTRL_DEEPSLEEP_DEBUG(x)     (x << 1)
#define DEBUG_CTRL_STANDBY_DEBUG_MASK     (0x01 << 2)
#define DEBUG_CTRL_STANDBY_DEBUG_SHIFT    (2)
#define DEBUG_CTRL_STANDBY_DEBUG(x)       (x << 2)
#define DEBUG_CTRL_TRACE_IOEN_MASK        (0x01 << 5)
#define DEBUG_CTRL_TRACE_IOEN_SHIFT       (5)
#define DEBUG_CTRL_TRACE_IOEN(x)          (x << 5)
#define DEBUG_CTRL_TRACE_MODE_MASK        (0x03 << 6)
#define DEBUG_CTRL_TRACE_MODE_SHIFT       (6)
#define DEBUG_CTRL_TRACE_MODE(x)          (x << 6)
#define DEBUG_CTRL_WDT_PAUSE_MASK         (0x01 << 8)
#define DEBUG_CTRL_WDT_PAUSE_SHIFT        (8)
#define DEBUG_CTRL_WDT_PAUSE(x)           (x << 8)
#define DEBUG_CTRL_WWDT_PAUSE_MASK        (0x01 << 9)
#define DEBUG_CTRL_WWDT_PAUSE_SHIFT       (9)
#define DEBUG_CTRL_WWDT_PAUSE(x)          (x << 9)
#define DEBUG_CTRL_TMR1_PAUSE_MASK        (0x01 << 10)
#define DEBUG_CTRL_TMR1_PAUSE_SHIFT       (10)
#define DEBUG_CTRL_TMR1_PAUSE(x)          (x << 10)
#define DEBUG_CTRL_TMR2_PAUSE_MASK        (0x01 << 11)
#define DEBUG_CTRL_TMR2_PAUSE_SHIFT       (11)
#define DEBUG_CTRL_TMR2_PAUSE(x)          (x << 11)
#define DEBUG_CTRL_TMR3_PAUSE_MASK        (0x01 << 12)
#define DEBUG_CTRL_TMR3_PAUSE_SHIFT       (12)
#define DEBUG_CTRL_TMR3_PAUSE(x)          (x << 12)
#define DEBUG_CTRL_TMR4_PAUSE_MASK        (0x01 << 13)
#define DEBUG_CTRL_TMR4_PAUSE_SHIFT       (13)
#define DEBUG_CTRL_TMR4_PAUSE(x)          (x << 13)
#define DEBUG_CTRL_CAN1_PAUSE_MASK        (0x01 << 14)
#define DEBUG_CTRL_CAN1_PAUSE_SHIFT       (14)
#define DEBUG_CTRL_CAN1_PAUSE(x)          (x << 14)
#define DEBUG_CTRL_I2C1_SMBUS_TIMEOUT_MASK (0x01 << 15)
#define DEBUG_CTRL_I2C1_SMBUS_TIMEOUT_SHIFT (15)
#define DEBUG_CTRL_I2C1_SMBUS_TIMEOUT(x)  (x << 15)
#define DEBUG_CTRL_I2C2_SMBUS_TIMEOUT_MASK (0x01 << 16)
#define DEBUG_CTRL_I2C2_SMBUS_TIMEOUT_SHIFT (16)
#define DEBUG_CTRL_I2C2_SMBUS_TIMEOUT(x)  (x << 16)
#define DEBUG_CTRL_TMR8_PAUSE_MASK        (0x01 << 17)
#define DEBUG_CTRL_TMR8_PAUSE_SHIFT       (17)
#define DEBUG_CTRL_TMR8_PAUSE(x)          (x << 17)
#define DEBUG_CTRL_TMR5_PAUSE_MASK        (0x01 << 18)
#define DEBUG_CTRL_TMR5_PAUSE_SHIFT       (18)
#define DEBUG_CTRL_TMR5_PAUSE(x)          (x << 18)
#define DEBUG_CTRL_TMR6_PAUSE_MASK        (0x01 << 19)
#define DEBUG_CTRL_TMR6_PAUSE_SHIFT       (19)
#define DEBUG_CTRL_TMR6_PAUSE(x)          (x << 19)
#define DEBUG_CTRL_TMR7_PAUSE_MASK        (0x01 << 20)
#define DEBUG_CTRL_TMR7_PAUSE_SHIFT       (20)
#define DEBUG_CTRL_TMR7_PAUSE(x)          (x << 20)
#define DEBUG_CTRL_CAN2_PAUSE_MASK        (0x01 << 21)
#define DEBUG_CTRL_CAN2_PAUSE_SHIFT       (21)
#define DEBUG_CTRL_CAN2_PAUSE(x)          (x << 21)
#define DEBUG_CTRL_TMR12_PAUSE_MASK       (0x01 << 25)
#define DEBUG_CTRL_TMR12_PAUSE_SHIFT      (25)
#define DEBUG_CTRL_TMR12_PAUSE(x)         (x << 25)
#define DEBUG_CTRL_TMR13_PAUSE_MASK       (0x01 << 26)
#define DEBUG_CTRL_TMR13_PAUSE_SHIFT      (26)
#define DEBUG_CTRL_TMR13_PAUSE(x)         (x << 26)
#define DEBUG_CTRL_TMR14_PAUSE_MASK       (0x01 << 27)
#define DEBUG_CTRL_TMR14_PAUSE_SHIFT      (27)
#define DEBUG_CTRL_TMR14_PAUSE(x)         (x << 27)
#define DEBUG_CTRL_TMR9_PAUSE_MASK        (0x01 << 28)
#define DEBUG_CTRL_TMR9_PAUSE_SHIFT       (28)
#define DEBUG_CTRL_TMR9_PAUSE(x)          (x << 28)
#define DEBUG_CTRL_TMR10_PAUSE_MASK       (0x01 << 29)
#define DEBUG_CTRL_TMR10_PAUSE_SHIFT      (29)
#define DEBUG_CTRL_TMR10_PAUSE(x)         (x << 29)
#define DEBUG_CTRL_TMR11_PAUSE_MASK       (0x01 << 30)
#define DEBUG_CTRL_TMR11_PAUSE_SHIFT      (30)
#define DEBUG_CTRL_TMR11_PAUSE(x)         (x << 30)
#define DEBUG_CTRL_I2C3_SMBUS_TIMEOUT_MASK (0x01 << 31)
#define DEBUG_CTRL_I2C3_SMBUS_TIMEOUT_SHIFT (31)
#define DEBUG_CTRL_I2C3_SMBUS_TIMEOUT(x)  (x << 31)

