eeucalyptus/at32f403a_minimal/at32f403a.h
/* CRC - CRC calculation unit */
#define CRC_DT_DT_MASK                    (0xffffffff << 0)
#define CRC_DT_DT_SHIFT                   (0)
#define CRC_DT_DT(x)                      (x << 0)
#define CRC_CDT_CDT_MASK                  (0x01 << 0)
#define CRC_CDT_CDT_SHIFT                 (0)
#define CRC_CDT_CDT(x)                    (x << 0)
#define CRC_CTRL_RST_MASK                 (0x01 << 0)
#define CRC_CTRL_RST_SHIFT                (0)
#define CRC_CTRL_RST(x)                   (x << 0)
#define CRC_CTRL_REVID_MASK               (0x03 << 5)
#define CRC_CTRL_REVID_SHIFT              (5)
#define CRC_CTRL_REVID(x)                 (x << 5)
#define CRC_CTRL_REVOD_MASK               (0x01 << 7)
#define CRC_CTRL_REVOD_SHIFT              (7)
#define CRC_CTRL_REVOD(x)                 (x << 7)
#define CRC_IDT_IDT_MASK                  (0xffffffff << 0)
#define CRC_IDT_IDT_SHIFT                 (0)
#define CRC_IDT_IDT(x)                    (x << 0)

/* FLASH - Flash memory controler */
#define FLASH_UNLOCK_UKVAL_MASK           (0xffffffff << 0)
#define FLASH_UNLOCK_UKVAL_SHIFT          (0)
#define FLASH_UNLOCK_UKVAL(x)             (x << 0)
#define FLASH_USD_UNLOCK_USD_UKVAL_MASK   (0xffffffff << 0)
#define FLASH_USD_UNLOCK_USD_UKVAL_SHIFT  (0)
#define FLASH_USD_UNLOCK_USD_UKVAL(x)     (x << 0)
#define FLASH_STS_ODF_MASK                (0x01 << 5)
#define FLASH_STS_ODF_SHIFT               (5)
#define FLASH_STS_ODF(x)                  (x << 5)
#define FLASH_STS_EPPERR_MASK             (0x01 << 4)
#define FLASH_STS_EPPERR_SHIFT            (4)
#define FLASH_STS_EPPERR(x)               (x << 4)
#define FLASH_STS_PRGMERR_MASK            (0x01 << 2)
#define FLASH_STS_PRGMERR_SHIFT           (2)
#define FLASH_STS_PRGMERR(x)              (x << 2)
#define FLASH_STS_OBF_MASK                (0x01 << 0)
#define FLASH_STS_OBF_SHIFT               (0)
#define FLASH_STS_OBF(x)                  (x << 0)
#define FLASH_CTRL_FPRGM_MASK             (0x01 << 0)
#define FLASH_CTRL_FPRGM_SHIFT            (0)
#define FLASH_CTRL_FPRGM(x)               (x << 0)
#define FLASH_CTRL_SECERS_MASK            (0x01 << 1)
#define FLASH_CTRL_SECERS_SHIFT           (1)
#define FLASH_CTRL_SECERS(x)              (x << 1)
#define FLASH_CTRL_BANKERS_MASK           (0x01 << 2)
#define FLASH_CTRL_BANKERS_SHIFT          (2)
#define FLASH_CTRL_BANKERS(x)             (x << 2)
#define FLASH_CTRL_USDPRGM_MASK           (0x01 << 4)
#define FLASH_CTRL_USDPRGM_SHIFT          (4)
#define FLASH_CTRL_USDPRGM(x)             (x << 4)
#define FLASH_CTRL_USDERS_MASK            (0x01 << 5)
#define FLASH_CTRL_USDERS_SHIFT           (5)
#define FLASH_CTRL_USDERS(x)              (x << 5)
#define FLASH_CTRL_ERSTR_MASK             (0x01 << 6)
#define FLASH_CTRL_ERSTR_SHIFT            (6)
#define FLASH_CTRL_ERSTR(x)               (x << 6)
#define FLASH_CTRL_OPLK_MASK              (0x01 << 7)
#define FLASH_CTRL_OPLK_SHIFT             (7)
#define FLASH_CTRL_OPLK(x)                (x << 7)
#define FLASH_CTRL_USDULKS_MASK           (0x01 << 9)
#define FLASH_CTRL_USDULKS_SHIFT          (9)
#define FLASH_CTRL_USDULKS(x)             (x << 9)
#define FLASH_CTRL_ERRIE_MASK             (0x01 << 10)
#define FLASH_CTRL_ERRIE_SHIFT            (10)
#define FLASH_CTRL_ERRIE(x)               (x << 10)
#define FLASH_CTRL_ODFIE_MASK             (0x01 << 12)
#define FLASH_CTRL_ODFIE_SHIFT            (12)
#define FLASH_CTRL_ODFIE(x)               (x << 12)
#define FLASH_ADDR_FA_MASK                (0xffffffff << 0)
#define FLASH_ADDR_FA_SHIFT               (0)
#define FLASH_ADDR_FA(x)                  (x << 0)
#define FLASH_USD_USDERR_MASK             (0x01 << 0)
#define FLASH_USD_USDERR_SHIFT            (0)
#define FLASH_USD_USDERR(x)               (x << 0)
#define FLASH_USD_FAP_MASK                (0x01 << 1)
#define FLASH_USD_FAP_SHIFT               (1)
#define FLASH_USD_FAP(x)                  (x << 1)
#define FLASH_USD_nWDT_ATO_EN_MASK        (0x01 << 2)
#define FLASH_USD_nWDT_ATO_EN_SHIFT       (2)
#define FLASH_USD_nWDT_ATO_EN(x)          (x << 2)
#define FLASH_USD_nDEPSLP_RST_MASK        (0x01 << 3)
#define FLASH_USD_nDEPSLP_RST_SHIFT       (3)
#define FLASH_USD_nDEPSLP_RST(x)          (x << 3)
#define FLASH_USD_nSTDBY_RST_MASK         (0x01 << 4)
#define FLASH_USD_nSTDBY_RST_SHIFT        (4)
#define FLASH_USD_nSTDBY_RST(x)           (x << 4)
#define FLASH_USD_BTOPT_MASK              (0x01 << 5)
#define FLASH_USD_BTOPT_SHIFT             (5)
#define FLASH_USD_BTOPT(x)                (x << 5)
#define FLASH_USD_USER_D0_MASK            (0xff << 10)
#define FLASH_USD_USER_D0_SHIFT           (10)
#define FLASH_USD_USER_D0(x)              (x << 10)
#define FLASH_USD_USER_D1_MASK            (0xff << 18)
#define FLASH_USD_USER_D1_SHIFT           (18)
#define FLASH_USD_USER_D1(x)              (x << 18)
#define FLASH_EPPS_EPPS_MASK              (0xffffffff << 0)
#define FLASH_EPPS_EPPS_SHIFT             (0)
#define FLASH_EPPS_EPPS(x)                (x << 0)
#define FLASH_UNLOCK2_UKVAL_MASK          (0xffffffff << 0)
#define FLASH_UNLOCK2_UKVAL_SHIFT         (0)
#define FLASH_UNLOCK2_UKVAL(x)            (x << 0)
#define FLASH_STS2_OBF_MASK               (0x01 << 0)
#define FLASH_STS2_OBF_SHIFT              (0)
#define FLASH_STS2_OBF(x)                 (x << 0)
#define FLASH_STS2_PRGMERR_MASK           (0x01 << 2)
#define FLASH_STS2_PRGMERR_SHIFT          (2)
#define FLASH_STS2_PRGMERR(x)             (x << 2)
#define FLASH_STS2_EPPERR_MASK            (0x01 << 4)
#define FLASH_STS2_EPPERR_SHIFT           (4)
#define FLASH_STS2_EPPERR(x)              (x << 4)
#define FLASH_STS2_ODF_MASK               (0x01 << 5)
#define FLASH_STS2_ODF_SHIFT              (5)
#define FLASH_STS2_ODF(x)                 (x << 5)
#define FLASH_CTRL2_FPRGM_MASK            (0x01 << 0)
#define FLASH_CTRL2_FPRGM_SHIFT           (0)
#define FLASH_CTRL2_FPRGM(x)              (x << 0)
#define FLASH_CTRL2_SECERS_MASK           (0x01 << 1)
#define FLASH_CTRL2_SECERS_SHIFT          (1)
#define FLASH_CTRL2_SECERS(x)             (x << 1)
#define FLASH_CTRL2_BANKERS_MASK          (0x01 << 2)
#define FLASH_CTRL2_BANKERS_SHIFT         (2)
#define FLASH_CTRL2_BANKERS(x)            (x << 2)
#define FLASH_CTRL2_ERSTR_MASK            (0x01 << 6)
#define FLASH_CTRL2_ERSTR_SHIFT           (6)
#define FLASH_CTRL2_ERSTR(x)              (x << 6)
#define FLASH_CTRL2_OPLK_MASK             (0x01 << 7)
#define FLASH_CTRL2_OPLK_SHIFT            (7)
#define FLASH_CTRL2_OPLK(x)               (x << 7)
#define FLASH_CTRL2_ERRIE_MASK            (0x01 << 10)
#define FLASH_CTRL2_ERRIE_SHIFT           (10)
#define FLASH_CTRL2_ERRIE(x)              (x << 10)
#define FLASH_CTRL2_ODFIE_MASK            (0x01 << 12)
#define FLASH_CTRL2_ODFIE_SHIFT           (12)
#define FLASH_CTRL2_ODFIE(x)              (x << 12)
#define FLASH_ADDR2_FA_MASK               (0xffffffff << 0)
#define FLASH_ADDR2_FA_SHIFT              (0)
#define FLASH_ADDR2_FA(x)                 (x << 0)
#define FLASH_UNLOCK3_UKVAL_MASK          (0xffffffff << 0)
#define FLASH_UNLOCK3_UKVAL_SHIFT         (0)
#define FLASH_UNLOCK3_UKVAL(x)            (x << 0)
#define FLASH_SELECT_SELECT_MASK          (0xffffffff << 0)
#define FLASH_SELECT_SELECT_SHIFT         (0)
#define FLASH_SELECT_SELECT(x)            (x << 0)
#define FLASH_STS3_OBF_MASK               (0x01 << 0)
#define FLASH_STS3_OBF_SHIFT              (0)
#define FLASH_STS3_OBF(x)                 (x << 0)
#define FLASH_STS3_PRGMERR_MASK           (0x01 << 2)
#define FLASH_STS3_PRGMERR_SHIFT          (2)
#define FLASH_STS3_PRGMERR(x)             (x << 2)
#define FLASH_STS3_EPPERR_MASK            (0x01 << 4)
#define FLASH_STS3_EPPERR_SHIFT           (4)
#define FLASH_STS3_EPPERR(x)              (x << 4)
#define FLASH_STS3_ODF_MASK               (0x01 << 5)
#define FLASH_STS3_ODF_SHIFT              (5)
#define FLASH_STS3_ODF(x)                 (x << 5)
#define FLASH_CTRL3_FPRGM_MASK            (0x01 << 0)
#define FLASH_CTRL3_FPRGM_SHIFT           (0)
#define FLASH_CTRL3_FPRGM(x)              (x << 0)
#define FLASH_CTRL3_SECERS_MASK           (0x01 << 1)
#define FLASH_CTRL3_SECERS_SHIFT          (1)
#define FLASH_CTRL3_SECERS(x)             (x << 1)
#define FLASH_CTRL3_CHPERS_MASK           (0x01 << 2)
#define FLASH_CTRL3_CHPERS_SHIFT          (2)
#define FLASH_CTRL3_CHPERS(x)             (x << 2)
#define FLASH_CTRL3_ERSTR_MASK            (0x01 << 6)
#define FLASH_CTRL3_ERSTR_SHIFT           (6)
#define FLASH_CTRL3_ERSTR(x)              (x << 6)
#define FLASH_CTRL3_OPLK_MASK             (0x01 << 7)
#define FLASH_CTRL3_OPLK_SHIFT            (7)
#define FLASH_CTRL3_OPLK(x)               (x << 7)
#define FLASH_CTRL3_ERRIE_MASK            (0x01 << 10)
#define FLASH_CTRL3_ERRIE_SHIFT           (10)
#define FLASH_CTRL3_ERRIE(x)              (x << 10)
#define FLASH_CTRL3_ODFIE_MASK            (0x01 << 12)
#define FLASH_CTRL3_ODFIE_SHIFT           (12)
#define FLASH_CTRL3_ODFIE(x)              (x << 12)
#define FLASH_ADDR3_FA_MASK               (0xffffffff << 0)
#define FLASH_ADDR3_FA_SHIFT              (0)
#define FLASH_ADDR3_FA(x)                 (x << 0)
#define FLASH_DA_FDA_MASK                 (0xffffffff << 0)
#define FLASH_DA_FDA_SHIFT                (0)
#define FLASH_DA_FDA(x)                   (x << 0)
#define FLASH_SLIB_STS0_SLIB_ENF_MASK     (0x01 << 3)
#define FLASH_SLIB_STS0_SLIB_ENF_SHIFT    (3)
#define FLASH_SLIB_STS0_SLIB_ENF(x)       (x << 3)
#define FLASH_SLIB_STS1_SLIB_SS_MASK      (0x7ff << 0)
#define FLASH_SLIB_STS1_SLIB_SS_SHIFT     (0)
#define FLASH_SLIB_STS1_SLIB_SS(x)        (x << 0)
#define FLASH_SLIB_STS1_SLIB_DAT_SS_MASK  (0x7ff << 11)
#define FLASH_SLIB_STS1_SLIB_DAT_SS_SHIFT (11)
#define FLASH_SLIB_STS1_SLIB_DAT_SS(x)    (x << 11)
#define FLASH_SLIB_STS1_SLIB_ES_MASK      (0x3ff << 22)
#define FLASH_SLIB_STS1_SLIB_ES_SHIFT     (22)
#define FLASH_SLIB_STS1_SLIB_ES(x)        (x << 22)
#define FLASH_SLIB_PWD_CLR_SLIB_PCLR_VAL_MASK (0xffffffff << 0)
#define FLASH_SLIB_PWD_CLR_SLIB_PCLR_VAL_SHIFT (0)
#define FLASH_SLIB_PWD_CLR_SLIB_PCLR_VAL(x) (x << 0)
#define FLASH_SLIB_MISC_STS_SLIB_PWD_ERR_MASK (0x01 << 0)
#define FLASH_SLIB_MISC_STS_SLIB_PWD_ERR_SHIFT (0)
#define FLASH_SLIB_MISC_STS_SLIB_PWD_ERR(x) (x << 0)
#define FLASH_SLIB_MISC_STS_SLIB_PWD_OK_MASK (0x01 << 1)
#define FLASH_SLIB_MISC_STS_SLIB_PWD_OK_SHIFT (1)
#define FLASH_SLIB_MISC_STS_SLIB_PWD_OK(x) (x << 1)
#define FLASH_SLIB_MISC_STS_SLIB_ULKF_MASK (0x01 << 2)
#define FLASH_SLIB_MISC_STS_SLIB_ULKF_SHIFT (2)
#define FLASH_SLIB_MISC_STS_SLIB_ULKF(x)  (x << 2)
#define FLASH_SLIB_MISC_STS_SLIB_RCNT_MASK (0x1ff << 16)
#define FLASH_SLIB_MISC_STS_SLIB_RCNT_SHIFT (16)
#define FLASH_SLIB_MISC_STS_SLIB_RCNT(x)  (x << 16)
#define FLASH_SLIB_SET_PWD_SLIB_PSET_VAL_MASK (0xffffffff << 0)
#define FLASH_SLIB_SET_PWD_SLIB_PSET_VAL_SHIFT (0)
#define FLASH_SLIB_SET_PWD_SLIB_PSET_VAL(x) (x << 0)
#define FLASH_SLIB_SET_RANGE_SLIB_SS_SET_MASK (0x7ff << 0)
#define FLASH_SLIB_SET_RANGE_SLIB_SS_SET_SHIFT (0)
#define FLASH_SLIB_SET_RANGE_SLIB_SS_SET(x) (x << 0)
#define FLASH_SLIB_SET_RANGE_SLIB_DSS_SET_MASK (0x7ff << 11)
#define FLASH_SLIB_SET_RANGE_SLIB_DSS_SET_SHIFT (11)
#define FLASH_SLIB_SET_RANGE_SLIB_DSS_SET(x) (x << 11)
#define FLASH_SLIB_SET_RANGE_SLIB_ES_SET_MASK (0x3ff << 22)
#define FLASH_SLIB_SET_RANGE_SLIB_ES_SET_SHIFT (22)
#define FLASH_SLIB_SET_RANGE_SLIB_ES_SET(x) (x << 22)
#define FLASH_SLIB_UNLOCK_SLIB_UKVAL_MASK (0xffffffff << 0)
#define FLASH_SLIB_UNLOCK_SLIB_UKVAL_SHIFT (0)
#define FLASH_SLIB_UNLOCK_SLIB_UKVAL(x)   (x << 0)
#define FLASH_CRC_CTRL_CRC_SS_MASK        (0xfff << 0)
#define FLASH_CRC_CTRL_CRC_SS_SHIFT       (0)
#define FLASH_CRC_CTRL_CRC_SS(x)          (x << 0)
#define FLASH_CRC_CTRL_CRC_SN_MASK        (0xfff << 12)
#define FLASH_CRC_CTRL_CRC_SN_SHIFT       (12)
#define FLASH_CRC_CTRL_CRC_SN(x)          (x << 12)
#define FLASH_CRC_CTRL_CRC_STRT_MASK      (0x01 << 31)
#define FLASH_CRC_CTRL_CRC_STRT_SHIFT     (31)
#define FLASH_CRC_CTRL_CRC_STRT(x)        (x << 31)
#define FLASH_CRC_CHKR_CRC_CHKR_MASK      (0xffffffff << 0)
#define FLASH_CRC_CHKR_CRC_CHKR_SHIFT     (0)
#define FLASH_CRC_CHKR_CRC_CHKR(x)        (x << 0)

/* NVIC - Nested Vectored Interrupt Controller */
#define NVIC_ICTR_INTLINESNUM_MASK        (0x0f << 0)
#define NVIC_ICTR_INTLINESNUM_SHIFT       (0)
#define NVIC_ICTR_INTLINESNUM(x)          (x << 0)
#define NVIC_STIR_INTID_MASK              (0x1ff << 0)
#define NVIC_STIR_INTID_SHIFT             (0)
#define NVIC_STIR_INTID(x)                (x << 0)
#define NVIC_ISER0_SETENA_MASK            (0xffffffff << 0)
#define NVIC_ISER0_SETENA_SHIFT           (0)
#define NVIC_ISER0_SETENA(x)              (x << 0)
#define NVIC_ISER1_SETENA_MASK            (0xffffffff << 0)
#define NVIC_ISER1_SETENA_SHIFT           (0)
#define NVIC_ISER1_SETENA(x)              (x << 0)
#define NVIC_ICER0_CLRENA_MASK            (0xffffffff << 0)
#define NVIC_ICER0_CLRENA_SHIFT           (0)
#define NVIC_ICER0_CLRENA(x)              (x << 0)
#define NVIC_ICER1_CLRENA_MASK            (0xffffffff << 0)
#define NVIC_ICER1_CLRENA_SHIFT           (0)
#define NVIC_ICER1_CLRENA(x)              (x << 0)
#define NVIC_ISPR0_SETPEND_MASK           (0xffffffff << 0)
#define NVIC_ISPR0_SETPEND_SHIFT          (0)
#define NVIC_ISPR0_SETPEND(x)             (x << 0)
#define NVIC_ISPR1_SETPEND_MASK           (0xffffffff << 0)
#define NVIC_ISPR1_SETPEND_SHIFT          (0)
#define NVIC_ISPR1_SETPEND(x)             (x << 0)
#define NVIC_ICPR0_CLRPEND_MASK           (0xffffffff << 0)
#define NVIC_ICPR0_CLRPEND_SHIFT          (0)
#define NVIC_ICPR0_CLRPEND(x)             (x << 0)
#define NVIC_ICPR1_CLRPEND_MASK           (0xffffffff << 0)
#define NVIC_ICPR1_CLRPEND_SHIFT          (0)
#define NVIC_ICPR1_CLRPEND(x)             (x << 0)
#define NVIC_IABR0_ACTIVE_MASK            (0xffffffff << 0)
#define NVIC_IABR0_ACTIVE_SHIFT           (0)
#define NVIC_IABR0_ACTIVE(x)              (x << 0)
#define NVIC_IABR1_ACTIVE_MASK            (0xffffffff << 0)
#define NVIC_IABR1_ACTIVE_SHIFT           (0)
#define NVIC_IABR1_ACTIVE(x)              (x << 0)
#define NVIC_IPR0_IPR_N0_MASK             (0xff << 0)
#define NVIC_IPR0_IPR_N0_SHIFT            (0)
#define NVIC_IPR0_IPR_N0(x)               (x << 0)
#define NVIC_IPR0_IPR_N1_MASK             (0xff << 8)
#define NVIC_IPR0_IPR_N1_SHIFT            (8)
#define NVIC_IPR0_IPR_N1(x)               (x << 8)
#define NVIC_IPR0_IPR_N2_MASK             (0xff << 16)
#define NVIC_IPR0_IPR_N2_SHIFT            (16)
#define NVIC_IPR0_IPR_N2(x)               (x << 16)
#define NVIC_IPR0_IPR_N3_MASK             (0xff << 24)
#define NVIC_IPR0_IPR_N3_SHIFT            (24)
#define NVIC_IPR0_IPR_N3(x)               (x << 24)
#define NVIC_IPR1_IPR_N0_MASK             (0xff << 0)
#define NVIC_IPR1_IPR_N0_SHIFT            (0)
#define NVIC_IPR1_IPR_N0(x)               (x << 0)
#define NVIC_IPR1_IPR_N1_MASK             (0xff << 8)
#define NVIC_IPR1_IPR_N1_SHIFT            (8)
#define NVIC_IPR1_IPR_N1(x)               (x << 8)
#define NVIC_IPR1_IPR_N2_MASK             (0xff << 16)
#define NVIC_IPR1_IPR_N2_SHIFT            (16)
#define NVIC_IPR1_IPR_N2(x)               (x << 16)
#define NVIC_IPR1_IPR_N3_MASK             (0xff << 24)
#define NVIC_IPR1_IPR_N3_SHIFT            (24)
#define NVIC_IPR1_IPR_N3(x)               (x << 24)
#define NVIC_IPR2_IPR_N0_MASK             (0xff << 0)
#define NVIC_IPR2_IPR_N0_SHIFT            (0)
#define NVIC_IPR2_IPR_N0(x)               (x << 0)
#define NVIC_IPR2_IPR_N1_MASK             (0xff << 8)
#define NVIC_IPR2_IPR_N1_SHIFT            (8)
#define NVIC_IPR2_IPR_N1(x)               (x << 8)
#define NVIC_IPR2_IPR_N2_MASK             (0xff << 16)
#define NVIC_IPR2_IPR_N2_SHIFT            (16)
#define NVIC_IPR2_IPR_N2(x)               (x << 16)
#define NVIC_IPR2_IPR_N3_MASK             (0xff << 24)
#define NVIC_IPR2_IPR_N3_SHIFT            (24)
#define NVIC_IPR2_IPR_N3(x)               (x << 24)
#define NVIC_IPR3_IPR_N0_MASK             (0xff << 0)
#define NVIC_IPR3_IPR_N0_SHIFT            (0)
#define NVIC_IPR3_IPR_N0(x)               (x << 0)
#define NVIC_IPR3_IPR_N1_MASK             (0xff << 8)
#define NVIC_IPR3_IPR_N1_SHIFT            (8)
#define NVIC_IPR3_IPR_N1(x)               (x << 8)
#define NVIC_IPR3_IPR_N2_MASK             (0xff << 16)
#define NVIC_IPR3_IPR_N2_SHIFT            (16)
#define NVIC_IPR3_IPR_N2(x)               (x << 16)
#define NVIC_IPR3_IPR_N3_MASK             (0xff << 24)
#define NVIC_IPR3_IPR_N3_SHIFT            (24)
#define NVIC_IPR3_IPR_N3(x)               (x << 24)
#define NVIC_IPR4_IPR_N0_MASK             (0xff << 0)
#define NVIC_IPR4_IPR_N0_SHIFT            (0)
#define NVIC_IPR4_IPR_N0(x)               (x << 0)
#define NVIC_IPR4_IPR_N1_MASK             (0xff << 8)
#define NVIC_IPR4_IPR_N1_SHIFT            (8)
#define NVIC_IPR4_IPR_N1(x)               (x << 8)
#define NVIC_IPR4_IPR_N2_MASK             (0xff << 16)
#define NVIC_IPR4_IPR_N2_SHIFT            (16)
#define NVIC_IPR4_IPR_N2(x)               (x << 16)
#define NVIC_IPR4_IPR_N3_MASK             (0xff << 24)
#define NVIC_IPR4_IPR_N3_SHIFT            (24)
#define NVIC_IPR4_IPR_N3(x)               (x << 24)
#define NVIC_IPR5_IPR_N0_MASK             (0xff << 0)
#define NVIC_IPR5_IPR_N0_SHIFT            (0)
#define NVIC_IPR5_IPR_N0(x)               (x << 0)
#define NVIC_IPR5_IPR_N1_MASK             (0xff << 8)
#define NVIC_IPR5_IPR_N1_SHIFT            (8)
#define NVIC_IPR5_IPR_N1(x)               (x << 8)
#define NVIC_IPR5_IPR_N2_MASK             (0xff << 16)
#define NVIC_IPR5_IPR_N2_SHIFT            (16)
#define NVIC_IPR5_IPR_N2(x)               (x << 16)
#define NVIC_IPR5_IPR_N3_MASK             (0xff << 24)
#define NVIC_IPR5_IPR_N3_SHIFT            (24)
#define NVIC_IPR5_IPR_N3(x)               (x << 24)
#define NVIC_IPR6_IPR_N0_MASK             (0xff << 0)
#define NVIC_IPR6_IPR_N0_SHIFT            (0)
#define NVIC_IPR6_IPR_N0(x)               (x << 0)
#define NVIC_IPR6_IPR_N1_MASK             (0xff << 8)
#define NVIC_IPR6_IPR_N1_SHIFT            (8)
#define NVIC_IPR6_IPR_N1(x)               (x << 8)
#define NVIC_IPR6_IPR_N2_MASK             (0xff << 16)
#define NVIC_IPR6_IPR_N2_SHIFT            (16)
#define NVIC_IPR6_IPR_N2(x)               (x << 16)
#define NVIC_IPR6_IPR_N3_MASK             (0xff << 24)
#define NVIC_IPR6_IPR_N3_SHIFT            (24)
#define NVIC_IPR6_IPR_N3(x)               (x << 24)
#define NVIC_IPR7_IPR_N0_MASK             (0xff << 0)
#define NVIC_IPR7_IPR_N0_SHIFT            (0)
#define NVIC_IPR7_IPR_N0(x)               (x << 0)
#define NVIC_IPR7_IPR_N1_MASK             (0xff << 8)
#define NVIC_IPR7_IPR_N1_SHIFT            (8)
#define NVIC_IPR7_IPR_N1(x)               (x << 8)
#define NVIC_IPR7_IPR_N2_MASK             (0xff << 16)
#define NVIC_IPR7_IPR_N2_SHIFT            (16)
#define NVIC_IPR7_IPR_N2(x)               (x << 16)
#define NVIC_IPR7_IPR_N3_MASK             (0xff << 24)
#define NVIC_IPR7_IPR_N3_SHIFT            (24)
#define NVIC_IPR7_IPR_N3(x)               (x << 24)
#define NVIC_IPR8_IPR_N0_MASK             (0xff << 0)
#define NVIC_IPR8_IPR_N0_SHIFT            (0)
#define NVIC_IPR8_IPR_N0(x)               (x << 0)
#define NVIC_IPR8_IPR_N1_MASK             (0xff << 8)
#define NVIC_IPR8_IPR_N1_SHIFT            (8)
#define NVIC_IPR8_IPR_N1(x)               (x << 8)
#define NVIC_IPR8_IPR_N2_MASK             (0xff << 16)
#define NVIC_IPR8_IPR_N2_SHIFT            (16)
#define NVIC_IPR8_IPR_N2(x)               (x << 16)
#define NVIC_IPR8_IPR_N3_MASK             (0xff << 24)
#define NVIC_IPR8_IPR_N3_SHIFT            (24)
#define NVIC_IPR8_IPR_N3(x)               (x << 24)
#define NVIC_IPR9_IPR_N0_MASK             (0xff << 0)
#define NVIC_IPR9_IPR_N0_SHIFT            (0)
#define NVIC_IPR9_IPR_N0(x)               (x << 0)
#define NVIC_IPR9_IPR_N1_MASK             (0xff << 8)
#define NVIC_IPR9_IPR_N1_SHIFT            (8)
#define NVIC_IPR9_IPR_N1(x)               (x << 8)
#define NVIC_IPR9_IPR_N2_MASK             (0xff << 16)
#define NVIC_IPR9_IPR_N2_SHIFT            (16)
#define NVIC_IPR9_IPR_N2(x)               (x << 16)
#define NVIC_IPR9_IPR_N3_MASK             (0xff << 24)
#define NVIC_IPR9_IPR_N3_SHIFT            (24)
#define NVIC_IPR9_IPR_N3(x)               (x << 24)
#define NVIC_IPR10_IPR_N0_MASK            (0xff << 0)
#define NVIC_IPR10_IPR_N0_SHIFT           (0)
#define NVIC_IPR10_IPR_N0(x)              (x << 0)
#define NVIC_IPR10_IPR_N1_MASK            (0xff << 8)
#define NVIC_IPR10_IPR_N1_SHIFT           (8)
#define NVIC_IPR10_IPR_N1(x)              (x << 8)
#define NVIC_IPR10_IPR_N2_MASK            (0xff << 16)
#define NVIC_IPR10_IPR_N2_SHIFT           (16)
#define NVIC_IPR10_IPR_N2(x)              (x << 16)
#define NVIC_IPR10_IPR_N3_MASK            (0xff << 24)
#define NVIC_IPR10_IPR_N3_SHIFT           (24)
#define NVIC_IPR10_IPR_N3(x)              (x << 24)
#define NVIC_IPR11_IPR_N0_MASK            (0xff << 0)
#define NVIC_IPR11_IPR_N0_SHIFT           (0)
#define NVIC_IPR11_IPR_N0(x)              (x << 0)
#define NVIC_IPR11_IPR_N1_MASK            (0xff << 8)
#define NVIC_IPR11_IPR_N1_SHIFT           (8)
#define NVIC_IPR11_IPR_N1(x)              (x << 8)
#define NVIC_IPR11_IPR_N2_MASK            (0xff << 16)
#define NVIC_IPR11_IPR_N2_SHIFT           (16)
#define NVIC_IPR11_IPR_N2(x)              (x << 16)
#define NVIC_IPR11_IPR_N3_MASK            (0xff << 24)
#define NVIC_IPR11_IPR_N3_SHIFT           (24)
#define NVIC_IPR11_IPR_N3(x)              (x << 24)
#define NVIC_IPR12_IPR_N0_MASK            (0xff << 0)
#define NVIC_IPR12_IPR_N0_SHIFT           (0)
#define NVIC_IPR12_IPR_N0(x)              (x << 0)
#define NVIC_IPR12_IPR_N1_MASK            (0xff << 8)
#define NVIC_IPR12_IPR_N1_SHIFT           (8)
#define NVIC_IPR12_IPR_N1(x)              (x << 8)
#define NVIC_IPR12_IPR_N2_MASK            (0xff << 16)
#define NVIC_IPR12_IPR_N2_SHIFT           (16)
#define NVIC_IPR12_IPR_N2(x)              (x << 16)
#define NVIC_IPR12_IPR_N3_MASK            (0xff << 24)
#define NVIC_IPR12_IPR_N3_SHIFT           (24)
#define NVIC_IPR12_IPR_N3(x)              (x << 24)
#define NVIC_IPR13_IPR_N0_MASK            (0xff << 0)
#define NVIC_IPR13_IPR_N0_SHIFT           (0)
#define NVIC_IPR13_IPR_N0(x)              (x << 0)
#define NVIC_IPR13_IPR_N1_MASK            (0xff << 8)
#define NVIC_IPR13_IPR_N1_SHIFT           (8)
#define NVIC_IPR13_IPR_N1(x)              (x << 8)
#define NVIC_IPR13_IPR_N2_MASK            (0xff << 16)
#define NVIC_IPR13_IPR_N2_SHIFT           (16)
#define NVIC_IPR13_IPR_N2(x)              (x << 16)
#define NVIC_IPR13_IPR_N3_MASK            (0xff << 24)
#define NVIC_IPR13_IPR_N3_SHIFT           (24)
#define NVIC_IPR13_IPR_N3(x)              (x << 24)
#define NVIC_IPR14_IPR_N0_MASK            (0xff << 0)
#define NVIC_IPR14_IPR_N0_SHIFT           (0)
#define NVIC_IPR14_IPR_N0(x)              (x << 0)
#define NVIC_IPR14_IPR_N1_MASK            (0xff << 8)
#define NVIC_IPR14_IPR_N1_SHIFT           (8)
#define NVIC_IPR14_IPR_N1(x)              (x << 8)
#define NVIC_IPR14_IPR_N2_MASK            (0xff << 16)
#define NVIC_IPR14_IPR_N2_SHIFT           (16)
#define NVIC_IPR14_IPR_N2(x)              (x << 16)
#define NVIC_IPR14_IPR_N3_MASK            (0xff << 24)
#define NVIC_IPR14_IPR_N3_SHIFT           (24)
#define NVIC_IPR14_IPR_N3(x)              (x << 24)

