eeucalyptus/at32f403a_minimal/at32f403a.h
/* USBFS - Universal serial bus full-speed device interface */
#define USBFS_EPT0_EPTADDR_MASK           (0x0f << 0)
#define USBFS_EPT0_EPTADDR_SHIFT          (0)
#define USBFS_EPT0_EPTADDR(x)             (x << 0)
#define USBFS_EPT0_TXSTS_MASK             (0x03 << 4)
#define USBFS_EPT0_TXSTS_SHIFT            (4)
#define USBFS_EPT0_TXSTS(x)               (x << 4)
#define USBFS_EPT0_TXDTS_MASK             (0x01 << 6)
#define USBFS_EPT0_TXDTS_SHIFT            (6)
#define USBFS_EPT0_TXDTS(x)               (x << 6)
#define USBFS_EPT0_TXTC_MASK              (0x01 << 7)
#define USBFS_EPT0_TXTC_SHIFT             (7)
#define USBFS_EPT0_TXTC(x)                (x << 7)
#define USBFS_EPT0_EXF_MASK               (0x01 << 8)
#define USBFS_EPT0_EXF_SHIFT              (8)
#define USBFS_EPT0_EXF(x)                 (x << 8)
#define USBFS_EPT0_TRANS_TYPE_MASK        (0x03 << 9)
#define USBFS_EPT0_TRANS_TYPE_SHIFT       (9)
#define USBFS_EPT0_TRANS_TYPE(x)          (x << 9)
#define USBFS_EPT0_SETUPTC_MASK           (0x01 << 11)
#define USBFS_EPT0_SETUPTC_SHIFT          (11)
#define USBFS_EPT0_SETUPTC(x)             (x << 11)
#define USBFS_EPT0_RXSTS_MASK             (0x03 << 12)
#define USBFS_EPT0_RXSTS_SHIFT            (12)
#define USBFS_EPT0_RXSTS(x)               (x << 12)
#define USBFS_EPT0_RXDTS_MASK             (0x01 << 14)
#define USBFS_EPT0_RXDTS_SHIFT            (14)
#define USBFS_EPT0_RXDTS(x)               (x << 14)
#define USBFS_EPT0_RXTC_MASK              (0x01 << 15)
#define USBFS_EPT0_RXTC_SHIFT             (15)
#define USBFS_EPT0_RXTC(x)                (x << 15)
#define USBFS_EPT1_EPTADDR_MASK           (0x0f << 0)
#define USBFS_EPT1_EPTADDR_SHIFT          (0)
#define USBFS_EPT1_EPTADDR(x)             (x << 0)
#define USBFS_EPT1_TXSTS_MASK             (0x03 << 4)
#define USBFS_EPT1_TXSTS_SHIFT            (4)
#define USBFS_EPT1_TXSTS(x)               (x << 4)
#define USBFS_EPT1_TXDTS_MASK             (0x01 << 6)
#define USBFS_EPT1_TXDTS_SHIFT            (6)
#define USBFS_EPT1_TXDTS(x)               (x << 6)
#define USBFS_EPT1_TXTC_MASK              (0x01 << 7)
#define USBFS_EPT1_TXTC_SHIFT             (7)
#define USBFS_EPT1_TXTC(x)                (x << 7)
#define USBFS_EPT1_EXF_MASK               (0x01 << 8)
#define USBFS_EPT1_EXF_SHIFT              (8)
#define USBFS_EPT1_EXF(x)                 (x << 8)
#define USBFS_EPT1_TRANS_TYPE_MASK        (0x03 << 9)
#define USBFS_EPT1_TRANS_TYPE_SHIFT       (9)
#define USBFS_EPT1_TRANS_TYPE(x)          (x << 9)
#define USBFS_EPT1_SETUPTC_MASK           (0x01 << 11)
#define USBFS_EPT1_SETUPTC_SHIFT          (11)
#define USBFS_EPT1_SETUPTC(x)             (x << 11)
#define USBFS_EPT1_RXSTS_MASK             (0x03 << 12)
#define USBFS_EPT1_RXSTS_SHIFT            (12)
#define USBFS_EPT1_RXSTS(x)               (x << 12)
#define USBFS_EPT1_RXDTS_MASK             (0x01 << 14)
#define USBFS_EPT1_RXDTS_SHIFT            (14)
#define USBFS_EPT1_RXDTS(x)               (x << 14)
#define USBFS_EPT1_RXTC_MASK              (0x01 << 15)
#define USBFS_EPT1_RXTC_SHIFT             (15)
#define USBFS_EPT1_RXTC(x)                (x << 15)
#define USBFS_EPT2_EPTADDR_MASK           (0x0f << 0)
#define USBFS_EPT2_EPTADDR_SHIFT          (0)
#define USBFS_EPT2_EPTADDR(x)             (x << 0)
#define USBFS_EPT2_TXSTS_MASK             (0x03 << 4)
#define USBFS_EPT2_TXSTS_SHIFT            (4)
#define USBFS_EPT2_TXSTS(x)               (x << 4)
#define USBFS_EPT2_TXDTS_MASK             (0x01 << 6)
#define USBFS_EPT2_TXDTS_SHIFT            (6)
#define USBFS_EPT2_TXDTS(x)               (x << 6)
#define USBFS_EPT2_TXTC_MASK              (0x01 << 7)
#define USBFS_EPT2_TXTC_SHIFT             (7)
#define USBFS_EPT2_TXTC(x)                (x << 7)
#define USBFS_EPT2_EXF_MASK               (0x01 << 8)
#define USBFS_EPT2_EXF_SHIFT              (8)
#define USBFS_EPT2_EXF(x)                 (x << 8)
#define USBFS_EPT2_TRANS_TYPE_MASK        (0x03 << 9)
#define USBFS_EPT2_TRANS_TYPE_SHIFT       (9)
#define USBFS_EPT2_TRANS_TYPE(x)          (x << 9)
#define USBFS_EPT2_SETUPTC_MASK           (0x01 << 11)
#define USBFS_EPT2_SETUPTC_SHIFT          (11)
#define USBFS_EPT2_SETUPTC(x)             (x << 11)
#define USBFS_EPT2_RXSTS_MASK             (0x03 << 12)
#define USBFS_EPT2_RXSTS_SHIFT            (12)
#define USBFS_EPT2_RXSTS(x)               (x << 12)
#define USBFS_EPT2_RXDTS_MASK             (0x01 << 14)
#define USBFS_EPT2_RXDTS_SHIFT            (14)
#define USBFS_EPT2_RXDTS(x)               (x << 14)
#define USBFS_EPT2_RXTC_MASK              (0x01 << 15)
#define USBFS_EPT2_RXTC_SHIFT             (15)
#define USBFS_EPT2_RXTC(x)                (x << 15)
#define USBFS_EPT3_EPTADDR_MASK           (0x0f << 0)
#define USBFS_EPT3_EPTADDR_SHIFT          (0)
#define USBFS_EPT3_EPTADDR(x)             (x << 0)
#define USBFS_EPT3_TXSTS_MASK             (0x03 << 4)
#define USBFS_EPT3_TXSTS_SHIFT            (4)
#define USBFS_EPT3_TXSTS(x)               (x << 4)
#define USBFS_EPT3_TXDTS_MASK             (0x01 << 6)
#define USBFS_EPT3_TXDTS_SHIFT            (6)
#define USBFS_EPT3_TXDTS(x)               (x << 6)
#define USBFS_EPT3_TXTC_MASK              (0x01 << 7)
#define USBFS_EPT3_TXTC_SHIFT             (7)
#define USBFS_EPT3_TXTC(x)                (x << 7)
#define USBFS_EPT3_EXF_MASK               (0x01 << 8)
#define USBFS_EPT3_EXF_SHIFT              (8)
#define USBFS_EPT3_EXF(x)                 (x << 8)
#define USBFS_EPT3_TRANS_TYPE_MASK        (0x03 << 9)
#define USBFS_EPT3_TRANS_TYPE_SHIFT       (9)
#define USBFS_EPT3_TRANS_TYPE(x)          (x << 9)
#define USBFS_EPT3_SETUPTC_MASK           (0x01 << 11)
#define USBFS_EPT3_SETUPTC_SHIFT          (11)
#define USBFS_EPT3_SETUPTC(x)             (x << 11)
#define USBFS_EPT3_RXSTS_MASK             (0x03 << 12)
#define USBFS_EPT3_RXSTS_SHIFT            (12)
#define USBFS_EPT3_RXSTS(x)               (x << 12)
#define USBFS_EPT3_RXDTS_MASK             (0x01 << 14)
#define USBFS_EPT3_RXDTS_SHIFT            (14)
#define USBFS_EPT3_RXDTS(x)               (x << 14)
#define USBFS_EPT3_RXTC_MASK              (0x01 << 15)
#define USBFS_EPT3_RXTC_SHIFT             (15)
#define USBFS_EPT3_RXTC(x)                (x << 15)
#define USBFS_EPT4_EPTADDR_MASK           (0x0f << 0)
#define USBFS_EPT4_EPTADDR_SHIFT          (0)
#define USBFS_EPT4_EPTADDR(x)             (x << 0)
#define USBFS_EPT4_TXSTS_MASK             (0x03 << 4)
#define USBFS_EPT4_TXSTS_SHIFT            (4)
#define USBFS_EPT4_TXSTS(x)               (x << 4)
#define USBFS_EPT4_TXDTS_MASK             (0x01 << 6)
#define USBFS_EPT4_TXDTS_SHIFT            (6)
#define USBFS_EPT4_TXDTS(x)               (x << 6)
#define USBFS_EPT4_TXTC_MASK              (0x01 << 7)
#define USBFS_EPT4_TXTC_SHIFT             (7)
#define USBFS_EPT4_TXTC(x)                (x << 7)
#define USBFS_EPT4_EXF_MASK               (0x01 << 8)
#define USBFS_EPT4_EXF_SHIFT              (8)
#define USBFS_EPT4_EXF(x)                 (x << 8)
#define USBFS_EPT4_TRANS_TYPE_MASK        (0x03 << 9)
#define USBFS_EPT4_TRANS_TYPE_SHIFT       (9)
#define USBFS_EPT4_TRANS_TYPE(x)          (x << 9)
#define USBFS_EPT4_SETUPTC_MASK           (0x01 << 11)
#define USBFS_EPT4_SETUPTC_SHIFT          (11)
#define USBFS_EPT4_SETUPTC(x)             (x << 11)
#define USBFS_EPT4_RXSTS_MASK             (0x03 << 12)
#define USBFS_EPT4_RXSTS_SHIFT            (12)
#define USBFS_EPT4_RXSTS(x)               (x << 12)
#define USBFS_EPT4_RXDTS_MASK             (0x01 << 14)
#define USBFS_EPT4_RXDTS_SHIFT            (14)
#define USBFS_EPT4_RXDTS(x)               (x << 14)
#define USBFS_EPT4_RXTC_MASK              (0x01 << 15)
#define USBFS_EPT4_RXTC_SHIFT             (15)
#define USBFS_EPT4_RXTC(x)                (x << 15)
#define USBFS_EPT5_EPTADDR_MASK           (0x0f << 0)
#define USBFS_EPT5_EPTADDR_SHIFT          (0)
#define USBFS_EPT5_EPTADDR(x)             (x << 0)
#define USBFS_EPT5_TXSTS_MASK             (0x03 << 4)
#define USBFS_EPT5_TXSTS_SHIFT            (4)
#define USBFS_EPT5_TXSTS(x)               (x << 4)
#define USBFS_EPT5_TXDTS_MASK             (0x01 << 6)
#define USBFS_EPT5_TXDTS_SHIFT            (6)
#define USBFS_EPT5_TXDTS(x)               (x << 6)
#define USBFS_EPT5_TXTC_MASK              (0x01 << 7)
#define USBFS_EPT5_TXTC_SHIFT             (7)
#define USBFS_EPT5_TXTC(x)                (x << 7)
#define USBFS_EPT5_EXF_MASK               (0x01 << 8)
#define USBFS_EPT5_EXF_SHIFT              (8)
#define USBFS_EPT5_EXF(x)                 (x << 8)
#define USBFS_EPT5_TRANS_TYPE_MASK        (0x03 << 9)
#define USBFS_EPT5_TRANS_TYPE_SHIFT       (9)
#define USBFS_EPT5_TRANS_TYPE(x)          (x << 9)
#define USBFS_EPT5_SETUPTC_MASK           (0x01 << 11)
#define USBFS_EPT5_SETUPTC_SHIFT          (11)
#define USBFS_EPT5_SETUPTC(x)             (x << 11)
#define USBFS_EPT5_RXSTS_MASK             (0x03 << 12)
#define USBFS_EPT5_RXSTS_SHIFT            (12)
#define USBFS_EPT5_RXSTS(x)               (x << 12)
#define USBFS_EPT5_RXDTS_MASK             (0x01 << 14)
#define USBFS_EPT5_RXDTS_SHIFT            (14)
#define USBFS_EPT5_RXDTS(x)               (x << 14)
#define USBFS_EPT5_RXTC_MASK              (0x01 << 15)
#define USBFS_EPT5_RXTC_SHIFT             (15)
#define USBFS_EPT5_RXTC(x)                (x << 15)
#define USBFS_EPT6_EPTADDR_MASK           (0x0f << 0)
#define USBFS_EPT6_EPTADDR_SHIFT          (0)
#define USBFS_EPT6_EPTADDR(x)             (x << 0)
#define USBFS_EPT6_TXSTS_MASK             (0x03 << 4)
#define USBFS_EPT6_TXSTS_SHIFT            (4)
#define USBFS_EPT6_TXSTS(x)               (x << 4)
#define USBFS_EPT6_TXDTS_MASK             (0x01 << 6)
#define USBFS_EPT6_TXDTS_SHIFT            (6)
#define USBFS_EPT6_TXDTS(x)               (x << 6)
#define USBFS_EPT6_TXTC_MASK              (0x01 << 7)
#define USBFS_EPT6_TXTC_SHIFT             (7)
#define USBFS_EPT6_TXTC(x)                (x << 7)
#define USBFS_EPT6_EXF_MASK               (0x01 << 8)
#define USBFS_EPT6_EXF_SHIFT              (8)
#define USBFS_EPT6_EXF(x)                 (x << 8)
#define USBFS_EPT6_TRANS_TYPE_MASK        (0x03 << 9)
#define USBFS_EPT6_TRANS_TYPE_SHIFT       (9)
#define USBFS_EPT6_TRANS_TYPE(x)          (x << 9)
#define USBFS_EPT6_SETUPTC_MASK           (0x01 << 11)
#define USBFS_EPT6_SETUPTC_SHIFT          (11)
#define USBFS_EPT6_SETUPTC(x)             (x << 11)
#define USBFS_EPT6_RXSTS_MASK             (0x03 << 12)
#define USBFS_EPT6_RXSTS_SHIFT            (12)
#define USBFS_EPT6_RXSTS(x)               (x << 12)
#define USBFS_EPT6_RXDTS_MASK             (0x01 << 14)
#define USBFS_EPT6_RXDTS_SHIFT            (14)
#define USBFS_EPT6_RXDTS(x)               (x << 14)
#define USBFS_EPT6_RXTC_MASK              (0x01 << 15)
#define USBFS_EPT6_RXTC_SHIFT             (15)
#define USBFS_EPT6_RXTC(x)                (x << 15)
#define USBFS_EPT7_EPTADDR_MASK           (0x0f << 0)
#define USBFS_EPT7_EPTADDR_SHIFT          (0)
#define USBFS_EPT7_EPTADDR(x)             (x << 0)
#define USBFS_EPT7_TXSTS_MASK             (0x03 << 4)
#define USBFS_EPT7_TXSTS_SHIFT            (4)
#define USBFS_EPT7_TXSTS(x)               (x << 4)
#define USBFS_EPT7_TXDTS_MASK             (0x01 << 6)
#define USBFS_EPT7_TXDTS_SHIFT            (6)
#define USBFS_EPT7_TXDTS(x)               (x << 6)
#define USBFS_EPT7_TXTC_MASK              (0x01 << 7)
#define USBFS_EPT7_TXTC_SHIFT             (7)
#define USBFS_EPT7_TXTC(x)                (x << 7)
#define USBFS_EPT7_EXF_MASK               (0x01 << 8)
#define USBFS_EPT7_EXF_SHIFT              (8)
#define USBFS_EPT7_EXF(x)                 (x << 8)
#define USBFS_EPT7_TRANS_TYPE_MASK        (0x03 << 9)
#define USBFS_EPT7_TRANS_TYPE_SHIFT       (9)
#define USBFS_EPT7_TRANS_TYPE(x)          (x << 9)
#define USBFS_EPT7_SETUPTC_MASK           (0x01 << 11)
#define USBFS_EPT7_SETUPTC_SHIFT          (11)
#define USBFS_EPT7_SETUPTC(x)             (x << 11)
#define USBFS_EPT7_RXSTS_MASK             (0x03 << 12)
#define USBFS_EPT7_RXSTS_SHIFT            (12)
#define USBFS_EPT7_RXSTS(x)               (x << 12)
#define USBFS_EPT7_RXDTS_MASK             (0x01 << 14)
#define USBFS_EPT7_RXDTS_SHIFT            (14)
#define USBFS_EPT7_RXDTS(x)               (x << 14)
#define USBFS_EPT7_RXTC_MASK              (0x01 << 15)
#define USBFS_EPT7_RXTC_SHIFT             (15)
#define USBFS_EPT7_RXTC(x)                (x << 15)
#define USBFS_CTRL_CSRST_MASK             (0x01 << 0)
#define USBFS_CTRL_CSRST_SHIFT            (0)
#define USBFS_CTRL_CSRST(x)               (x << 0)
#define USBFS_CTRL_DISUSB_MASK            (0x01 << 1)
#define USBFS_CTRL_DISUSB_SHIFT           (1)
#define USBFS_CTRL_DISUSB(x)              (x << 1)
#define USBFS_CTRL_LPM_MASK               (0x01 << 2)
#define USBFS_CTRL_LPM_SHIFT              (2)
#define USBFS_CTRL_LPM(x)                 (x << 2)
#define USBFS_CTRL_SSP_MASK               (0x01 << 3)
#define USBFS_CTRL_SSP_SHIFT              (3)
#define USBFS_CTRL_SSP(x)                 (x << 3)
#define USBFS_CTRL_GRESUME_MASK           (0x01 << 4)
#define USBFS_CTRL_GRESUME_SHIFT          (4)
#define USBFS_CTRL_GRESUME(x)             (x << 4)
#define USBFS_CTRL_LSOFIEN_MASK           (0x01 << 8)
#define USBFS_CTRL_LSOFIEN_SHIFT          (8)
#define USBFS_CTRL_LSOFIEN(x)             (x << 8)
#define USBFS_CTRL_SOFIEN_MASK            (0x01 << 9)
#define USBFS_CTRL_SOFIEN_SHIFT           (9)
#define USBFS_CTRL_SOFIEN(x)              (x << 9)
#define USBFS_CTRL_RSTIEN_MASK            (0x01 << 10)
#define USBFS_CTRL_RSTIEN_SHIFT           (10)
#define USBFS_CTRL_RSTIEN(x)              (x << 10)
#define USBFS_CTRL_SPIEN_MASK             (0x01 << 11)
#define USBFS_CTRL_SPIEN_SHIFT            (11)
#define USBFS_CTRL_SPIEN(x)               (x << 11)
#define USBFS_CTRL_WKIEN_MASK             (0x01 << 12)
#define USBFS_CTRL_WKIEN_SHIFT            (12)
#define USBFS_CTRL_WKIEN(x)               (x << 12)
#define USBFS_CTRL_BEIEN_MASK             (0x01 << 13)
#define USBFS_CTRL_BEIEN_SHIFT            (13)
#define USBFS_CTRL_BEIEN(x)               (x << 13)
#define USBFS_CTRL_UCFORIEN_MASK          (0x01 << 14)
#define USBFS_CTRL_UCFORIEN_SHIFT         (14)
#define USBFS_CTRL_UCFORIEN(x)            (x << 14)
#define USBFS_CTRL_TCIEN_MASK             (0x01 << 15)
#define USBFS_CTRL_TCIEN_SHIFT            (15)
#define USBFS_CTRL_TCIEN(x)               (x << 15)
#define USBFS_INTSTS_EPT_NUM_MASK         (0x0f << 0)
#define USBFS_INTSTS_EPT_NUM_SHIFT        (0)
#define USBFS_INTSTS_EPT_NUM(x)           (x << 0)
#define USBFS_INTSTS_INOUT_MASK           (0x01 << 4)
#define USBFS_INTSTS_INOUT_SHIFT          (4)
#define USBFS_INTSTS_INOUT(x)             (x << 4)
#define USBFS_INTSTS_LSOF_MASK            (0x01 << 8)
#define USBFS_INTSTS_LSOF_SHIFT           (8)
#define USBFS_INTSTS_LSOF(x)              (x << 8)
#define USBFS_INTSTS_SOF_MASK             (0x01 << 9)
#define USBFS_INTSTS_SOF_SHIFT            (9)
#define USBFS_INTSTS_SOF(x)               (x << 9)
#define USBFS_INTSTS_RST_MASK             (0x01 << 10)
#define USBFS_INTSTS_RST_SHIFT            (10)
#define USBFS_INTSTS_RST(x)               (x << 10)
#define USBFS_INTSTS_SP_MASK              (0x01 << 11)
#define USBFS_INTSTS_SP_SHIFT             (11)
#define USBFS_INTSTS_SP(x)                (x << 11)
#define USBFS_INTSTS_WK_MASK              (0x01 << 12)
#define USBFS_INTSTS_WK_SHIFT             (12)
#define USBFS_INTSTS_WK(x)                (x << 12)
#define USBFS_INTSTS_BE_MASK              (0x01 << 13)
#define USBFS_INTSTS_BE_SHIFT             (13)
#define USBFS_INTSTS_BE(x)                (x << 13)
#define USBFS_INTSTS_UCFOR_MASK           (0x01 << 14)
#define USBFS_INTSTS_UCFOR_SHIFT          (14)
#define USBFS_INTSTS_UCFOR(x)             (x << 14)
#define USBFS_INTSTS_TC_MASK              (0x01 << 15)
#define USBFS_INTSTS_TC_SHIFT             (15)
#define USBFS_INTSTS_TC(x)                (x << 15)
#define USBFS_SOFRNUM_SOFNUM_MASK         (0x7ff << 0)
#define USBFS_SOFRNUM_SOFNUM_SHIFT        (0)
#define USBFS_SOFRNUM_SOFNUM(x)           (x << 0)
#define USBFS_SOFRNUM_LSOFNUM_MASK        (0x03 << 11)
#define USBFS_SOFRNUM_LSOFNUM_SHIFT       (11)
#define USBFS_SOFRNUM_LSOFNUM(x)          (x << 11)
#define USBFS_SOFRNUM_CLCK_MASK           (0x01 << 13)
#define USBFS_SOFRNUM_CLCK_SHIFT          (13)
#define USBFS_SOFRNUM_CLCK(x)             (x << 13)
#define USBFS_SOFRNUM_DMSTS_MASK          (0x01 << 14)
#define USBFS_SOFRNUM_DMSTS_SHIFT         (14)
#define USBFS_SOFRNUM_DMSTS(x)            (x << 14)
#define USBFS_SOFRNUM_DPSTS_MASK          (0x01 << 15)
#define USBFS_SOFRNUM_DPSTS_SHIFT         (15)
#define USBFS_SOFRNUM_DPSTS(x)            (x << 15)
#define USBFS_DEVADDR_ADDR_MASK           (0x7f << 0)
#define USBFS_DEVADDR_ADDR_SHIFT          (0)
#define USBFS_DEVADDR_ADDR(x)             (x << 0)
#define USBFS_DEVADDR_CEN_MASK            (0x01 << 7)
#define USBFS_DEVADDR_CEN_SHIFT           (7)
#define USBFS_DEVADDR_CEN(x)              (x << 7)
#define USBFS_BUFTBL_BTADDR_MASK          (0x1fff << 3)
#define USBFS_BUFTBL_BTADDR_SHIFT         (3)
#define USBFS_BUFTBL_BTADDR(x)            (x << 3)
#define USBFS_CFG_PUO_MASK                (0x01 << 1)
#define USBFS_CFG_PUO_SHIFT               (1)
#define USBFS_CFG_PUO(x)                  (x << 1)
#define USBFS_CFG_SOFOUTEN_MASK           (0x01 << 0)
#define USBFS_CFG_SOFOUTEN_SHIFT          (0)
#define USBFS_CFG_SOFOUTEN(x)             (x << 0)


#define CRM_SCLK_HICK (0x00)
#define CRM_SCLK_HEXT (0x01)
#define CRM_SCLK_PLL (0x02)

#define CRM_AUTO_STEP_OFF (0x0)
#define CRM_AUTO_STEP_ON (0x3)

#define __FPU_PRESENT 1
// TODO add MPU support
#define __MPU_PRESENT 0
#define __CM4_REV 0x0001U
#define __NVIC_PRIO_BITS 4
#define __Vendor_SysTickConfig 0
#define VECT_TAB_OFFSET 0x0 
#define HICK_FREQUENCY ((uint32_t)8000000) // 48MHz in DS, but /6 prescalar is on by default 
#define HEXT_FREQUENCY ((uint32_t)8000000)

